{
  "guid": "6a1e5f24-8c8d-33b4-a254-8e217be5b4ac",
  "title": "Episode 513: Scott Frey - Cerebral Performance",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. Whether you are a brand new runner or you already have a great mustache, we're here to help you increase your running knowledge and present it at a practical level. This is The Running Public. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. Yeah, interested in the conversation. Running was my original love, but kind of tossed me under the bus after about 40 years of racing and doing different foolish things. So I developed some kind of cartilage problems in a knee, but I had a good bunch of decades there of having running at the center of my universe. What kind of cartilage problems? Medial meniscus, both knees, deterioration. Can't put Humpty Dumpty back together again. It's kind of a, man, I'm 60 years old and I started running competitively in my late teens and I was part of the excessive 80s, you know, where everybody ran triple digits. You go to any little town in America and people would be cranking out 100 plus mile weeks. And yeah, it was great while it lasted. That was a tough time to be a runner. Big mileage, little shoes. Big mileage, really little shoes, much cheaper. But yeah, it was, but it was exciting. And you know, this was the level of technology was like this, right? Just your time, which is a cool thing. Or just the clock sitting on top of your fridge at home, like mine was. We're not nearly as old as you, Dr. Frey. Either that or you really figured something out, man. Very little figured out. The listeners would know that. I saw, so we were going to do this maybe a couple of weeks ago and then I'll tell you what, I want to listen to people who are still doing the thing. Yeah. And you're still doing the thing. In fact, you were just in Switzerland, I believe, competing. You were doing cross country skiing. I believe it was, what was it? The Masters World Cup. And I've recently entered the Masters. I'm 41 to be 42. So I got some time to catch up to you, but I'm pushing pretty hard. Bracken's in his late 30s, pushing pretty hard. And so when I heard you were traveling across waters to compete in like a Masters World level event, I was like, all right, now I'm really glad we're talking to this guy because I respect the heck out of people who walk the walk, who also teach, right, to sport. And so anyways, how did it go in Switzerland? Oh, what an experience that was. You know, between career and kids, I've taken, I always kept training, but I always had big gaps where I didn't compete just because life was too complicated. We moved around a lot. I lived on the East Coast and worked at University of Massachusetts and Dartmouth College, then moved to University of Oregon, then University of Missouri. And, you know, always kept the running going, was in and out of triathlon. I was a triathlete in the 90s. Took up cross country skiing kind of early, but never had any guidance. And so now here I am at 60, as I was mentioning, no longer able to run. So what do I do? Well, I get back into cross country skiing and I started racing bicycles again. And yeah, I'm kind of having this second go round. So I left academia after 30 years. I was a tenured full professor, ran the brain imaging center at U Oregon and at U Missouri. Decided it was time for a change. Maybe we'll touch on some of that led me to what I'm doing now. But part of that also allowed me to get back into competition, which is really great. So the Masters World Cup in cross country skiing is a really special thing. There were people there from 30 countries. It's run by FIS, which is the International Federation that oversees all competitive skiing and really high level fields. But the opportunity to get on a starting line and race like 40, 50 other guys who are your age is a rare thing and a very special thing. So it went pretty well. And I'm already excited to get ready to go to Italy next winter. But I've got a big bike racing season plan between now and then. So yeah, I have some questions about cross country skiing with you. And you actually, well, Bracken could probably use some tips because Bracken's taken his hand at cross country skiing. How's that gone, Bracken? Awesome. I'm not much of an athlete. He's a very good athlete. And it's the one thing he's tried that he didn't pick up like that. And it drives him nuts. Skate skiing, of course. Yeah, I had two meniscectomies, one per knee. And I bought cross country skis. I thought skate ski, it's sports specific. I'm going to do this. I went out there. I thought, I'm an athlete. I will teach myself. And I was terrible. And I went back the next day and I was terrible. And I have not got back on the skis yet since then. And that was three years ago. It's just like the bane of my existence is the fact that Kirk can ski fast and I can't ski slow. And it's terrible for our relationship. Well, I'll tell you what. Skiing is a very technique-dependent sport. Reminds me a lot of swimming. I came late to competitive swimming because I wanted to do triathlons. And I used to get in the pool with the kids that my friend coached at Amherst College when I was a prof at UMass Amherst. I'd get up in the morning and go do their early morning swim workouts and just getting pummeled by these college swimmers. And you really like skiing. You have to learn the technique properly or you're just going to always – you're never going to out-muscle it. Let's just put it that way. So, hey, man, free ski lesson if you're ever in Fort Collins, Colorado. Drop by. We'll go. We just went to Sweden. I got back last night late. And as we were getting our luggage out, I knocked over my skis. And I thought, they're still here. I should just sell these. But it would be such an admittance of failure. Just like admitting an admission of failure. Just saying that these tiny little things beat you. So I'm just going to hang on to them and maybe next winter give it a go. I love it. And I'll tell you what. It's really much kinder. Are you running still with the meniscectomies? Yeah. Yeah, I have 40% left in one knee and like 45% in the other. And it's enough that I can run and it continually frustrates me. Yeah, that's interesting. I fought through that for four years before I just decided to pull the parachute because I could still do these other things. And skiing and cycling really allow me to be competitive without being in pain. It's funny. I love gear and shoes and tech and all that. And yet I hate being reliant upon gear to locomote. And so that's been my barrier right there. So all the more power to you. I feel you. I miss the simplicity of being able to run wherever I am and throw those shoes in a bag and get on an airplane and go. So I get it. I can link you two up because Dr. Frey has competed in the Berkebiner. And we are both within earshot of where that happens. Oh, wow. Well, Bracken's in Wisconsin. I'm just over the river in the Twin Cities metro. Beautiful. So we're not far. In fact, you were reading your bio. You took second in the open division, the 50K or the amateur division. Is that right? At the Berkey? That's a huge deal. We all know how big the Berkey is in this region. And anybody that goes and performs there, it's like hats off to you. When was that? So that would have been 2023, I think. It was my return to competitive skiing. I was living in St. Louis at the time. We had gotten this place in Fort Collins, Colorado, and I got on snow a bit. But I was mainly just roller skiing. And I thought, well, they had this open skate where you could basically do a time trial on the Berkey course, the full 50K, the same as the mass start race. And I thought, well, you know, I'm just going to go up there and do that, see how that goes. And my expectations were very modest. I ended up having a really great day. In fact, I was leading until pretty late in the race when I got passed by some guy from Park City and ended up, yeah, second place overall, which was very cool and sort of got me excited to get back into this. Not masters, overall. Overall. Yeah, but that wasn't the mass start, you know, deal. So it was just based on time. It's a giant time trial. So perfect for runners. Yeah. By the way, I'm Scott Fry. I know everyone gets it wrong, but I just thought I'd throw that out there. My bad. We actually should probably introduce you. We haven't officially really introduced you, have we? Properly. We're really bad at that on this podcast. In fact, Bracken, what, maybe we forget to introduce like three quarters of our guests. We just get right into it. I love it. It's too official. It feels like, all right, and question one begins. No, that's not how we do it. But Dr. Scott Fry, I'm so sorry. You are founder of Cerebral Performance and you're a cognitive neuroscientist. That's right. And what I'm gathering, and you've been doing this for a long time. And what I wanted to do is, you know, you have an entire resume as an athlete and you have an entire resume as a cognitive neuroscientist. And I think what we'd like to do is start with the athlete side. I mean, Bracken, you cool with that? Start at the beginning. Well, you know, I think a lot of people listening can relate because they're all probably going through their own athletic journey, right? That's why they listen to this. Now we can get into the gritty because I'm super curious actually about, I don't know, understanding how the brain works and the philosophy about how the brain can unlock performance. We always think it's what our body from the neck down is what unlocks it, but it's really maybe not so much, right? And so I think we save that just so after we get to know you as an athlete, because I want to hear about the resume and like getting into sport and origin of it all for you because our running, I wouldn't you say probably our listener base is predominantly runners. We have a few on the fringe and other endurance sports, but you started as a runner. That's correct? Yeah, it is. Walk us through that. Yeah, so I messed around with ball sports as a kid. My mom raised me by herself and she had MS, so she wasn't out there tossing the ball around with me. I was an only kid and I was not so good at ball sports. Turns out you're not good at things you don't really work on, right? Played a little high school basketball and then entered a running race, I think it was in 1980. No, when would that have been? Yeah, maybe it was 1980. And man, it was awful. I went out hammering out of the start line like all 15, 16-year-old kids do. And then the bear got on my back at about three quarters of a mile in, but somehow I finished this thing. It was a 10K. And I just wanted to do it again and again and again. So I started running and training. I didn't race that much. I just liked the training. And what I was finding is that it was changing the way I lived the rest of my life. And that was the cool thing. So I have a very strange trajectory in my sporting world and in my career life. I dropped out of high school to help support my mom when I was 16. She raised me on Social Security disability benefits. She'd been a nurse and ended up being disabled. So we didn't have a lot of money and went to work. And this all happened around the time that I discovered running. And what running really taught me is that if you get up every day and you do the thing, you will improve. You will grow stronger. You will get better. And that led me to get into the local community college, got my general equivalency diploma, ended up going to the local four-year college, ended up going to Harvard University to get a master's degree after that because things went well for me at the local college. Went down to Cornell, got my PhD. And in the space of 10 years, I went from high school dropout to university professor at the University of Massachusetts. And I don't think any of that would have happened had I not run that first race and had I not gotten hooked on the power of endurance sports for really changing lives. And I've seen it just happen over and over. And while my focus of my work now is primarily elite athletes who are incredibly hardworking and incredibly talented, I've spent a lot of time with all manner of athletes over the course of my 60 years on this earth. And I've just seen this kind of thing, the kind of power of these sports to change people over and over and over. So from very humble beginnings in my little town in upstate New York, my athletic journey that you asked about, I was just a trainer. So my friend who's a coach always asks his athletes, are you a trainer or a racer? And my answer was always, I'm a trainer. Just love the day-to-day. Would go to the track, run intervals, even if there was no race in my future, no intentions to race, just dig the sense of accomplishment you get from pushing yourself. And ran a lot of mileage in the 80s, then got into triathlon toward the late 80s and really got excited about that when it was, I think, a pretty new sport, a fun sport. Did an Ironman in Canada, did a bunch of other racing, won the New England long distance championship, I don't know, 96 or 1997 up at Lake Sunapee in New Hampshire. Then I have kids and my career demands got to be more and triathlon is not very practical to pursue at a high level when you're doing that. So went back to just running on my own for many years. Moved to Eugene, Oregon, sort of hub of running, right? And ran a few races in that community. I'm not a world-class runner, but I just love the sport, love being in that milieu. I went up to Bend, Oregon sometime in there and won the age group in my late 40s at the XTERRA Trail Running Championships. And then shortly after that, the meniscus fell apart in the left knee and the right knee, and I kind of kept running through it thinking it was a soft tissue injury, but it was the end of my running. But it allowed me space to get back into bike racing and get back into cross-country skiing. And so here we are now. And I kind of split my time between those different things, occasionally jump in the pool again, but just love the lifestyle and have the privilege now of merging together my scientific life, which developed over a long three decades, and my athletic life and bringing what I learned as a brain scientist and behavioral scientist to bear on improving endurance athletes. So Kirk and I did the ball sport thing, then the running took over. It was the thing we could do furthest into sport. And then we got into fringe running. And what we learned along the way is obviously most runners don't try other things. They look down on triathletes, triathletes look down on Xterra, Xterra looks down on, you know, that's just the way it goes. Why were you kind of the exception? You're the one that along the way did the other things, which allowed you to go back to it when running was taken, but why were you drawn to the other pieces? Yeah, you know, I think I always thought of myself even early on as more of an athlete than a runner. And I still think of myself as not like a skier or a cyclist. I think of myself as an athlete first and do those other things in addition to that. So I was really drawn to the idea that you could do multiple sports, right? And plus that allowed me to train more, which really helped to scratch the itch, right? I'm also a big guy. I, you know, since I'm the same height and weight that I've been since age 16, which is like 80 kilos or 176 pounds, pretty much on the dime all the time. It's not changed very much. It's maybe gone, at my lowest when I was running, I might've gotten, you know, 15 pounds lighter than that, but that wasn't natural for me. I'm 6'2\", and I'm a big dude. I have, you know, size 13 or 48 shoes that, you know, so I think that's part of it too, realizing there was a cap on what I could achieve as a distance runner, I think because of my physiology. So it lent itself better to some of these other sports. It's interesting. The people that do that seem to go longer into life with joy for it. You mentioned Xterra. We've competed and crossed paths with like Josiah. And then you mentioned Bend and Eugene and stuff, and we've crossed paths with Max King. And those kind of guys are the people who are still playing at 40 and at 45. And you seem to still be kind of playing a bit. You don't talk about it nostalgically. You talk about it, you have a little bit of like an eye twinkle when you're saying these things. Oh yeah, I'm super fired up. I'm having sort of my second go around now. You know, the kids are out of the house. I don't run a lab anymore. I'm working for myself. I have more control over my time. I'm not having a lot of work travel. I'm just excited to get after it, you know? We're like, aren't you nervous about turning 60? And I said, no, I get to stop racing the 50-year-olds. Thank you. It's awesome, man. I want all the athletes I work with to have that attitude. And I tell them that. I said, I want a real success here is that, yeah, we're going to try and accomplish your goals. And I've got an, you know, I work with athletes who are aiming at the Olympics. I've worked with an athlete who's been to several Olympics already in triathlon. Those are incredible athletes. I was never anywhere near their level in anything. But I also wish for them, and I tell them this, that when they're 60, they'll still be enthusiastic about their sport. And that's a real success for me. I think I'm lucky. I think Bracken's lucky. You're probably lucky too. Running was punishment for a lot of sports. But if running was your chosen sport when you were younger, even though you didn't compete for your school, we'll say, it sounds like... No, I didn't. We chose the one most accessible thing to do into perpetuity without the need for organized sports, other than maybe a pair of shoes, right? You can walk out your front door. I can't think of any other sanctioned... Am I missing anything maybe by saying that? Any other sanctioned high school or collegiate sport, which you can just actually walk out your door and do without needing others or equipment? Is there anything? Nothing comes to mind. It's dumb luck, probably. We all stumbled into it, but nonetheless. Right. You said something... I forget the exact phrase, but running makes everything better or running facilitates positivity in life outside of running, right? Which I firmly agree with. What did you mean by that in your words? Maybe a little more specifically. Yeah, so what I think running does... Well, you know, there's a lot of literature, and we could talk about that from the neuroscience perspective on how physical activity affects the brain and how physical activity in turn through the brain affects things like mood, right? It's very powerful, and the effect is bigger than antidepressants. Absolutely. But another thing that running does, at least it did for me, and I've seen it for other people too, and endurance sports in general, is it really helps to reinforce a work ethic because of what I mentioned earlier. You get out of it what you put into it. You can see and track the improvement. It's not linear, but if you get up and do the thing consistently, you're going to improve. And there's something incredibly reinforcing about that to me, the predictability of that, the strength and resilience that comes from doing things that are hard even when you don't want to, even when it's pissing rain outside and it's like 37 degrees, and there are all sorts of reasons you'd love to talk yourself out of that. But doing that and getting through it, man, I think there's a lot of transfer of that kind of resilience to resilience in the rest of life. At least there has been for me. Yeah, I very much agree with that. And I figured that's what you had meant by it, but it's good to hear you expand on it. Can I dig into your past just a little bit before we get to the neuroscience nerdery maybe? What job did you work in high school when you were helping the fam? So originally at age 14 and 15, I was working under the table at full-time hours after school, nights to late at night in an Italian restaurant with my best friend. And we were like prep cooking, doing dishes, busing tables, all that kind of great stuff for like a pittance, all under the table. We were big shots. We had money. We got to buy our own clothes and all that kind of stuff. And then right before I left school, I started working as a landscaper, which might sound more glorious than the reality of what I was. I was the guy on the other end of the shovel, basically. So a lot of physical work. And I remember around that first time I bought my first road bike. This brand new Trek road bike. And I somehow would have the energy after a long day of landscape to go home and hop on that thing. And I remember the first time I did this ride and I went in and told my boss, how far did you go? And I was 18 miles. And he was just like, that's incredible. You rode your bike 18 miles, you know? And at the time it did feel really incredible, you know? And now that's like, just, okay, that's a coffee shop recovery day spin, of course, right? But yeah, those are my jobs. Those are my jobs. And then from there, you know, when I went back to work, I worked a little as a bartender when I was in college and things like that. And then next up was college professor. Kind of weird. Well, yeah, I'm trying to figure this all out here, Dr. Fry. Yeah. Okay, so you made money to support, to help contribute to the household as a high school aged boy. Had some change to still, let's say, buy some things of interest for yourself, a bike and things like that. You would think like high school dropout, deviant from center, getting into trouble, not running with the right crowd or at least having direction. I just want to, I can't imagine, like those were such pivotal years for me in sport and then self-confidence in my social circles, Bracken the same, I imagine, right? Like those were years I can't imagine not having. How do you think that, like, how did you navigate that without screwing up? Well, it was really stressful. Let me tell you. And, you know, there were physiological costs to that. I developed an ulcer at age 16. Like, who does that, right? Nobody. One person. Yeah. And as I was leaving high school, my thought was, well, there it goes, right? I don't see my way out of this. And the funny thing is I always loved learning. And my mom was, and my grandfather in particular, super bright, very well-read people, but not wealthy, not able to really, you know, we were really on the margins. We lived in a very old, run-down trailer park kind of deal and so on. So it didn't feel like I had a lot of options. And through education, again, and I think really I credit the running with teaching me how to just be kind of doggedly persistent. I was able to kind of work my way out of that through school. So prior to this, I was a special educator at an alternative high school. Oh, wow. And every single thing we did was preventing you from making the choice to disengage from this classic system. Because best of intentions generally don't matter. The statistics say you are infinitely less likely to ever go back and get your GED if you leave the school. So why did you continue on? Obviously, from the start, you were wired differently. You're not the typical dropout, right? But what was the reason you were able to stay the course and continue on with the plan? Because one year leads to two. And we know how that goes, especially when you're making money or when there's other people on the line. Why did you get back to it? Yeah, so a couple of things changed. My mom, when I turned 16, the Social Security disability benefit thing changed where my mom was able to move into an assisted living kind of situation that was really good for her, but I couldn't stay with her. So I would live with my grandparents and then kind of look after my mom a little bit, you know, surreptitiously. I'd kind of like going in and out, trying to keep a low profile. And I was sort of living with my mom, sort of living with my grandparents. The other thing that happened was that at that community college, I met a mentor. And I think that's an absolutely critical part of this story. And how I met that mentor was through running. And he was a professor at the community college. And soon enough, I was taking his introductory psychology course. And his name was John Rybash. He's passed away, unfortunately. But he was a committed daily runner, like a seven-day-a-week, minimum of an hour a day guy, ran Boston multiple times and New York multiple times. And it was right at that time where I was getting into all these endurance sports. And it just was so fortunate that those stars aligned at that time. And I think John's mentorship and me seeing him as an example of what was possible if I stayed the course made a lot of difference. I don't think it would have happened without him, actually. That makes sense. It's usually that one connection. So an answer to your question, I think the point is I wouldn't want to replicate my experiment. There were a lot of serendipitous kinds of things that happened, you know, that just kind of made it possible. But what also made it possible was really doggedly pursuing that path. So did you know right away what the path wanted to lead towards? Or you were going to pursue it and it revealed itself to you? Yeah, so I started out with like freshman English at night school while I worked A, right? Because I couldn't just go directly from being a high school dropout to full-time community college and all that great stuff. Once I got the GED, I could get financial aid, which made a huge difference. And then I could go full-time. And so I switched back to working nights at restaurants and going to school full-time during the day. That was huge. Starting to see why you made a decent multi-sport athlete. Yeah, I was kind of opportunistic, right? So as I look back on it and yeah, I wouldn't want to replicate the experiment and a lot depends on luck. And my kids have had a very different life than the one that I had early on. But I do think that it made me a better athlete. And I think as rough as those times were, they kind of helped to be my launching pad for my career success too. Because it taught me this kind of, it helped me to be more resilient than I think I might have otherwise. So you went community college, Harvard, did you say? No, community college then to the four-year college that was local, which is Utica College. It used to be part of Syracuse University when I lived there. Then from there, I did really well at the four-year college. And from there, I went and got a master's at the School of Education at Harvard in human development. And then from there, I got into the PhD at Cornell. Okay, but back to, I think you were asking, how did you end up, you graduate with your PhD. And first of all, how did you end up there? And what was your thesis or your final dissertation? And then what did you do right out of school? And then sort of the timeline to like, I mean, it's going to be a lot of fast forwarding, but how we ended up here. Yeah, so 1983 was the year I dropped out of high school. And 1993 was the year I graduated with my PhD at Cornell. So 10 years for all this to happen, which seems very remarkable to me. I've asked my kids, how long do you think that took? And they're like, 30 years? I don't know. To me, it seems kind of remarkable too. A lot can happen in 10 years. A lot can happen in a short period of time. I'm sorry, I lost track of the question that you asked. Oh, it was just, I guess you get done. First of all, I guess what was your focus when you finished up with your PhD? What did you jump right into career-wise? And then how did we end up here? Yeah, so my focus in my PhD was on understanding how our brains make sense of the visual stimuli coming in through our eyes. So how do we recognize objects and people and make sense of those patterns of light that are falling on our eyes? Perception and understanding how our perceptions of the world that are created in our brains relate to what's actually out there physically. And did a lot of really nitty gritty research on that. And then got very interested in how we use perceptual information to control our actions in the world. And that's what led me to focus my work on the brain and performance eventually. Although at the time that I finished my PhD, it was very difficult to study the brain. We didn't have a lot of tools and techniques, but those were coming pretty fast. So from my PhD at Cornell, I was fortunate enough to get a faculty position at University of Massachusetts in Amherst. And I went directly there in 1993 in the fall. And then got really excited about the possibility provided by these new technologies like functional magnetic resonance imaging, where we could study not only the structure of the brain in living human beings, but also see the functional activation in different areas of the brain when people were doing particular tasks like planning an action or imagining a movement. Very interested in those particular questions. And that led me to leave my job and go up to Dartmouth College in New Hampshire, where they had one of the first research dedicated brain imaging research centers. And I spent seven years up there really learning that technology and how to use it. Then went to University of Oregon as I began my professorship, assistant professorship over again and directed the brain imaging research center. How much of this stems from MS to begin with? A lot. Yeah. A lot. Yeah, I think so. So I don't think it's any accident that I ended up focusing my scholarly work on the brain and on neuroscience. And along the way, a fair bit of our research on the brain and human performance had implications not only for performance in healthy adults and skill learning and action and all the things we're interested in, but also for rehabilitation. There are a lot of parallel, there are a lot of crossover points between those two worlds. It seems like running is one. Absolutely. Yeah, I was wondering if there's a slight selfish pursuit with it almost because it's a big curiosity itch. Is that part of it maybe? Like you're very curious about it, applicable to yourself and obviously others, but is there any of that there? Oh, a ton. Yeah. And so it always was the case that I think my, you can imagine that all through these different jobs that I'm talking about, I was also running a lot, or I was running and swimming and biking a lot, or I was running, swimming, biking and cross-country skiing in my free time. And that I think is where a lot of the ideas for the research in the lab came from. We did a ton of work. We did some of the early work on understanding what does it mean when we imagine a movement, right? And how does mentally rehearsing a movement, imagining a movement influence our ability to perfect that movement as a skill? And what is the circuitry involved in that in the brain? And how is that driving these changes or neuroplasticity in the brain and so forth? How can that be harnessed in the context of sport? How can that be harnessed in the context of rehabilitation and so forth is an example of the kind of things we did. So were you mostly teaching or mostly researching over the years? You know, I did a fair amount of teaching over the years, but because I was also for a big part of my career, about 20 years of it, I was directing brain imaging research centers at Oregon and then University of Missouri, Mizzou. I had a lower teaching load during those times than most people, but I always loved teaching. And I always had a big lab where I trained. I think over the course of my career, I had 17 postdoctoral fellows. So people with PhDs from North America and from other countries who came to train and get a post PhD experience in my lab. I always had a lot of graduate students who trained in my lab and a lot of undergrads too. So there was an opportunity for me to be a mentor to other people as I mentioned, John Rybash had been to me really early in my career. So something I really value and it's something I also get to experience now that I'm working with athletes. You know, the bulk of my athletes are half my age or younger. And I find that there's a big part of what I do. Yes, we do a lot of science backed brain endurance training and all sorts of things that we can always get into if you'd like. But there's a big part of it too that is kind of mentoring. So when did you make the switch to the athletic clientele? Yeah, so in January of 2023, and it took a while. I had planned, it took a while to shut down a big laboratory and make sure that the people who worked in the lab had other places to go and so forth. That took about six years, but I set that plan in motion around 2017. So pre-COVID and then- The long game. The long game. And by 2023, I was ready to go. So in January of 2023, I announced to my colleagues that, yep, I'm the lunatic who's giving up a fully tenured endowed professorship, which kind of doesn't happen that often in the academic world. And I'm going on a new adventure. Why? Yeah, I think part of it is what Kirk mentioned earlier. You know, well, maybe you didn't mention this. You can give me credit, it's fine. I thought you were going toward this. But, you know, I think it's really important to be excited about what you do. And for 30 years, I was very excited about what I was doing, but I was also bothered because I kept seeing all this interesting science in my world that was never making its way out into practice, particularly in the athletic realm, where I had kind of half of my brain being preoccupied with all the time. And I would look at, I interacted a lot with the sports scientists at my different institutions I was at, and we'd have these conversations. Sometimes we'd be out training together or over coffee or whatever it was, and I'd sit in on dissertations of their students and things. And I'd say, you know, exercise physiology is amazing, but you guys look at everything from the neck down. Like there's so much going on from the neck up that's completely ignored in all of this. And it's just a really artificial thing. So I see all this science and potential to integrate that stuff in a way that could potentially revolutionize how people train and compete. And it's just dying in these kind of dusty library journals that a few nerds like me read. So I got excited about the potential to mine that stuff and try to take some new approaches with actual people in the real world. While I still have the energy to, right? Because, you know, here I am at 60, 10 more years I'm 70. 10 years after that I'm 80. It's not like I'm going to have an infinite number of years where I can have the energy and desire to do these things. So it seemed like time. It's interesting. I once had someone explain to me the importance of the core using computer terms. Okay. And that if you have a part that is bottlenecking or throttling the other parts, it doesn't matter how powerful the other pieces are. If they're all getting bottlenecked by the one piece that controls the flow of the power and that the core is that to an athlete. It doesn't matter what you can put out other places. If it's all leaking out there or not getting through, you're not transferring power well, that your other work becomes not as useful. And it seems like your field takes that stance from a neural standpoint. Yeah. You're just going to underclock your CPU if you can't have it together above the neck. Well, I agree completely with that. I'm not an unbiased guy, right? I'm coming at things from the neck down. But I think there's a bunch of research to back that up. And why then, with all the popular training styles, which change every few years, if it exists, why do you think there's a lack of implementation in the athletic field? Yeah, it's interesting. I think part of it has to do with history. I think part of it has to do with the silos that we live in as scientists. And the fact that the exercise scientists live in their silo, and the brain scientists and psychologists live in their silos. And rarely do they truly, in a deep way, interact with one another and put their heads together to think about things. And we can talk all about interdisciplinary research and all this stuff. And yes, research has become more interdisciplinary. But there still are the power of the siloed fields is still substantial. People don't read each other's journals. People don't generally interact in ways that I think would lead to these things. And historically, the brain has been outside of the circle of sports science that includes multiple disciplines. Which is funny, though, because everyone has to follow the same protocol. Everyone has a control group. Everyone has to beat the placebo effect. Everyone understands that in that one little section that that's a real interference here. And if you can screw up my study, it would stand to reason that they would accept the power of it elsewhere as well. But it's not in vogue. It's becoming more. We see more athletes with a mind coach right now than you've ever seen before. But it's certainly lagging. Yeah, and I think I put part of the blame, is it a strong word? But I guess I will just say that. I'll put part of the blame on traditional sports psychology, which has kind of existed out here somewhere, right? And it hasn't spoken a common language with the other fields of sports science. The common language is biology, right? And sports psychology hasn't really embraced the neuroscience revolution in the way that other disciplines in psychology have. And I think as a result of that, there hasn't been a common language that is kind of existing for, say, a sports psychologist and exercise physiologist to communicate with one another. And so that's one of the things that I think coming from my background in neuroscience and brain science, we're physiologists, right? We study the physiology of the central nervous system. And it has allowed a vehicle for communication across disciplines. So when you sit down with exercise scientists and they start talking about physiological pathways and energy systems, there's a common understanding that we're working with a biological system. And the brain is a biological system that's responsible for all of your thoughts, all of your emotions, and all of your actions. And those are really important for any kind of activity. And sport is not an exception. So let's get down to it then, shall we? So the cerebral performance, you founded that, I'm guessing, in 2023? Because that had been 26. So that's sort of your newest venture that obviously you had to work very hard towards actually beginning, it sounds like. What do you exactly do? Let's talk the cerebral performance umbrella, and then I want to start just open the book of whatever that entails and the thoughts in regards to above the neck impacting below the neck, I guess. And this is, I don't know much about this at all, so I'm very curious to start to kind of get into it. So let's talk about what cerebral performance does, and then I don't know, let's dive in, I guess. Yeah, that sounds good. So I'll give you the broad strokes first. So as I was saying a minute ago with Bracken's question, I was seeing all this cool research that seemed to have implications for how people perform at sport or at anything else. And got excited about and frustrated by the lack of translation and the potential of translation to the world of athletics, right? So the inspiration for cerebral performance was, I think we can do better. I think we can start to bring some of this science in in a way that complements what I'm seeing going on in exercise phys and other areas of sports science. So that's the impetus. And I can give you like a really, so let's funnel that down a little bit. So in my work with athletes, I am kind of a mixture of things. So I generally work with the athlete and to some extent with their coach. And I try to, some of the work that I do is sport psychology oriented. It's working on things like mindset and goal setting and dealing with some of the glitches that we all have as part of being human beings that can get in our way of achieving our best, right? We have a brain that has certain glitches in the operating system. Psychologists would call them cognitive distortions. And addressing those is important for kind of getting out of our own way and being able to realize our potential. But beyond that, in the spirit of what I started cerebral performance to do, I've been trying to think really innovatively about how, what are the implications from the brain science perspective to how athletes might get more out of themselves in training. So I want to give you two examples, if that's okay. The first example comes from the idea that our brains, one of the big functions of our brains are to anticipate and predict the future. We're not just living based on the sensory feedback we're getting in the moment, but we're very sophisticated at on a conscious level and on a non-conscious level to adjusting our behavior in anticipation of what we think is going to happen next. That's a huge thing for the brain. And you can imagine why that's important for our survival as a species, right? Being able to anticipate what's likely to happen next based on your past experiences, based on the current information that you have available to you, gives you an adaptive competitive advantage, okay? So now let's kind of zoom down to athletes and how they train. Let's take runners, for example, and let's just think for a minute about the kind of workouts that runners might do in a typical interval training session on the track. Let's say that your coach gives you 16 by 400 to do at the track, kind of not an unusual workout to do, right? You know exactly how far you're going to be running on each of those repetitions. You know exactly the pace you want to hold for those repetitions. There's not a lot of prediction involved there. That differs substantially, I would say, from the kind of competition you might be preparing for. Imagine you're doing the 16 by 400s because you're going to race on the road. You're going to race a 10K. And you're at the pointy end of things, like you guys are. You want to be elbow to elbow, shoulder to shoulder with your competition. In order to compete well, you're going to need to be able to adjust your pace. You're not going to just lock onto a pace like you did in those 16 by 400s and try to hold that throughout the whole workout, in a typical workout. You're going to have to run competitively. You're going to have to go out perhaps quite hard, much harder than you would intend to hold for the whole race. Then things might settle in. Then there are going to be surges and accelerations, and you're going to have to decide whether to go with those or not. And if you do go with those, you don't know how long they're going to last, right? How long can you hang on? And we've all been through this before where it's like, if I only held on for another five seconds, it was going to settle down and I'd be okay. It's a big deal in bike racing. Those 16 by 400s that you're doing on whatever time interval your coach and you have chosen don't prepare you for the kind of mental stress and lack of predictability that you experience in that race. So why don't we change that up a little bit? Why don't we design our workouts a little bit differently to introduce some unpredictable aspects that are more similar to the kind of stresses you're going to experience in an actual race? So instead of 16 by 400, I chose a terrible example too because the track is such a regular world, right? But let's just say that maybe we take it out to the road. And we could do it on the track too, but the idea is that what we want to do is start to create some uncertainty. We want to create uncertainty either by taking information away from you. Well, that's a nice way to do it. So we could take your watch away from you and just say, there's going to be a random timer that goes off and that random timer is going to be on average the normal time that you would run those 400s in, right? But some of the time it's going to go off sooner and some of the time it's going to go off longer. So let's say that you do those, maybe you're doing those on like 65 seconds or something like that because you're a quick guy and you guys I'm sure are quick guys. So maybe sometimes the timer is going to force you to run and hold that pace for 75 seconds and sometimes it's only going to ask you to hold that pace for 55 seconds, but you don't know when. We could also play that game with your rest intervals, right? Races don't play out with like these kind of known increments. The whole idea is putting you into situations that are unpredictable. So I've been doing that with some of the athletes I work with and it's inspired by this notion that the brain is a prediction machine. A lot of what it does is trying to predict the future based on the past and the present. And from that perspective and knowing about competition, it suggests that maybe we start to play around with those predictions a little bit and see if we can get you comfortable with uncertainty. And I call them blinded intervals, kind of like scientists run experiments where subjects don't know the dose of the medication they're getting or whether they're getting the medication or the placebo. It's the same kind of idea. And I think it's pretty powerful actually. And I've seen some interesting things happen when we introduce this into the workouts of some of my cyclists, for example. And I'm thinking of an ultra runner that I'm working with now who's also responded really well to that. So that's just one example of a kind of a new slant on things by taking an approach from the neck down. The athletes are still getting the physiological stimulus, by the way, right? We're not saying, oh yes, we can just think our way to high performance. It's not about that at all. It's about rethinking how we approach high performance in a way that includes what we know about the brain. That makes a lot of sense. When do you see success, most success? Is there an athlete training age or a point in a training cycle where you start to implement this with more frequency? Or have you seen success that if we want you to start analyzing any intensity and duration in a moment by moment basis that we start right away? Yeah. So I wish I had the answer to your question. It's a great one. I don't have enough data. And I keep my, my work with the elite athletes is very involved and very time intensive. It's how I like to do it. And so I cap it at 12 people. That's it. Unless there's, unless one of them decides to move on, I won't take another athlete. And I've been very fortunate in the sense that people have generally stuck around. So that's been great. So I don't know if there's an ideal age or an ideal level at which this works best. I'll tell you that I have seen it prove effective both in cycling and in running. And we do those manipulations differently in those two sports, but the motivation is similar. The intention is similar. We see in cross country, people coach surging, see in track at championship level races that as the race is approached, you start throwing in a whistle where you need to do whatever. But again, it's pointed at the pointy end, as you say. It's interesting because originally I think, yeah, you should have a baseline level of fitness and knowledge of pacing and your internal metronome to be able to deviate from it. But then the other side of my brain says, well, maybe this is exactly why you need to do it before you develop that. And it might even hasten the process of learning without intervals and more of like a real fartlek, right? This is a true what fartlek is supposed to be, where it's not scripted to your mind prior. But initially I thought maybe it's just for elites and for sharpening and then maybe it's better even to start early with this. Yeah, it's an interesting question. I'll tell you that with cyclists, I don't know how much you guys know about cycling, but cycling is the sport, I would say, in endurance sports that has the most data, right? So because cyclists have power and wattage and distance and speed and all these things on a head unit on a bicycle. It's amazing what you can measure and there's more stuff coming all the time. I've really gotten interested in what happens when we start to take some of those streams away. And I'll tell you why. Part of it is for the reasons we've been talking about, getting athletes to experience that unpredictability, right? So having them all, the other reason for doing this is to have them tune in more to perceived exertion. When we look at the data on performance and pacing, perceived exertion is key. And perceived exertion is something that I think many of us have more potential to develop. And it's a perceptual skill. I started out my work, as I mentioned to you, in perception. And I think that perceived exertion is a very complicated perceptual skill. We know something about the different sensory feeds like heart rate and respiratory rate and muscle acidity, but also all of these cognitive kind of things like past experiences and so forth that all flow in to result in that perceived exertion sense that we all have. And we know too that perceived exertion is affected by a number of different variables. One of the things it's affected by is anxiety. stress. If you're anxious and stressed and you're in a situation that you're not comfortable with, your perceived exertion for a given fixed effort goes way up. And when your perceived exertion goes way up, your performance starts to go down. The other thing that affects perceived exertion, and we've known this for actually going back to 1891, is that mental fatigue affects perceived exertion. And not only does the perception of effort go up, but the ability to do work goes down. There's this Italian physiologist, Angelo Mosso. In 1891, he published this great paper, six or so experiments. And basically, he built this little contraption where you had to do an endurance test, which was lifting a little weight with your fingers, super well controlled. And he showed that if he gave people a mentally fatiguing bunch of tasks, he started out with looking at his colleagues, his fellow professors in the physiology department, when they were under a lot of workload and stress during the exam period. And what he observed was their time to exhaustion was much less when they were mentally fatigued than it was when they were fresh. Okay? It's a simple observation. Then he started manipulating it like a good scientist, and he showed that if he mentally fatigued them, their performance would go down and their sense of effort would go up for a given workload. So that finding was kind of lost to history until fairly recently when people started to really look more at the role of mental fatigue on physical performance. And now there's been, you know, the past 15 or so years, there's been a lot of research on this. You can go to my website. I try to put some of the links to papers up there, but pretty consistently showing as mental fatigue goes up, perceived exertion goes up. And as perceived exertion goes up, performance goes down. And you can see it in running. You can see it in swimming. You can see it in cycling. And pretty much even in some of the strength sports, pretty much everywhere you look. Okay? So then the question is, what do you do about that? And why is that? Well, the why is still an open question, but I think we're getting places. We're starting to see that there are certain areas of the brain that are involved in cognitive control. Our ability to sustain a pace when the going gets hard involves a lot of, places a lot of demands on focused attention and kind of cognitive control, our ability to self-regulate. Really heavy load on those things. And it seems that those areas that are involved in cognitive control are also responsive to mental fatigue. It seems like that might be the nexus for some of this stuff. Interesting question if you know some, have been following some of the research over the years and the debates about Tim Noakes' central governor. Well, you know, this is the best, the closest I think we've gotten to identifying something that would be a candidate physiologically for Tim Noakes' conceptual level idea there. So what do we do about that? Well, what I do with my athletes first is figure out how to decrease their mental fatigue, decrease their cognitive load going into key performances. We all are great about tapering. Tapering is a complex thing. Tapering means different things for different people and figuring out what a taper works best for an individual. You know, there's a little science and a lot of voodoo and there's an art to it. But once you figure it out, fantastic. Let's hold it. Let's replicate it and keep it going if it works for you. But very few athletes that I know, even at the Olympic level, taper mentally. And so one of the things that I'm doing with my athletes is figuring out how we can do that and looking at what happens when we decrease their mental load in the critical periods going into their A events in particular. But we try to practice with the B events and the C events as well because we want to make things automatic and predictable and routine. Boring. My ideal sort of mental state for an athlete heading into a big competition is boredom. That's how I want them to feel, right? So we do a lot of things to try and make that happen. And it's not rocket science. And it's not something that your listeners need to go out and pay money to do. They could do it for themselves. It just requires discipline. It requires things like creating lists so that you're not forgetting things and you're getting to your competition. You're scrambling around looking for this or that. It requires setting alarms on your phone so that everything is super regular and predictable. By doing that, we decrease the arousal and the stress. We decrease the mental fatigue. And I really believe, based on an accumulation of research, that by doing that, we're going to allow you to be able to utilize more of your physiological capacity. We're going to allow you to go deeper because we're pulling down that rate of perceived exertion. The other thing that we can do, and this is something I'm doing more and more with my elite athletes, and I watched the research on this develop with a great deal of skepticism. So let me give you a little background. In my career as a cognitive neuroscientist, we would design tasks to probe the brain, to train brain systems, and look at how that played out both in behavior and in brain physiology. So I know a lot about building cognitive tasks and training brain systems and training behavior. That's kind of what we do. A few years ago, probably 15 years ago or so now, there started to be studies coming out here and there looking at what eventually got the moniker brain endurance training. And basically, this involves taking tasks, the kind of things I would use in my own laboratory, and combining them, these cognitively demanding tasks where people are having to make decisions and rapidly respond to a stimulus over and over, mentally fatiguing tasks, combining them with physical training. And what the studies were reporting was that if they did that, they were finding that people got a bigger bump out of the physical training when this was done over a period of time than they did for physical training alone. And I didn't believe it. I thought, yeah, no, that seems like too good to be true. But then more papers kept coming out pointing in a similar direction. And now there's a very solid body of research, solid enough that I think there's really something to this, to the point where I'm using these techniques with my own athletes, where I'm essentially programming up cognitive tasks for them that can place very specific demands on things like focused attention, situational awareness, rapid decision making, sensory motor responding, response inhibition. And I'm pairing that up with their workouts. So a typical thing might look like an athlete comes in from their interval session. Maybe they just did the 16 by 400s that we talked about. Throw on a dry shirt, grab their recovery drink, and they sit down with their iPhone and they pound out 20 minutes of these very demanding cognitive tasks right away while they're still physically and mentally fatigued. And now I've been doing this now for about a half a year. And I'm seeing some pretty interesting results with the athletes who have committed to it with me. You know, a typical athlete might work with me on these tasks three times a week for 20 minutes to half an hour. So it's not a huge amount of time, but you know, when you're training full time or it is a bump, right? You think about the workload that these athletes are already carrying. It's significant. But those who've stuck with it, we're seeing some really interesting things. And what we're seeing is twofold. One is that when they're breathing out their ears on the limit, they're finding that they're still capable of making quicker decisions, having greater focused attention, and being able to either choose to go with moves, choose to wait in a much more controlled way than they have before. I think it's sharpening up the fatigue resistance of these core performance critical sorts of cognitive functions. The other thing that we're seeing, and this is what the research has been pointing to, is there for a given workload, they're finding that their perceived exertion is lower. And so that allows them to push out more work. And we're not talking about, you know, bumping up an athlete These are elite athletes. We're not talking about bumping performance changes 10%, 12%. But if we can get them 3%, 2%, even 1%, that's a difference from being on the podium or being 30th place. So I'm super excited about this. And I think it has applications in the non-elite athletic population as well. But it's another way in which we're kind of, and this is a second point when you asked me about how I'm working with my athletes from the brain perspective, the neck down perspective. In addition to what I mentioned earlier, introducing unpredictability, it's capitalizing on this sort of mental fatigue aspect. Lowering mental fatigue, but also training the fatigue resistance of these core performance critical sorts of systems. Sorry, that was very long-winded. You can tell I was a professor. No, this feels timely. It's kind of funny you started this whole conversation, what, an hour or seven minutes ago talking about a 50K time trial. And I think it's ironic because what we're talking about now is we are in a time in history where we probably have the best metrics we've ever seen in endurance sports. But we have the biggest disparity between time trialing and racing that we've ever seen. We have, like eight years ago, I want to say it was the first time in history that sub four minutes did not qualify for the indoor mile at the NCAA level. Not, isn't it? And this year, 28 individuals did it in the Big Ten Conference. Crazy. Didn't get you to conference, no, eight years. But now we're seeing something we didn't use to see, which is the fastest people in the world won championships. And that is not the case anymore. The people who set world records almost invariably do not win world championship or Olympic golds currently. Interesting. And it coincided with more data. It coincided with COVID. But we came out of all of this fitter than the running world has ever been and metronomes. There you go. And you talk about cognitive dissonance. I might talk about it as race noise. But the things that are involved in racing versus running a singular effort time trial are exhausting to people who have lost that or never developed that ability to monitor a race while dead asleep. And so it's very timely that you are doing this sort of thing because if you didn't grow up running middle school track, high school track, maybe you lost high school track during COVID or races weren't happening as much or now you want to qualify for the Olympic trials. You go to CIM and it's a controlled thing or you go to these small little pop-up marathons that have tables every quarter mile for you. But it's their sterile condition racing. You have wave light. It's taken the nuance out and you're adding the nuance back in in place of that. Yeah, I'm trying. And this business about data is super interesting. And again, spending a lot of time in the cycling world where there are so many streams of data and new ones all the time. People are talking about adding in respiratory rate now. We've got core temperature monitors and all this stuff. It's fantastic. It's so exciting to me. But I also think that it's problematic potentially because the brain is a very incredibly complex system. It does have certain bottlenecks. And one of those bottlenecks is in attention. We have a limited kind of set of cognitive resources at any given moment to process information. And so if you're focused on all of these incoming streams of data, you are not focused perhaps on some of the things that really are relevant to squeezing the most juice from your orange and getting closest to your physiological capability at the given fitness level that you're at. And so one of the things we're doing not only in training now but racing, I have an athlete who is a professional cyclist in Europe, and he's racing this week without his power meter on. And his coach may flip out. So I said, that's on you, buddy, and his teammate flip out. Not on or not showing up on his device? Well, this is not on. And I'll tell you why. Because we did experiment with just taking it away. We've been doing that for a while. And he said, you know, it's good, and I'm getting more out of myself, and my pacing is changing. It's really freeing up some cognitive resources to be focused on where he needs to position himself in the peloton and so on. People talk about bike racing. The analogy is like playing chess at 40 miles an hour or something. There's a lot of truth to that. But what he's finding, what he's found, and this was coming straightly from him, is that knowing that the data is being recorded is also changing the way he rides. So I thought that was super interesting, right? Think about, you know, how exciting I know for me it's super exciting to come home and then, you know, put the stuff on Strava and dig through it, take a look, or training peaks or whatever and say, wow, look, you know, this is my 20-minute power. I don't know my 20-minute power when I'm out on the road. That requires, you know, some information processing that has to be done offline when I get back. But, you know, I think about that sometimes when I'm out there training, so I could see where he was coming from. And I think that's where that kind of illustrates why I think my continuing to, even as a geezer, be involved in these endurance things, I can relate in a way that I couldn't, I think, if I was not able to continue doing the physical sports. But it's really interesting, and we'll see what the outcome of his experiment is. But he raced yesterday in France and had a fantastic race, and he attributes part of it to that. I don't know. It's hard. And it's hard, you know, from a scientist perspective, we like big studies with lots of people and averages, right? And now we're working with experiments of one. I'm trying to punch holes in your theory, Bracken, about the world record leads or the world record holders not winning world championships or Olympic races. And so I've been thinking as you guys are chatting, and I can only think of one right now, especially when Faith Kipiagon is the only one I can come up with. Otherwise, in sports in which they're doing it on their own, let's say long jump, pole vault, hurdles, sprints under 400 meters and under when they're staying in their lane and more self-focused, as soon as the lanes begin to merge in the 800 meters and up, and there's the jostling and jockeying, Faith Kipiagon is the only one who I can think that had a world lead that actually – the only reason she won, and I don't mean only, she was so much better that she could go out and time trial if she wanted and win. Then you take a Jakob Ingebrigtsen who attempts to time trial, who has the fastest time in the field by a second and a half, which is light years in the 1500, and he can't win. Yet, Jakob Ingebrigtsen does not have close to the world lead in the 5K, and he goes and wins a world championship. It's just so interesting to think. Can you think of anybody else other than Faith Kipiagon? I mean, I think Dikembe Mutombo when that 10K. But outside of that, you didn't see it. I think there's a lot of truth to it. It's just interesting to say when in a vacuum and the situation is controlled and they have their wave lights and they are able to thread the needle the entire way without so much as the wrong gust hitting them in the face, they're very calculated and amazing athletes. When the jostling and the surges, sometimes it just degrades their integrity physiologically and mentally, we will call it, in order to do so. And now I'm just trying to think back, and so I think it's fairly true what you'd said. Interesting. And I love – I can't wait for running to come up with a great power meter because I still think – I'm sure you do, Scott. Cycling leads the way with science. They are a science-based training sport. Everything trickles down from there. I would put Nordic skiing above us. I would put triathlon above us. I would put swimming above us, and then it's running. Okay. Swimming. Yeah, in terms of science-based training, I think they are above it. They understood critical velocity training like a decade before running did. They don't have super shoes back in. They have suits, though. They have super aero suits. But not the only, but the biggest drawback to watts or lactate threshold or VO2 max or whatever the data is, that data does not believe in miracles. Explain. Pardon me? Explain. Well, data does not take into account what happens when you are in a race with two laps to go that you have never been in that pack before. Data does not take into account for a crazy adrenaline surge when you get to the world championship stage for the first time or when the crowd erupts or when that tingle we've all got all over our entire body when the bell rings with a lap to go. Data doesn't know about that. And data doesn't know that mothers can lift cars off of infants. It doesn't care about chemicals. And then breakthroughs sometimes occur when you are a little bit past what you believe your depth is based on your metrics. That's the single biggest drawback in my mind. Well, let me say something about that because I couldn't agree with you more, of course. And what you're talking about are the neck down things. And there's great research that is relevant to this, right? Where you can put someone on a cycling ergometer and have them ride a time trial and you can mess around with the data that they're getting, right? And within certain parameters, you can lead them to believe that they're going less hard than they are. And what happens? They think they're going at their limit, but they'll jack it up a little bit more. They'll get a little more out of themselves because the brain is constantly, this is where I agree with Tim Noakes, the brain is the governor that holds us from going into a place where it's really gonna potentially kill us, right? And that works really well under most circumstances and that's a damn good thing. But there's that space, right? And where great things happen, where miracles happen is when we get a little closer to that physiological ceiling. And that requires getting that thing to take the brakes off, either because you're having that big adrenaline surge on the bell lap or whatever is happening. But belief is a big part of that. And I don't dismiss belief at all. Belief sounds like, oh, placebo and all this stuff, but you know what? There's great science from my world on the physiology of the placebo effect. I'll take a great placebo. Yeah, it's great. So while we control for the placebo, when we start switching the research around to look at the placebo, what we see is that the placebo effect is generated in specific brain networks and it has a lot of downstream effects on hormones and neurochemistry that has big implications for how we function and how we behave. And so, yeah, I see, I agree with you completely on this and I think it's the missing element. And we all want to know how to tap into that consistently. And that's the challenge. That's right, that's the challenge. And so I like to think that there are certain things I do for my athletes and will continue to try and figure out new things to do with my athletes because that's a big part of what cerebral performance is about, taking the new research, trying to figure out what the implications are, trying things. Some of them will work, some of them won't, and figuring out how to make that happen at least more often. Tell me if this makes sense. I got a question for you. Sure. I'm getting now, I'm applying this selfishly now. That's great, let's do it. I hope everybody is at home as well or hopefully they're probably running right now while they're listening to this on a commute. This episode is designed to accompany people on their long runs, Scott, in case you're wondering. We're going big. Now we're here. So I think anything over 75 minutes, we count it and we're there. So tell me if this makes sense to you. And Bracken, I'm very curious to get your take on this. So Bracken and I have a track background, cross country background. I was an all American in the 1500, division three. And Bracken was, you were an all American in one of the DMRs or the relays, weren't you? I'm a quarter all American. He's a quarter all American. So we're both all Americans, point being, but we were very calculated and it was a lot of threading the needle on the track for us, right? Splits and milliseconds and everything mattered. Well, we found this stupid sport called obstacle course racing along the way. Okay. Obstacle course racing took me from the roads and the track to the trails and the mountains and going around the corner and not knowing what the heck was going to be there for you. And not even knowing the distance sometimes being like, it's somewhere between 12 and 15 miles, you'll figure it out. And you don't know 10 of the things that you're going to encounter. So good luck. Love it. Right. And so you took two very calculated athletes, Bracken and myself, and I had started to try to run, let's say faster 5Ks. I took about a decade off and lifted and maintained life fitness, but not performance fitness, right? As we do, focus on career and other stuff. Absolutely. And so let's say in that period of time, I was running 16 minutes in the 5K, just a random local 5K. I'm not competing at any high level. I go and I do these, I train for these obstacle course races and they have no idea what's coming. And pretty soon I'm in the well and I have half a race left or now I'm climbing a mountain and I think I'm at the top and I look and I go, oh shit, there's more, but I'm already at wit's end, right? I've been forced out of my calculated efforts hundreds of times because of this. And then I return a year into this to the roads, bam, 40 seconds off my 5K time. Like, where did that come from, right? I wasn't running flat and fast as much. I'm sure I was training hard. And you start to think, well, did this bring me, maybe physiologically, of course, but then just my ability and RPE of what a 5K controlled compared to carrying 120 pounds of sand up a double black diamond when I'm already 13 miles into a mountain race does to a guy. And so, yes, I was training hard and there has to be physiological adaptation, but I'm starting to wonder the trails and the obstacle course racing, could there be something like that that suddenly now I'm pursuing the roads again, more calculated stuff. Could you see even something like that, just the perceived exertion by just pursuing something else and then returning to something simpler, I guess is what I'm getting at. What's your thoughts on that? Well, what I locked onto immediately was the similarities between what you're describing, at least at an abstract level in the kind of these kind of blinded intervals or blinded workouts that I was talking about earlier. It sounds like those races, and I don't really know anything about those races, I guess. I didn't realize that they were unpredictable. Often. And you may, you know, I would say that you're, you know, I would make a bet that there was at least some contribution to your having put yourself through that kind of unpredictable competition where you're having to, you know, you're already breathing out your ears, but now you're going to have to extend that even longer than you thought. You're still an hour left. Yeah, right. Surprise. It's like when you run a road race or let's say a time trial, you rise, you rise, you rise, you sit, you sit, you sit, and you breach the last three minutes and you cross the finish line and it's all calculated out in an ideal world, of course. Right. And in this, it's like, I've blown all my gaskets and there's three miles left. What now? Bracken, do you have thoughts on that at all? I wonder about it now that he's been speaking on that. Well, all I've been thinking is OCR the whole time, which doesn't apply to many people anymore, but that's, I mean, prepping for the first world championship, I did this bucket workout. I ran 10 by 1K and I had a bucket and as my interval, and I'd run up and I'd have to pick a piece of paper out of the bucket and that was my active recovery. And it might be 20 walking lunges back to it and it might be 30 burpees, 400 meter bucket carry, 30 burpees back to it. Like it could be 15 seconds, it could be two minutes of work, but you didn't know what it was going to be so you couldn't account for it with a run prior. Like you talk about blinded intervals. No, that was very cool. But that was the kind of thing that did translate. My 5K PR came during that kind of training. My road mile PR came during that kind of training. I used to describe it, and I think I have on here, that when I was racing, I had this vision of myself at a nuclear power plant control panel. And all my race was doing is sitting there and keeping an eye on all the gauges. And all my training was designed to make me a master at which gauges matter and what little tweaks to like micro changes to my arm carriage or foot strike will keep little gauges out of the red. And that as soon as the light started flashing, you knew what was going on and you had to immediately make one little adjustment or you're going to blow up. And what obstacle course racing did is they threw all those lights out. And I found out that some of those that were so dialed into the track didn't have to be as dire warning signals on a trail, but you could come back from that with a descent afterwards. And it did change a little bit of which warning bells mean sure death and which ones mean we're going to learn something, we're going to find something out today. And it used to be every single one of those lights that flashed told me whether I was going to live or die. And now they started following different rules when you're looking at that control panel during a race. So for sure we have felt that. But how far into that does a coach allow you to come into their programming and implement? I think would be the hardest part of your profession is which coaches are going to be confident enough and flexible enough to allow you your hand on the wheel. Yeah. So, of course, that's going to vary. And I think more and more what we see at the pointy end of things with elite athletes is that they have a team and they have support in nutrition. They have support in designing the training plan. And they have support, I think, you know, I think how I see myself is then when there's an acceptance of what I do by the coach, I'm part of the team now. We can have a conversation about that. And we can work together collaboratively in the interest of our client, which is kind of when things get super interesting because we can inspire new ideas in each other. I want to come just circling around to something you said earlier, how cycling has led the way in a lot of senses. And I think there are multiple reasons for that. There's a lot of money in cycling compared to other endurance sports and so on. But, you know, what's driven cycling to have to be innovative is the drafting nature of cycling and how important that draft is and how essential it is then that you as a cyclist in order to succeed in mass start bike racing be able to utilize other people. And a lot of what you're doing is being dictated by your competition. Sometimes you're the dictator. Sometimes you're not the dictator. And that will change throughout a race. But if you're not able to hang in there when somebody else is doling out your pain and be able to function well under those conditions of uncertainty, right, because you're not in control, you're not going to be a good bike racer. And we see the same thing in professional triathlon, in draft legal triathlon, in Olympic triathlon. The draft is important in the swim and the draft is important in the bike. It's less important in the run. In cross-country skiing, draft is kind of somewhere between running and cycling. But cross-country skiers on the World Cup regularly race mass start races where it's head-to-head competition. They go out like they're shot out of a cannon, but there's a lot of changes in paces. And we also see those same racers competing at distances from the sprint races lasting three minutes up to 50Ks that last for two, two and a half hours. They also do interval start where they're just starting one at a time and it's a total time trial. And under those situations, people perform differently. So for those listening and then for the sake of being respectful of your time, as we kind of work towards it here, would there be any suggestions, anybody listening like, okay, I'm interested in this and there's so many people, you know, we both coach, Bracken and I, and the most common question is, well, how fast should I run this interval or what should I do this workout at or what is my effort, right? Naturally, you know, of course, those are good students. So looking at it maybe as those are the people listening, what would be like some things to play around with if you can even dabble or scratch the curiosity? Do you have recommendations there? Yeah, three things, right? Three things that don't require any special technologies or things are always a great place to start with anything. And I think, you know, the simplest thing of all is like paying attention to your mental load before hard training, hard important training sessions or before important competitions and really trying to carve out some space by, you know, maybe you need to plan ahead to rearrange your work, rearrange your school, whatever you do to get things done ahead of time so that in the day or two before that race, you can really decrease your mental load. And I think by taking that mental fatigue down, there will be big dividends. There are other things that are simple along those lines too, like put away your phone, man. Get off social media for 24 hours before your race. It'll be okay. It'll be there waiting for you. That's a big thing that we do. My athletes are pretty good about, you know, because once you get them to do it, they realize, hey, I felt so much fresher. My perceived exertion was a little bit different. To interject real quick, and maybe I'm opening a can by asking this, but let's say you are a laborer. You're the landscaper holding the end of the shovel, but it's very simple work. I'm filling the wheelbarrow, and I'm literally disconnected from what I'm even doing. I'm in daydream as I'm working. It doesn't take a lot of mental energy. It takes physical energy. And you take a high exec. They're sitting stationary all day, but they are getting ahead on work because they're leaving for their race, and they are burning the mental oil. Would you take one over the other? Wow. Would I take one over the other? What sense? In a sense of Saturday morning race day, which boat would you rather be on? Who would be more available? I mean, I know this is not a fair question. It's tough, right? You know, the stress is stress, right? I say that sometimes to my athletes. Like, well, no wonder you had a shit race. All your kids were sick. You're working overtime at work. Your training's been going good, and the taper went well, but you still felt like crap. You had nothing in there. Well, let's try to make sense of it. Stress is stress. So I guess I'm just wondering, I got a mindless physical job, or I have a mindful sedentary job. Do you think there's like a dozen in one hand, 12 in the other, or what? Yeah, I mean, extremes of either are going to be problematic because I truly do believe all the research supports the physical and the mental demands both compromise our ability to push toward that physical limit, regardless of what level of fitness we're at. I will answer your question, though, in a roundabout way by just saying I think all of us can wrap our head around the idea that the dude who's like working as a stonemason and lifting concrete blocks all day is probably going to feel that when they toe the starting line that evening for the whatever, the local 5K pumpkin run or whatever. But I think all of us, and I know I did, really underappreciate the fact that that banking executive who's just been cooking for the last 14 hours on their brain, when they toe the line, is also going to be compromised. And that is a point that I think by embracing, we can all do better. So I don't know who's going to win the race, but I would say that don't underestimate the role of mental fatigue on physical performance. Okay, fair. I'm going with the guy at the shovel, by the way. All right, right on. Anecdotally, I have raced very well at, let's call it sub-30 minutes, on a fatigued body. Interesting. And over 30 minutes, that fatigue catches up. And mentally, I think it's reverse. I think it's tough to put out long and short when you're really fatigued. Like that middle distance works okay. I love that. That's really interesting. So I was just looking at some work. I'm working on a book project, and I was just reviewing some of this stuff today. And I would say that a common denominator for a lot of the brain endurance training stuff I'm talking about, the research on that, is that generally speaking, you don't see changes in performance in the shorter sort of efforts, but the time to exhaustion is where you get the more consistent research findings, where combining the mental training and the physical training versus the physical training alone, you get a bigger bump when you put the mental training in in the time to exhaustion. So that might be part of what's going on with you. Well, and this is interesting to me. As you've been talking a few times, and specifically when you were talking about mentally fatiguing activities and getting right to some sort of complex mental gymnastics post-interval session, my mind just goes right to the ultra, right to the trails, right to the mountains, because, I mean, it's fueling and it's mind game every bit as much as its physicality. And you see people just glass over at some point. You see people stop being able to calculate out their splits or they forget to fuel or whatever it's going to be that you might not have cramped physically yet, but mentally you are. You're cracked. You're gone. And so this type of, I mean, it's astronaut training, right? You have to be able to do these tasks when you're under duress, and you may not have slept in a long time. It just seems like that world could be ripe for this. Right now the current buzz is high-carb fueling so that your muscles don't experience this. It's right out of cycling. Right. Now there has to be a mental component to you've now gone 16 hours without sleep, and you've been working hard, and can you still be sharp? Yeah. So I presently work with, I was working with an ultra runner who, you know, we were, I think, making some interesting progress on South American ultra runner focused on the shorter ultras, and I'm currently working with an ultra runner who's really his taste is for the long stuff, so 100K to 100 miles. And we're working, using these tools with him. And the idea being that if we could get just a little bit more capacity in some of these systems and build a little more fatigue resistance, could we get him over the hump that he experiences somewhere around 100Ks into 100 miler? And if we get him over that hump, usually they get, he has a kind of recovery of sorts, right? That's been his sticking point. If we get him past that, he's good to go. So yeah, I think the ultra world is interesting and it's been interesting. You know, I was never an ultra runner. I think the longest I ever ran was a 50K. But seeing how that sport's evolving and seeing how people are starting to go into that from shorter distance speed backgrounds, I think there's a lot of interesting evolution taking place out there. Well, and there's just more time for little noise to wear you down. Even a 50K, we've both raced 50Ks, that's long enough. But if you're a little inefficient on something, it just wears you down. It was long enough for me. I know that. I do longer bike races now. But you know, the fueling part's interesting because the brain, let's say the brain weighs about 2% of your total body mass. It consumes about 20% of your daily energy budget. And that's true whether you're lying on the couch or whether you're doing like theoretical physics. The difference in the metabolic consumption of the brain when it's working super hard or just at rest is very tiny, super hard to measure. Have to come up with very sophisticated instrumentation to even sort that out. But our brains are giant energy hogs. So the first thing that happens when you start to even get close to getting low on fuel is the brain starts to throw up red flags. Your emotions start to dip. You start to feel a little down or a little depressed or a little discouraged. The negative thoughts start to come in. That's just a warning light telling you basically that the fuel gauge is starting to get a little low. You better do something about it now. It's again that kind of prediction. The brain is saying, hey man, if you keep this up, bad things are going to happen. And you know, I'm sure you've been there. I've been there when the bad thing does happen, when you keep going and you bonk your brains out. It's terrible, right? And the effects of that can last for days, really. Craig, what do I say I do every ultra? What do you do every ultra? What do you do every ultra? I cry. You do? Yeah. I've had tears in my eyes at a minimum in every ultra I've ever run. Really? I knew that at the one down south. I've teared up. At minimum, I've teared up. Every ultra. Makes sense to me. You know, one of my athletes the other day was relating to me like he did a really hard training session and then got into my tasks and it was particularly demanding. We progressively varied the intensity, all the same training principles you guys use as coaches. We apply to the brain training. And he said, man, I had like this emotional break that I've only experienced when I've been ultra racing, where I just got really emotional during the performance of these tasks. And that was interesting. So where can you direct people to DIY tests? Is this like playing Wordle? Is this awkward puzzles? What can people do to implement themselves? Yeah, that's a tough one. So there are free software things out there, but I would say that this is not simple stuff. This is complicated stuff. So when I'm working with athletes, we've got a plan. We've got a progression of intensity and duration. We've got a huge amount of variability. I work with about 50 different tasks, all of which have different levels of performances and so on. And that's kind of more in keeping with the research. There are things out there that you can get like apps and brain games and things. I'm not saying that it's a waste of time, but I'm saying that it's very hard for people to commit to just pounding on those things consistently. So it's like one company out there, I think it's Rewire. They have basically a version of this task that we've used in labs for years, that Stroop task. Maybe they have more in a paid version. I don't know. But people could look at that stuff. It's just that I personally think that we need more. We don't need periodization. We need a structure to these things, just like we do with physical training, right? So it's not just a matter. At some point, you're not going to get to be a better runner just by going out and running. Maybe that'll work in the beginning. Maybe just pounding on Wordle for a while right after your interval sessions will help in the beginning. But if you want to move further into it, it requires some expertise and some planning and training, just like training does. All right. So I interrupted you, and then we're wrapping this thing up here. I said, what can people do? And then you said there's three things. And you said... And you said three things. And I ended with one. Well, no, I interrupted you because I asked... Free things, that's right. Oh, free things. Free, free, free. So reducing the mental load. Yeah, yeah. Was there anything else? Yeah, I mean, you can figure out clever ways to do these unpredictable intervals. There's like... Go Google it. There are random timer apps you can put on your phone where you can set the parameters between X time and X time, and it will generate like a set of random timers you can use. You know, you could do that kind of thing. You could get an interval timer like for Tabata workouts or whatever and put your phone on vibrate and throw it in your pocket and just let that kind of... If you're not aware of the time, you're not going to be able to predict it out to the minute, right? Runners are pretty good at predicting how long this feels like three minutes. We're pretty damn good at that, actually, if you play around with it. But those are simple things people can do. I like your grabbing papers out of a hat. I actually did that with an athlete, literally that. He had a bunch of paper in his hand. He'd pull it out and he'd say, okay, this is this amount of time. But it's still not truly blinded in that sense. So the timer thing is better and you can do it yourself if you need to, right? You could try it with your athletes that you're coaching too. I really like... A little predictable, but variable as well. Yeah, that's true. Yeah, I would need like a big discrepancy there, like 30 seconds to 10 minutes or something crazy where like... Huh? Yeah, like something that really makes me... I don't know, maybe... I guess maybe I'd be worth playing around with, but... Well, the key here is that we want you pushing an effort level, right? Three to five minutes, maybe. Yeah, we need the waves to be not so big that you're just going to completely crack yourself on the first interval. Yeah, to think about that. All right. And if, you know, I guess if people want to learn more, if they want to check out what you're doing or get in touch, like do you have any call to actions to anybody listening or where they can follow along or anything? The best place is go to my website. So cerebralperformance.com and they can... I try to keep... Trying to do a better job of getting science up there. They can sign up for a newsletter. I'm trying to do a better job of getting that out. But they can also email me from there and just give you my email. It's scott at cerebralperformance.com. And generally, that's a good way to get a hold of me. Check out the information of the website. If you have questions, shoot me a note and I'll try to get back to you in a timely way. And thanks for the opportunity. I guess the last question is you're talking about the website and all that. Would there be an application for... I don't want to call it like group. Yeah, I'm glad you mentioned that. Actually, so I'm very interested in the potential to develop some training groups around this kind of training to make it accessible to more than just the dozen elite athletes that I work with. As I was saying earlier, I keep that small because it's very personalized. And especially during their competitive seasons, we're in touch a lot. It's how I like to do it. But the way to make this kind of stuff more accessible is through group stuff. And so I'm interested in developing some groups and a run specific group would be particularly interesting to me if there were enough interest out there. So if people are interested in that, they can shoot me a note, coaches or athletes. And we can try to, if there's enough interest, we can try and do it. Okay, I could just see an application for that because it's tough with a small roster, right? Definitely. Okay, I think I'm satisfied. Cool. Well, Scott, I hope to talk to you again in the future. Yeah, it'd be great. And if you want to next time, maybe I can give you guys some of the tasks to play around with in advance so you can have firsthand experience when we've talked about that. I would like that. That'd be very interesting. Yeah, thanks for the opportunity. It was really nice to meet you both. Yeah, great chat. And thanks, Scott. Yeah, great chat. And thanks, Scott."
}