{
  "guid": "baf5cce1-4ec8-31bb-8acb-8c2b69a36eb6",
  "title": "Training Tuesday: Back From Vacation",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. It's Tuesday, folks, and you know what that means, Training Tuesday. We are going to take every rabbit hole, follow tangents, use useless metaphors, get lost in the weeds. This is Training Tuesday. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. It's been, what did you say before this, four weeks since you and I sat down on a Tuesday together? It'll be, yeah, exactly four weeks when this is released since we've had a chat, just you and I, and we have not caught up outside of this, so it's been a while. You were in California, and I was in Sweden. Now we're back. And that's it. I think it's that simple because you were gone for probably a week and a half? It was closer to two weeks, yeah. Okay, we were gone 12 days. I don't even know. 12 days, call it 4th or 13th. We were gone for eight or nine days, and we had the perfect misalignment of trips, meaning as soon as I got back, you were gone, and so we decided that we love this podcast, and we don't want it to be a stressor while on trips to make sure that we take time out of our trip to record no matter what, and so it just happened to line up that way, but I've missed chatting. I feel like we have a lot to catch up on, but maybe not. What do you think? I think so. Yeah, nothing major, but you went out there to do not two, but while you were out there, you had a big run planned, and it's interesting you said about this is a deviation from that, but you said we've decided as a couple not to prioritize work on our vacations, and prior we had, and one of the last trips I was on, one of the last overseas trips we had done was a few years ago we did Ireland, and I did bring my microphone there, and it required an extra suitcase because I needed something that wasn't going to get damaged, and I had to package it up all nice and then find a quiet spot, and it ended up with the time zone differences right in the middle of dinner, so I cooked dinner and then went upstairs and tried to barricade myself in soundproof a room, and it was fine, but it absolutely hangs over your head. So, although we only put out one episode per week while we were gone, I think for the two of us it was much better, which in return hopefully makes the podcast better long term. Although you're not off the hook because you have to still edit the episodes I record while you're gone, so you kind of get the raw end of the deal. You're our craft master on the back end. Yeah, but that's way easier because that can be done anytime and that doesn't hang over my head. All right. We had some good episodes though, I think, while we were released while we were away, and now we're back to, should be back to the twice a week situation. First of all, I wanted to bring this up to you just because I just listened to one of the athletes I'm working with send a message, and I want to hear what you think about this. Okay. He said, I've been thinking about this ever since I started listening to you guys on the podcast, and I've never told you, and I'm just going to tell you because I don't know why it's on top of my mind. He said, before I knew what you and Bracken looked like, he said, without question, I associated your voice with how Bracken looks and Bracken's voice with how you look. And he thought that we were misaligned that way, meaning I sound more like you and you sound more like me appearance-wise. And I can't quite make sense of, like, I can't figure out how I feel about it. What do you think? Yeah, I don't know. I think your own voice is impossible to judge. One of the hardest parts early on, way back in obstacle dominator days, was hearing my own voice back at me. But I mean, I sometimes hear someone's voice and I think they sound like me. And I'll ask Lisa or someone, like, not at all. Like, yeah, I have no clue how I sound. But I have heard this before. I started working with someone, actually, who hadn't seen us for, like, the first at least six months they listened to the podcast. She said, when I first saw you guys, I was shocked because the image I had brought up in my mind was not at all how you guys look. It's interesting how that works. I don't know. I couldn't decide how I felt about it. I was like, so Bracken sounds jacked and awesome and I sound bald and weak? Yeah. Slow. Just kidding. All right. So today, folks, Bracken and I are going to get caught up on just get caught up. Recent musings, stuff that has crossed our mind in the last month, anything that maybe you could learn from or not. But I feel like I want to catch up with you and it's a shame to do this not while recording. And so that's what I think we're going to do today. And then we'll teach you something later this week. It's going to be Bracken and I, just us two for our long run episode later this week where we can dive and split hairs and such. So that's coming to you later. Today's more of a BS session, which are my favorite with you. And the first thing I want to ask you is how was your trip and what did you do? Okay. So I wanted to go first because I wanted to do this chronologically. But to avoid being rude, I'm going to complain first about that and then I'll answer your question. Trip was great. Okay. The complaining is done. I'm not starting. Oh, that's it. Oh, wow. Okay. Oh, great. Yeah. So you guys were, the questions I have, and I want to bring this to training too, because others can, it's been fricking spring break season. It's like people I'm working with, and I know you know this too, the last three weeks have been nonstop. Somebody's gone on a trip with their family or not. It's been like broken training because of X, Y, and Z, still sick season, meaning people are still dealing with some of the winter crap that's going around. So it's been broken training. And so I want to bring this back to how you manage that. But first I want to hear just high level trip. High level, it was good. So we have been here before. This was actually the town I talked about when we had that AMA. It was what are your favorite cities on earth? This was one of my favorite experiences in a city. We had gone to Lulea in Sweden two years ago, but we had gone a month prior. And it was a different experience this time because they are coming out of winter now. So the last time we were there, they had probably nine inches of compacted snow everywhere. They don't plow there. They just compact it a little bit and then they sprinkle gravel and sand over the top for traction. And then at the end of the season, when everything melts, they sweep and scoop it back up and put it back at their depository station. And then they use it again next year. So we plow and salt here. They compact smooth and then just sprinkle over traction. Not on like major highways because those probably hardly exist except exiting the city, but within the city itself. Yeah. And the country roads and everything. You're just driving on snow. Interesting. But it's like the sidewalks are all just snow just with gravel on it. Anyway, we are now at the tail end of this this time. And I had talked last time they have waterways everywhere. They're a port city and it connects out to the ocean, but everything freezes over and then they just plow it and maintain it. And they have the ice road that connects both sides of the town. And then they have like a 10K walking skating track, like a big figure eight that connects all throughout the town. So it's kind of cool. But this year, while the ice was still there, things were melting. So on any given day, you might have a quarter inch of a half inch of water sitting on top of three or four feet of ice. And the snow was all melting. So the kids were expecting this winter wonderland and instead they got like tail end of winter. So it was a little different, but the trip was still very good. Where are they latitude wise? Way up here. Like give us a North American equivalent. I mean, to put it in perspective, we drove an hour and a half on our second to last day north and visited the Arctic Circle. Oh, so you're way up there. You're like Canadian Northwest Territories north. Yes. Okay. Yeah. So we went up, saw the invisible Arctic Circle, took pictures at the sign and did that whole thing. So even though it was thawing, there were still three to five feet of ice underneath. It's just such full sun exposure that there's melt happening. No doubt it done. I brought my VJ micro spikes. I would have created a Strava segment on that 10K ice loop and I would have set made and set the course record. You ever think of that? Yes. Well, they host races out there. In fact, we missed it by like four or five weeks, but there's the ice marathon and they do a Traveling, like what's the very worst thing you can do is soak through everything on day one. So we were kind of at a loss for running, but they have these things called kicks. They're little toboggan sled things. They look like a mini version of what you would stand on with dogs in front of you that would pull you like a dog sled. I saw Instagram stories of that. It looked kind of fun. Yeah, but you just kick on it and you glide across the ice. And people go get their groceries that way or get to work. So I did, I mean, I think my biggest day was 11 miles of that. But I did a couple eights and tens and seven mile days. So I did a lot of kicking and gliding. And it's almost like slow cross country skiing. The speed's fine, but like the cadence is slower. What do they call it? A kick. Kicks. They call them kicks. That's the thing. Because you kick your feet behind you, that move. So you're going to go get a kick and go kick around. Yeah, and you just bring your little micro spikes with you everywhere you go. They all have them in their little jacket pockets. And you get out there, you slip your ice spikes on and kick around the lake. So you didn't run much, but you kicked a lot. Correct. I think I ran once or twice. Okay, so interesting. If you were an athlete that you coached and they went away and they kicked their way through vacation, didn't run much, what would be, how do you look at that from a coach's lens? Oh, it would have been lazy because I could have run. This is not a scolding. No, that's my response. I would have said, well, you know, you could have because I could have. I could have found a spot to run and done it. And we had access to a gym if we wanted, but I didn't feel like being on a treadmill in Sweden. So I enjoyed my time and came back less fit. But my hip flexors and calves and glutes got a serious work. Yeah, your butt does look bigger. Yeah, you can tell I'm a little higher up on my seat today. Yeah, you got a little more volume in those cheeks rising you up. It's so interesting to hear that because it just shows the difference in our compulsion as human beings. And our place in life right now. Well, no, and I think there's a lot to say about going on a trip and enjoying it like I've done it, of course. And I have a race literally in four days, so I need to be on it, right? So it's different because you're not racing until June, I believe, right? So there's a time cushion, but June isn't that far away. It'll be here before we know it. I looked at my schedule yesterday and I thought, shoot. Not that far away. Yeah, it's not that far away. It's just so interesting. Guilt might be the right word for me. I hate feeling sloppy. And to my detriment, sometimes on vacations like my wife Jess, my training compulsion is an inconvenience. If she had it her way, there would be at least every other day where we actually just wake up, have coffee together and go about our day, but no compulsive Kirk needs to get up, have his breakfast, have his coffee. Sorry, honey, the next two hours are mine. We can reconvene when I'm done. And she puts up with it, right? And sometimes not without grumbling, but it's because I'm so selfish. And so it's just interesting. I could learn from that point being. And if I didn't have races for a long time, would it be different? Just an interesting thing because I never know how to handle it as a coach when somebody goes and their trip isn't really a trip because they stayed so focused on their training. And that's not good either. And then the others who are like, you know what? I was on vacation. I said, screw it. I didn't run for five days straight. And I'm like, I don't know how to handle that conversation all the time. So anyway, it's just interesting to make note of. Well, it's funny because everyone's strength is a weakness. Your compulsion is an inconvenience and my apathy towards training right now is an inconvenience. Yeah. The other thing is, and this is a massive excuse, but it's also a reason. Lisa was limping into the trip, not physically, but mentally. She said, I feel like I'm approaching burnout stage. Do you mind me asking why or do you not want to hear that? I don't know why. It's gotten to the point. I mean, I kind of know why. She completed her big goal of running every street in Milwaukee, but she got addicted to that process of exploring new neighborhoods. And now she's to the point where she has to drive, I want to say 26 or 28 minutes minimum in any direction to find a street she hasn't run. And so when she stays close and redoes areas, that doesn't fill her cup right now. And the big drives take up a chunk of time and then that feels unproductive. And she's been running for her big volume. Every time I talk to her, her running count of the last seven days is 45 to 47 miles for like weeks and weeks and weeks on end. And typically she's 40 on the dot. So even just going up five to seven per week starts to wear. So she's a little tired and she has nothing that is motivating her right now. But with the big trip, the travel coming up, you kind of lose a day and a half, two days. She just kept that. What we've talked about is go in a little overloaded on training so that if you end up missing a little bit, you feel fine about missing a day or two. Because like you, she has a training compulsion. But then she got there and just decided, I'm just going to wait until I want to run. And she didn't feel that for like five or six days. Good for her. No, really. Yeah, and imagine we talk about like the come down after like a big event. You train for an A race or whatever. It could be 5K to an ultra. And then the week after it's done, suddenly like you have that high and then you fall into this abyss of like what next and nothingness and almost this post-race depression. And then you talk about pursuing something for years. Yeah, two and a half years. Imagine the come down from that. Yeah. I get it. Yeah, I always think about like Chris Shipley or people who they run across a country and you get back and you just think, well, what now? Like what's the point of running around my neighborhood? Right. And yeah, we wallow in our own self-pity or whatever, but it's real. So for the first week, I just waited on her to run. There's nothing worse when you don't want to do something or can't do something to see someone else doing that thing. Anyway, we enjoyed the vacation. Maren, for those who don't know, is my youngest sibling. Their team was in the playoffs, so we got to see the first round of her playoff games. Wasn't she MVP of a game or two? She was MVP of the midseason tournament. And then I think they're waiting to see if she's MVP of the league. Oh, so she's the real deal. Yeah. It's so funny. I've said this before. She's real good. Yeah, I said this before, but like you're one of the most athletic people I know. And I really mean that. Like the way you move through space, your ability, your endurance ability, but your fast twitch ability. You can dunk a basketball at 37 yet, you know, have these endurance pursuits. And you're like, as we make fun, like one of, if not like on the lower end of athleticism in your family. And it's just really amusing to me because you're such the tip of the pointy end of the spear on athleticism. Yet, like you have a sister who could be an MVP in a professional women's basketball league. It's funny to me. It is. Again, whenever we get messages, and they're rare these days, but when people feel like we're just bragging about our athletic pursuits, we always laugh at it because they're like, I get where you're coming from, but I'm sitting here like, I'm the fourth or fifth best athlete in my family. I am very keenly aware of where I rank as an athlete. It's been fun to watch her though because mastery of anything is impressive. And growing up, obviously she was my younger sister. So we would play with her but challenge her kind of thing. We're a non-competitive family in that we don't want to put each other, we don't want to disrupt each other's progression. So we don't want to beat each other in the backyard at the cost of setting them back. So we would challenge her but let her play well. And then she went off to college and just became a better shooter than us. But we were still strong and athletic and could beat her. And then she went and played her first couple years pro and we came back and we'd like split 50-50 with her. And then something changed in the last year. This is like five or six years at least playing overseas now. And now she just can do whatever she wants. She's just mastered basketball. She sees every angle. She knows everything to do. If your foot's out of line, she's going the other way. If your momentum shifts, she's either the person who shifted it for you and already knows where to go or she sees it. She plays slower and it gets more open because she's seen it all. And it's just really cool to see that mastery component She has, I think she, when she's done with this, should pursue indoor or outdoor rowing. She can put out, we did a partner workout, I go, you go, with assault bike and rowing in between. She gets on the rower and with no rowing experience is rowing like 139 to 149 for the first few rounds, you know, for like 60 second bouts. But she can just, she's long, she can put out power. So it's cool to watch her. And it's a physical league, so it's cool to watch your little sister like bang in there and like bully ball and do some stuff. But it's fun. I can see you beaming with pride as you talk about it. That's excellent. We never knew with her because she's so lackadaisical and she never worked when she was young. We never knew where this was going. And she developed that over time. So what does this mean then, moving on from Marin, your running and stuff, what's the plan here? Well, I've been hitting it more since we got back. And I had a bunch of shoes waiting for me when I got back. And another pair which just came courtesy of you. Worst pair of shoes ever made. You can have them. I put them on expecting them to have changed the formula drastically. And I thought, oh, I really like these. I really like these. This is the Mizuno Wave Rebellion Pro 3, I think. And you have the 2s. And so the first run I went in with them, so they have two runs in them, Bracken, a 10 miler and a 12 miler. So they have 22 miles on them. The first run I went in them, I blistered so bad under my arches, size of a, between a golf ball and a baseball. Like almost my entire arch. And one of my Achilles totally rubbed all the way through. And it felt like breaking effect every time my foot hit the ground. So I limped home and cut my run short. It was going to be a long run. I was supposed to go 14 to 16. I cut it at 10. Gave it a month and a half. I'm like, oh, those damn shoes. I'm going to try them again. I taped up my arches with KT tape, okay? Both of them, just to be sure. Went out for a traditional long run. I have never felt, like, I don't know, the breaking effect is the only way to describe it, okay? I ended up going 12, I think. I ended up cutting it short. And I had not only felt so dysfunctional, like it is, I've never had a shoe work against me so hard. Both of my Achilles were like down to the tendon because my feet kept jamming into the end of my toes, shifting because of the breaking effect that that shoe provides with my stride. I had to tape my Achilles for the next seven days so I could just run because of that shoe. And not only that, but felt awful in them. It's the worst shoe ever designed if your foot does not hit the ground exactly as that shoe wants you to. Yeah. It's crazy because the first shoe is firmer than that shoe. And this one's a little more forgiving. And so I put this on and thought, oh, I could take this one longer than the first one. So last night I did three by 10 minutes on the treadmill. And I wore the first round I wore the twos and last, and then the second round I wore the threes. And I thought, oh, this is more, the first one felt faster to me, but this one feels more pleasant. It's much softer. No rubbing, no hot spots anywhere. Literally, I don't want you to say thank you. I want to say you're welcome for taking that god-awful monstrosity off my hand. You're welcome. I want to get to your- I really like Mizuno, I think, over this. That's how upset I am about that shoe and the 300 bucks I lost. Somehow I'm going to find a lawsuit down the back end and say that is unacceptable to sell to people for that much money. You are bad people. Yeah, this is the most polarizing shoe I've ever wore. It's one thing if it were, it's like, okay, well, I get it. It's another thing if your feet look like it went through a meat grinder and you ran 20 seconds per mile slower and everything hurts because it's literally pushing you backward. That's what I'm saying. This shoe is in my top three all-time shoes in terms of making me better just putting it on my feet. And you couldn't even get to a third run in the shoe. It's just unreal how much a carbon plate can screw with or help your stride. Filing a lawsuit. However- I'm going to get rich off of this, Bracken. Before we move on to your vacation, I've been trail testing. No, I want to hear more about your plan before June so I can get your training. Same thing. A threshold day per week, a leg builder ultra-style workout per week, and a mile workout per week. Just rinse and repeat all the way through the first race and then from the first race to the third, sharpen. And your races are mid-June through mid-July? Late, yeah, mid-June to first week of July. Okay. So it's real simple. Nine weeks of just rinse and repeat the same thing and then three to four weeks of sharpening. Okay, cool. So real simple, just try to check the box as many days as possible, which has not been my strength these last half decade. But the other side of the road is the trail, obviously, and I've been testing specifically the so-called trail super shoes. Now there's like seven I'm testing. I had three waiting for me, or two waiting for me when I got home. And man, I just cannot yet fully endorse the idea of creating a super shoe for the trails because exactly what you're describing. Every single shoe minus two of them has at some point that breaking effect, that working against your foot and stride effect, depending on the terrain. No matter how well they perform on whatever they're designed at best to be performing for, a trail is going to present you with other options and most of the shoes can't handle the other option. So when I see pros racing in these, I think I could see West Coast. I could see even Colorado, non-technical Colorado, where you're going miles at a time doing the same stride. But I tested these out in the kettle moraine this week again. They're just not worth it. What have you all tested? All right, so Nike Ultra Fly Trail, Sockney Endorphin Edge, New Balance, what do they even call theirs? I don't know, but I know I haven't heard great things about the Nike Trail Fly. Yeah, I'm blanking on the New Balance right now, which is embarrassing. The Hoka Tecton X1, 2, and 3, the Puma Deviate Nitro or Deviate Elite Trail. That's enough. Oh, VJ Ultra 3. Is that a super shoe? It has, I think, a two-thirds plate in it and it has super critical foam. So I think I'm counting it. And I know I'm missing more, but there's only two, I would say, there's three shoes out of all those that I would just wear without knowing what the trail looks like. The other four, I would not put on my feet without knowing the entire trail prior because they're just going to work against you and be terrible. I know what three shoes I think I could guess. Okay. Without a question, the Tecton X, probably two or three, doesn't matter. Two, they shouldn't even have the same name. The two and the three are not, they could have been made by different companies as far as I'm concerned, but yes, they both can handle almost every trail. I'm planning to wear the Tecton X2. I don't have the three in my race, my 17 mile this weekend. Unless it's super dry, I might wear my trail vaporflies, as I call them. We'll see. So that shoe, then I think the Saucony Endorphin Edge is a pretty approachable shoe. Yeah. And I get on with that shoe. It works for me. It does until it doesn't. That's telling you what I'm waiting for. And then you're going to say the VJ Ultra, of course, because it's forgiving. Yeah. So I'm correct. Okay. Yeah, absolutely. The other three have their strong points. The Nike for me is a theoretical. I'm sure it has strong points because I know people who like the shoe, but I can't find a single redeeming quality in that shoe. It's got a big heel to toe drop too. It's like a 10 or a 12. It's a high drop. It weighs more than the Speedboat with a 10 mil drop and no propulsion or roll or ground feel. I can't find a single thing it does well. It walks the best. It feels really comfortable standing around in. But there are people who love it. And I saw someone win a trail race in it the other day. So it works for the right person. Despite of or because of? Honestly, I couldn't race in it because every stride is like the Mizuno. I'm trying to find how to hit the ground in that shoe and I can't. Every stride feels worse except for like 5K pace. Maybe just under 10K, then it starts to like work in terms of not feeling bad. But at that point, I don't want a 10 ounce shoe on my feet anyway. So for me, I can't recommend that at all unless that's the kind of thing you're into. Okay. So what makes the – so I really should have bought the To me, it's like they took the best of whatever the Speedgoat was, or maybe the Mafate. It could be Evo Speedgoat. I don't really care. They just made every single piece modern. There's a plate in there. There's those dual plates, but they're not trying to rock you. There's almost no rocker to the shoe. No discernible rocker or tip to it. It's only there to give form to the supercritical foam. And the foam itself is so soft, but either how they tuned it or the use of the plates, it doesn't just mush all over the place. If you hit your heel on the ground, you're not just going to bottom out to the left or the right of the shoe. And it's light for how big it is. It has the kind of geometry to it that you can just heel strike and plot if you want. You can power hike in the shoe. I can run downhill in the shoe. I took it through this trail I have that it touches everything. There's stairs. There's single track smooth. There's uphill. There's downhill. There are rock gardens, both flats and up and down. And then the first and last quarter mile is on a service road. And it did everything just fine. But when you want to open up, it's still light enough. It has enough pop to it that you can actually run fast. So I think it's the single best all-around shoe that I've ever tried that's over $200. Which is funny because the under $200 shoes are better all-around shoes. But of the super shoes, it's the best all-around. I could just put it on and do whatever. Give me a more direct comparison between the two and the three. This is a purely selfish conversation. Well, right. But the way your foot hits the ground, does it feel like it's a faster shoe? Does it feel like it's really the same? It's forgiving but lighter? It's way more forgiving. It's 1,000% softer and more forgiving. It is a slower shoe in terms of off the ground because the foam is so soft. And there's a big rebound, but it gets more of a – it's not, but it's more of an alpha fly in that you can bounce in the shoe if you want to. Would you run a faster 5K in the two or the three on the roads? I don't know. Okay. I think they might even out, but you would feel faster probably in the two initially. But I think it would beat on me. Okay. You can save your legs in the three. You can sink into the shoe and use it a little bit. You can't do that in the two at all. Honestly, if you had one on each foot – I think the two saves your legs quite a bit compared to like the endorphin edge. Oh, yeah, not me. It's so interesting. All right. I would say honestly it's a regular speed goat amplified. That's the comp. Okay. All right. Well, I don't want to bore the listeners, so maybe we can move on. But I was selfishly just very curious because I've been thinking about what shoe to wear coming up. And I've been thinking about you and other people like this and that all these trail races are starting to loom on the horizon and the allure of can I find speed just without engine? Like is there a shoe that's just going to make me faster on the trail? And so I'm running in all these things I can run in. There's really only like one or two I would even consider that I haven't tried. But the answer is no, there's not free speed on the trails unless it's a smooth trail. I think that's pretty comforting to know actually. Yeah. Yeah, like the shoes we've raced in all our life are not going to lose out to these shoes from a mechanical advantage unless you're running a West Coast trail or a gravel trail or something where you can use the same stride for minutes and minutes and minutes on end, at which point a regular super shoe might be just as good. Okay. Yeah, you're not missing out on anything for your upcoming races. I can confidently tell you that. Although if this does go through, the 50K US Trail Championships out in California on West Coast Trail, there might be a more put under a microscope. Yeah, for sure. At that point, now you're talking about some benefits you can gain. Yeah. All right. All right, anything else we got to get caught up on your end? Not on my end. I want to hear about California. Oh, I guess just the announcement to the dozen of us out there who do care. I do get probably as many messages about this as I do after like talking about a single episode. Karting season kicked back up this weekend. TRP Motorsports is back on the track. Ready to dominate? Yeah, yeah. It was a scrimmage. It was exhibition week, but he won. And we changed a lot on the karts. We broke a lot at the end of last year, and I didn't screw it up. Kart was ripping, and he looked like a vet this year. Heck yeah, man. How old is he now? He's 12. I was going to say 13. Okay, so he is in sixth grade? Yes. Okay, cool. All right, well, go get him, team. He's got a pair of new racing gloves. I don't think he's going to be wearing those. No, those are going to go framed up on his wall. Sweet. Love it. Kirk works with, trains a professional race car driver in the gym, and that guy heard about the karting and signed a pair of race gloves and sent it this week, so that was pretty awesome. Braden was flying. Was he? Thank you, Aaron T. Let's see, dress for Lexus. Yeah, train him in the gym. In fact, he's gotten, Aaron, he's gotten himself pretty strong and jacked. Yeah. It's interesting. He'll go, he does these up to 24-hour races. I mean, many are four, but four, eight, 12, you know, you can do the multipliers. But after his last 24-hour race, he bailed on me. He's like, dude, I am so broken because, like, he couldn't, like, his legs, his hips, his core, what you need to do. I think I talked, didn't I talk to you about this on the podcast? Maybe this is offline, but it was about a year ago, and I said, Aaron, why don't you wear a heart rate monitor for your race? I think it was a four-hour where he was behind the wheel. Some of these 24 hours, you switch in and out drivers. I don't really understand at all. It's like a relay race. Yeah. And he averaged 161 beats a minute for four hours in the race car because of the cockpit heat, because of the muscle tension, because 161 beats a minute sitting down in a race car. The amount of force you have to put on the pedals, you gas with your right but brake with your left, the shifting, the, anyways, 161 beats a minute for four hours in a car. Wild. Those are athletes. It's a real athlete watching people race cars, by the way, folks. I found that out. Well, it's funny because it was yesterday was the day, or no, it was Sunday. And so Braden had about 90 minutes of driving time, and there's no suspension. You're sitting in a basically carbon fiber seat. There's no cushion, and everything is jarring, and he is sore. 90 minutes, he's sore. And he said, yeah, we need to start training for this. His neck is sore from bracing against, and his hamstring, right hamstring is sore from all the pedal work, and his forearms are sore, and his core is sore. So it's funny that it doesn't matter what you do, if you do it hard enough, you have to train for it. Yeah, very interesting. Okay, well, good. Go get him, Braden. So you went out to California, and while you were there, you and I have talked about Dave, right? Yeah, we have. Yeah, David Shoshesky, who I, a college teammate of mine back at Oshkosh. He was two years my senior, so yeah, two years older than me. And you've kind of identified with him recently because he is an older athlete going after it hard. And you were all excited because he's prepping for a marathon, and you were going to be out there in time for, I think it was his last big workout before his taper starts. And then it would be a nice indicator of where you sit in your marathon prep, so I want to hear about it. Yeah, well, you know, the whole training, create damage, adaptation slash recovery, and then finally seeing benefit from that, that cycle was made very obvious to me the last, like, three weeks because, boy, did I pay the piper on the back end for that trip. Oh, yeah? Oh, I don't think I felt as consistently bad in my life as I did the seven to nine days after that trip. Oh, my gosh, was I gone, which I guess was the mission, but, like, so many people get in their heads and beat themselves up about bad days, and you think because you took two easier days after a hard day that miraculously your body is going to be fully recovered, adapted, and better, and the cycle takes longer than that. It just does. You can pop around life feeling good. I'm walking through the grocery store. My legs aren't sore. I have energy, I think, in quotes, and then you go to do a quality session, and you think, I'm going to feel good. Warm-up's fine. Your legs aren't in six days. Here at training camp. Hence the compulsion problem on vacation. So yeah, so I got together, got in late, didn't get to the Airbnb until like 11 or so. Can I interrupt? Please. Just say Jess, you're a saint. Because we know what a two plus hour run is. It's a three hour door to door thing. That doesn't count the food and the prep prior and the shower and the lounging and puddle afterwards. So that's a big chunk of a vacation. It is, right. Which is why your vacation interesting compared to, but we don't have kids and Jess trains, she runs or something while I'm out doing it. I did 20, she did 10, right? And then walked afterwards and enjoyed the California coastline. Like it's not all doom and gloom, but no, this was a training trip. She knew that. We picked somewhere where I could get into the mountains and train. But yeah, we got together, got in late, then got up early the next day, maybe five hours of sleep or so after traveling and drove the hour 15 or 20 to Palo Alto, not far from Stanford's campus. And we met for a 20 mile long run with- Oh, your first morning after the flight was a long run, quality long run. Yeah. Just rolled out of bed and drove there. Nice. Yeah, yeah. And so- What was the workout? Oh, we did 20 miles. Let's call it like, not recovery pacing or effort, maybe like a deviation above. And then from miles 10 to 15, we made a tempo press. He calls it steady state. I call it tempo semantics. And then we finished with five miles after that back into like a, you know, moderate effort. So 10 miles, five mile press, five miles, 20 miles total. Now what shape is he in? What's his PR for the marathon currently? 220 flat. Okay, so he's looking at Olympic trial qualification as a 44 year old man. Yeah. David just, the Carlsbad 5K was this last weekend and he got out kicked for the Masters win. He went 1507 in the Carlsbad just Saturday. Did you see Glenn? Yeah, 1540 something or 50 something? 53. Same exact time as last year. Glenn, Ray, shout out man, you're a stud. Because he was 41? Four? Five? Four? Somewhere in there, yeah. What was our cooking still? 1507 and 220, like that's running. Yeah, I think his goal is to, he would love to run. He's run 68 and a half, I think in the last. But anyways, point being, it was a windy up and down undulating trail, bike path, full of runners. Yeah, and we ran 15 or 516 pace for the five mile press from 10 to 15. And I was stretched. I was stretched. But it was there. I wasn't racing, I was one deviation below that. Well, what did you average for your half? 5.17? No, was it 20? I think it comes out to like 5.27 or something. Okay, so you're running faster than half marathon pace 10 miles into a run. Yeah. That's great. And that was fine. What's actually great about that is I felt great after that run. It wasn't beat up. We both had our alphas on, right? And then Monday felt great. Tuesday didn't feel too bad either. But it's the mountains and the descending that just crushed me. Like I can go run flat on the roads. I realized my body's ready for that. That was on a Saturday, that long run on the roads. I think we got almost 1,000 feet of gain in the 20 miles because it's rollers. I thought it was all perfectly flat out there. I think we had like 1,000 feet. Yeah, that's right. Yeah, so, but that's fine. But then Tuesday I went out for two hours in the mountains. So I ran that Saturday, did 12 on Monday as a recovery run, felt real buttery, no problems. And then Tuesday went to the mountains and just tempoed up a couple of climbs, hit two hours and just under 4,000 feet of gain. And then Friday before we left, I did the exact same thing. So two hours, two days off, two hours, two days off, two hours. And by off, I mean, I did recovery running in between. So by the time I got done with that and the descending, plus I went to the gym and did a heavy squat lunge day on Wednesday after my two hour Tuesday, I was obliterated. Well, 4,000 feet of climbing also requires 4,000 feet of descending. And if I had to guess the most descent you've done in a run since probably fall is probably like, what, 1,200 feet? Not even. Not even? I haven't been to the trails and descended with purpose, no. Yeah, so that should obliterate you. That's a big training week. Yeah, yeah. So it was. And anyways, you know what's nice though is like the strength work and all you guys that don't do your strength work or do your strength work. The first time I could descend hard, I still had some climbing legs left afterwards. Like I think it served its purpose for a one shot. I can still do it, but then the recovery hammer just crushed me for like 10 days. The hips, there's no pop in the rear chain. CNS kind of governed, right, just snubbed. And so came back and pretty much laid eggs on every workout I did the whole first week back and felt terrible doing it and hated it. Which I guess is just that we should know better, but when you're living it, you're like, oh shoot, like I should feel better and I don't. Well, there's no damage, like descending damage. I agree with that. It's just not in, I don't like in sport, in terms of body weight activities with no other forces acting upon you, I don't know if you can hurt yourself harder than hard descending. Well, and the dumb thing, because Jess wants to get out in the mountains and hike on the other days and I do as well, because we love it. Tuesday was two hours in the mountains, me running. Next day we went eight and change with 4,000 feet of gain and loss, just hiking. The descents every step hurt. And then Sunday we did the same thing after my 20 mile long run. And so really there's four mountain days in there. Two are hiking. One was 10 some miles with 4,000 feet of gain and loss. And pretty soon I'm going up and down four out of the seven days. And like, you just, no wonder you felt like you've been put through a blender, right? Even walking downhill hurt and sucked. Shocking. No shoe for that. No, and honestly walking downhill is worse at that point because it's such a long contraction for each stride. My quads insert to my knees. My left leg was given out on me for about six days. I'd stride funny and almost like my leg would buckle because of the quad insertion into the top of my knee, like just totally screwed. It's all fine now. But anyways, I think it's more that. So the biggest takeaway from my trip was one, fitness is good. Two, idiot, like it's gonna take a while to come back from damage like that. And so being kind to yourself after training camp, I would encourage it. Well, I just looked at my Strava really quickly. And on my last trail test shoe day, I got 1,300 feet of descending. Oh, purposeful descending? 50-50. Maybe not 50. I split it into thirds. I do a third where I'm just quick feet chopping to see how they work on technical stuff. About a third of it, I'm flowing it. Just letting the hill do what it does to me. And then a third of it, when I get on the access road, then I'm trying to run fast. So that was like 4.30 to 4.50 pace going down that stuff. And I was beat up for two days with 1,300. So you had an extra 2,700 feet on top of that. And I assume you weren't mincing steps on a third of it. Correct. Because there's no steps to mince out in California. No, there are not. So you get it. But I can't even imagine doing 2,700 more than what I did and then doing it again in three days. It shows the durability you've built up. You may not feel like you have that in your legs. Like I could withstand one and then it crushed me. But the fact that it crushed you and you could do it again is really good. That's a good sign. I mean, I could do it again feeling real bad about it while doing it. Yeah, but you had the option to do it. That's fair. Yeah, and then so I think racing calendar-wise, I got Zumbro 17-miler this weekend. That's on Saturday. I got like eight athletes racing too, which will be fun. We're gonna have a little bit of a party, which I'm really looking forward to. And then Grandma's in June, Afton Trail Race in July. And then I did sign up for the US 50K Champs in August in California. I'm not married to it, but I am gonna keep it training as if that is the intention. This right there, Kirk, is just another example of why training partners matter. You went out and ran one day with someone really good and you signed up for the USA Championship. That's just Race is six days after the 50K US Trail Champs here. Good, you shouldn't run that anyway. Run which one? The Twilight. You don't think it's possible to PR six days after a mountain trail 50K? I don't think you should do it even if you don't do the 50K. Oh, really? Yeah. Yeah, it's the worst setup to run fast ever. Every year you put it on a pedestal. Every year the weather dumps on you. And you use up one of your magic bullets on a day that you can't possibly PR. And I think if you don't have it on your calendar, you'll find a better race. That's probably true. And nobody PRs at that race. No one. It's a great race. It's a terrible PR atmosphere. The pros that show up run 30 plus seconds slower than anything they're actually capable of. I mean, everybody runs slower there, but it's a good point. So anyways, yeah, that's pretty much all the updates. We had a nice time there. We did a lot of hiking. We did a lot of ocean stuff. We did relax after the training was done. We had good weather. It was nice. So now back to normalcy. No real plans on my end as far as travel or anything. I don't know. What about you? Yeah, there might be some more travel coming up. Okay. A month from now, I may be heading to Abu Dhabi to commentate, to do some logistical stuff on the back end with a race and then commentate it. Do you want to elaborate on that? Not yet. The contract is pending right now, but there may be a Middle East trip coming up. Would it be something that we could, if you were in the OCR sphere, you could probably figure it out? Yeah, probably. Okay. Seems to be a lot going over in that region of the world right now. Yeah, they have money to burn and they love the fitness community. I mean, some people will call it sport washing. Others will call it a government-led fitness resurgence. But whatever you want to call it, there's oil money and there's competitions. And they seem to like to pay the Americans when it's all said and done. Yeah, and the Europeans too. Yeah, Europeans. Do you want to touch on any track and field, Grand Slam track, anything that's been going on here in the last month in the professional circuit, any thoughts on anything? I have some thoughts. I want to save it for Friday. But what I do want to do is tell people to go online this week. This is dropping today, Tuesday. So you'll have Tuesday afternoon or evening, Wednesday, Thursday, Friday to get caught up with what we're going to talk about to some extent on Friday. But the Grand Slam track meet and NCAA indoor championships. I think you should watch the probably 400 meters is the cutoff. Watch it, don't watch it. It's whether it interests you. But the 800, the 15, the 3,000, the 5,000 indoors. And then I think the DMR relay is always a good watch. Both sides, yeah, men and women's. And then watch Grand Slam track. There's an 8 and a 15, and then there's a, what is it, 3K, 5K? Yeah, 3K outdoors is weird. Very weird. Anyway, watch those because I have some takeaways. Kirk obviously has some takeaways, and it's going to lead into the topic for our weekend long run episode this week. So catch up if you want to have better background for what we're talking about. Well, and it's fun to watch. So just go do yourself a favor and watch it and enjoy it. Grand Slam track has a YouTube channel that you can watch it. Also, Grand Slam was aired on NBC, and so you can either go to NBC Sports on YouTube or Grand Slam track has some of the stuff. Or watch the whole meet on Peacock, whatever you want to do. Yeah, and then NCAA pretty much put out every single event. The best place to start if you guys are wondering is like literally just type in whatever event interests you the most. Say NCAA 1,500-meter championships. Click on it, watch it. It'll start feeding you the other races, right, as your next watch. That's a good place to start. Yeah, so you can just start there because otherwise you've got to scroll quite a ways back to watch now on the NCAA feed. But you probably have two hours of viewing of really good racing. And when you talk about racing, just know the championships are racing, the NCAA, and then Grand Slam track at its finest is racing, not time trialing, which is a whole conversation we will probably get into on Friday. Do we need to catch up on anything else? Is there anything else top of mind for you? No, and you know what? We're already at 54 minutes here, which anything we forget, we'll add it to the long run. Okay. Yeah, it's good catching up with you. I don't know. I feel like I was missing it. I was like, what's going on, Bracken? Hey, actually, the people want to know. What's going on with Race Brain? Restructure is happening at Race Brain. Okay. It is very apparent that – I guess we should walk back. Race Brain was started. The initial conversation was a voice for the athletes and the diehard fans in the OCR space. Okay. We wanted to provide entertainment, clarity, talking points, debates, and then hopefully have an influence over the sphere of OCR. It was started around the time of after the athlete protest in Spartan. Little industry was in flux. Bad decisions were being made, in our opinion, with the direction of OCR, and there wasn't a place you could go to to just hear recaps of the races from an athlete perspective. Non-interview style, just entertainment, roundtable discussions about OCR. And OCR in North America is flatlining, and it was becoming too difficult to come up with content each week for the diehards. And so it started getting just filtered in with hybrid sports because that was growing. But as long as it was an OCR show, half the people were frustrated if we talked about Hyrox a lot. Rich is now all in on Hyrox, and he's kind of like the leader over there. So if the person helming the ship doesn't want to go in the same direction where the ship's going, then there's always going to be like a little bit of, I don't know, tension one way or the other from an audience perspective. And so we are just restructuring, and this is going to become a hybrid show. Because I haven't seen many episodes be released lately. Yeah, there's a new brand. There's a new platform. A website's in works. The roles are going to look differently. So it's just going, but it's going to be structured completely around hybrid racing. That there will be, people will be in charge of different verticals as the current generation wants to call it. So there still will be an OCR component to it as needed, but it'll be a component of the larger brand. It won't be an OCR brand. It'll be when there's something that needs to be addressed, it'll be addressed. But that, like Jack and I talking OCR each week isn't going to be a thing. A rebirthing of sorts. So it'll come under a new name. Yeah. Same feed, new name. I think it'll probably be a different feed. My face is probably going to have to come off the thumbnail, hey? Yeah, I mean, I'm probably going to be off the thumbnail. My role is going to be different over at this one too. Which I'm excited about is my role there. My primary role is going to be hybrid shoe and gear testing and reviewing. Ooh. So, and he'll let me throw my trail stuff in there as well. But it'll be just a dedicated me testing out what's needed to connect you to the ground in Hyrox and hybrid sports. Love it. Okay. We're just curious because I know we've talked about it. Normally we have to schedule around your race brain recording on these days, but you haven't brought that up lately. Like, hey, I'm good. Yeah. So I was just curious. And some of the finalized conversations were had while I was in Sweden. So I have to have a, we have, I want to say tomorrow we have our group meeting to go over exactly how things are going to look. So I'll have more clarity after that. But yeah, it's going to be an entirely different offering, but it's going to follow the sport that seems to want to be a sport right now. Yeah. Yeah. It's on the right trajectory. All right. Well, I was just curious there. For those of you listening, I was a co-host on there for about a year and then decided that my bandwidth, something had to go and that was it. But I have a vested interest in how that is going. So I was curious. So I think the, I don't want to overstep, but I think Vijay and Jack are still going to keep tabs on the OCR side of it. Okay. But I could be wrong on some of that. So, well, hopefully there's a resurgence on the OCR. I saw in Charlotte this weekend, there was a more dense and deep field and participant numbers look pretty good. Not that the top end athletes that we know from the past were there, but there's hope. Riker was there. Riker was there. That's all that matters really. That's right. As long as you have the Riker line set, the race matters. All right. So we're going to come at you with a little bit more knowledge and some quandaries on Friday's episode, folks. Kirk, good seeing you. Good seeing you. Ladies and gentlemen, good being heard."
}