{
  "guid": "d46f7e59-374c-3bf5-88ac-9fe457a658b3",
  "title": "Episode 515: Play to Your Strengths",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. Whether you are a brand new runner or you already have a great mustache, we're here to help you increase your running knowledge and present it at a practical level. This is The Running Public. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. Kirk, three days ago we recorded Training Tuesday. I believe it was three days. It's hard to tell. I got sick in between. I slept like probably 16 hours yesterday. I'm all scrambled. I don't know what day it is, but I do know that we previewed a topic for today that I wanted to talk about, or I slightly previewed it. But you and I haven't talked about it at all, and so you're going in totally blind, and I kind of like this. You enjoy doing this to me. It's been... Yeah, and you I. On occasion throughout history, you are like, I'm not telling, but we're doing it because I want to get your knee-jerk response reaction unfiltered. So I guess here we are. Yeah, and this is actually less unfiltered and more that it is a very broad topic. When I say the title, you'll realize this is very broad, but I had my brain go three specific places with this topic, and I'm very curious where yours goes. I'm standing at the edge of the woods, and I see many paths to take. Yes. And you're curious which one I walk down. Is that what you're getting at? Yeah. So the title of today's episode is play to your strengths as a runner. Okay. What immediately is your first reaction to why or how a runner should play to their strengths? Because this is very broad. We could go many different directions. Well, I'll answer, of course, and I'm not buying time. I'm genuinely curious. Why this topic? For two reasons. Yeah. First is I've been watching a lot of track lately. I asked the listeners to watch NCAA championships and Grand Slam highlights, and the tactics of racing really highlighted that there are many, many, many racers at the high end that do not play to their strengths. And then this is really the season right now of athletes trying to choose races for later in the year and choose what their A race, if they haven't already, they're trying to decide on their A race or their big ultra or whatever it is on the year. And it's been interesting to watch there and be with them on their process of how they think about what races to choose. And so those two things coincided for me to want to talk about how I believe or the fact that I feel that most runners do not play to their strengths in one of three ways. Okay. That makes sense. And none of this is introspective or selfish in nature on your end? I think everything we ever talk about is in some way, shape or form. But no, this is not about me. It's not about you, but it very well could be. Yeah. Because I immediately started thinking about myself, if I'm being honest. Yeah. Well, like what? Well, and to preface, it's just interesting that this is what you want to talk about today because I feel like we've dedicated even more than a single episode in the past to talking about the opposite, working your weaknesses. We talk about it in the off-season builds like, okay, you already have this arrow in your quiver. You don't need to keep sharpening it. Let's go to the next, right? And that's not necessarily the vein in which you're asking this question, but it's just interesting because I'd say we've spent more time talking about the opposite. Yeah. You know what I'm saying? Yeah, very much so. Yeah, but I also think that we are at the, see how I'm putting this off? You still don't know what I'm thinking. We're also at the time of the year where racing is beginning and the time to work your weaknesses is always, but now we want to strike and be successful and play into what we've worked hard to earn, which is our strengths. Yes. Spin it that way. Okay. Okay. So playing to your strengths as a runner, is that how you worded it? Yeah. Play to your strengths as a runner. Well, the first place that my mind went was immediately to race schedule. What are you choosing? I could go set myself up for a mountain altitude race that is above 10,000 feet and would not be playing to my strengths as a runner. So right away, and I've experienced that in some of the mountain race we did. So right away, I think about choosing your race schedule. That's the first thing I think about when it's playing to your strengths as a runner. I guess that'd be the first path I would take. Do you want me to lay out some more? No, let's start right there because that's one of the three. For you it is. Yeah. One of the three that we're just weighing heavily on me this last week. Weighing heavily is a little bit dramatic, but on my mind. And that is we have goals as runners and the goals are usually based around either performance or finding out something about ourselves. For example, you might want to run a 5K because you want to set a PR or you want to find out how much you've improved your last training block. Or you might want to run an ultra because you want to try to win an ultra or do well, or you want to push yourself to the absolute limit. Or you might want to run it because you're not sure if you can and you want to get to a place you've never been and find out what happens to me when I get to the point where it's not fun out there anymore and there's still 20 miles to go or whatever that distance may be. So those kinds of things where choosing to play to your strengths in those scenario would directly change your experience with either of those two goals. Yeah, definitely. Although, well, first, I guess it's early April. So although things do fill up, there's usually a window still to pick your start lines, we'll call it. The other thing I think about with that is I think we're talking, this conversation in particular would be like racing to your strengths, I guess is what we're starting with, right? Kind of. Well, choosing a race. Choosing where you race to start with, yes. Sure, and racing something in which you feel like you're going to be set up for success. When I think of that, I actually think about what comes before then, meaning if, for example, you see in track, very often you see one of two things amongst especially middle, actually, middle distance and distance runners, you see a 10K guy race down and run the 3K and the 5K, and then eventually he gets to or she gets to his goal race of a 10K, which perspectively feels much more comfortable because he's run shorter, faster races and plays to his strength that way. He works his weaknesses in route to the finale of his strength. And then you can also see vice versa, an 800 meter runner or a 1500 meter go up and race the 3 and 5K to work on their, in quote, strength, which ultimately leads them to bettering what they aim to perform their best at. And so I almost think like, yes, I think you can shoot your shot, which we do a lot, especially me. I don't race a ton, like just showing up and nailing it. But I think about the lead in a bit as well. I don't know, but that's where my mind first goes. Like if I care about an A race in middle of June, what is X, Y before Z happens? Yeah, I believe so. So anyways, so that's where my mind first goes. What about you? Well, I think mine always starts with choosing the race first. Well, I agree with you, but I guess like a photo finish for me at the line would be right behind that would be what comes before that. Yeah, yeah, I think so. And that would be the second thing that was on what I'm thinking of this. So we touched two of the three now. One is what race to choose, play to your strengths for that. The second is how do you even get there, play to your strengths for that. And then the third would be how do you execute the race itself? Well, thinking about yourself, which sounds better to you, Bracken? A string of mile races in June and July, and then an ultra some months later, or the opposite, an ultra in July and then a string of miles. The second one sounds terrible. Yeah, I agree. Yeah. Okay. Yeah. So I guess starting with choosing the race and then moving to how we get there and then finishing with how we execute. If the 5K is your example, I'm running this 5K because I want a PR, or I'm running this 5K because I want to see how I've improved. It's astounding to me how many times someone says, hey, I know this isn't our goal this year or whatever is happening, but I really want to PR a 5K. And I have this 5K I'm going to do. And then I look into it and I say, why that one? This looks like a terrible course to PR on. And then there's some answer like, it's convenient or my friends are doing it or I've done it every year or I know the race organizer or whatever it is. I feel like you're directly talking to me. No, no, no, no, not at all. You could be. But I could be, yeah, I suppose. Looking at your 5K you run, it's always hot. It always happens way too late at night. And it's not even just hot, it's beyond hot and the running conditions are bad. But the people who are like, I do this 5K, I'm going to do it. I'd really like to PR, but there's from mile two to two and a half, there's a hill where we gain 90 feet. It's like, yeah, but you're a terrible hill runner. And you don't say that, but you're a terrible hill runner. You want to PR a 5K and you're choosing a hill you're out. Or I'm going to do this one because it's convenient. It's really close to my house, but there's 11, you know, 180 degree hairpin turns on the course. It's terrible. No one PRs here. But why are we doing that then? And that's just a 5K example. The other side of the coin is the ultra, which is I really want to run my first 50 miler. I want to challenge myself. I want to see if I can. And I've chosen to do this one. It's like, why? So all my friends are already doing it or I know the race director, but it's a course that is set up for them to do terribly on. Like you said, it's at altitude. They don't live at altitude or it's half of it's sand and they don't run in sand ever or too much of it's on pavement or too much of it's in the mud or whatever it's going to be where they think that all ultras are ultras. And as a result, that's what you need to do. And if I choose one that maybe is easier in quotes or one that is more to my wheelhouse, then I'm shortchanging myself on the grit or the drive that's going to tell me what I need to know in an ultra. And the reality is you're going to get to that place no matter what. It's whether you're going to have the skill set to keep going in that place or if you're going to have the skill set that evades you when you get to that place and now you've shortchanged yourself on the ability to dig deep. So either 5K ultra, something in between, that kind of scenario where your goals and their chosen race don't really align well to set you up for success. Can I walk this back? Yeah. And this is not where you wanted to go with this conversation. Well, I didn't prep you ahead of time, so wherever it goes, I'm happy with it going. Okay. Because I'm asking myself this question this very week, actually. And, you know, you'd think I would have an answer, a concrete answer to the question, but I don't. And if I don't, and I started endurance training when I was 14 and been consistent ever since, I imagine a lot of our listeners don't either. And this also changes the answer to this question. And the question is, what are my strengths? How do I even know, right? Like, how do I even know? And to use myself for an example, and then let's talk about it, is I have this US 50K trail champs that I basically impulse signed up for, okay? Which is okay, actually. That's a great thing sometimes. Sometimes those are the best things to do. But it's not tomorrow. It's all the way in August. Yet, in this whole last two or three years, I've been like, well, I still have more sharpness in me than most, and I want to go chase the 5K, right? And then I historically look at what I've done well at, and you look at all the information from your training and racing and your own personal desires, and then I go, gosh, if you put a flat and fast 5K in front of me and a mountain ultra at sea level, right? And you put us all, both same race fields in these two races, right? Which one do I actually rise closer to the top in? And my answer is, I actually don't know. What are my strengths? I'm saying, if all those 50K US trail athletes line up, am I beating them all in a 5K or do I take 20th? And somehow I have a good day and take 10th in the trail champs. I don't know. And so what I'm getting at is I've been waffling over this. Like, what am I doing? Am I an idiot to go chase this mountain 50K champs when really convenience or more opportunity, I should be still just hammering the 5K for six weeks, give it a real honest shot, hit it a few times. What am I going to succeed at? So this is a selfish part of the conversation. So then I defer to you and the listeners because I'm working through my own answer. What are my strengths? How do I know what they are? This is the exact conversation that I'm having with people right now. 100%. This is the perfect example. And your answer is a little different than most, which is you are a very balanced runner right now. Of anyone that I work with, and I'm just going to put you into the pool for the sake of this conversation, but of any athlete that I work with, you are the most balanced from 5K to ultra. If we plug your times and performances in at one thing and another, you're not going to have a lot of outliers. You have worked your staying power so much combined with your college middle distance speed. You are a really well-rounded runner. And so the distance right now, there is not one that jumps out at you, whereas for me, it would. The shorter, the better. And it always will be. Except that the middle ground is almost the worst. Yeah, you're longer, the better too. Like get me over four hours or under 12 minutes. But that could also be, we all don't just have one strength. Many of us have more. So that's actually something really important to bring up for people starting to think about themselves is it may be two things that are very far apart. Right. Could be. So then part two for you is if there is not a glaring difference in strength or weakness for distance for you, which I don't think there is. I think you are very well-rounded. You've earned that. But it hasn't simplified your race choice. Sure. The second question then is, all right, if it's not distance, then it's location. Sure. It's course type. And so we look at it 5K, 15K, it doesn't matter for me. I have an engine that can do both and it suits my skill set. What should my feet be hitting to set me up for the most success? Are you better on the track or the road for a 5K? Is it indoor track or is it outdoor track for a 50K? Is it the California trails with a lot of vert but none of it's technical? Or is it a Midwest 50K where you're going to have rock gardens and mud? Or is it an East Coast 50K where you're going to be trying not to snap your ankles for four hours? Which type of those are you most suited for now? And on top of that, what type of workouts in the past have shown me the ability to improve at? What I mean by that is if I run flat intervals for eight weeks straight, do I get significantly better at running flats? If I run 30% of my treadmill for eight straight weeks, do I get significantly better at 30%? If I run at that douche grade for eight straight weeks, do I get better at douche grade? For me, the answer is I don't get a whole lot better at douche grade. I get better at the poles. Again, I think I'm a polarized athlete. But that middle ground, I don't get a whole lot better at that. So while I know I'm not naturally good at middle terrain, 5% to 10% incline, and I know I don't get better at it, then that now is a clear sign of no matter what race I'm choosing, that wouldn't be the location terrain type to choose if performance was my goal. Sure. So zoom in a bit more is what you're saying, really. Always one notch further, yeah. Yeah, yeah, zoom in a little bit. Click that scope one more. Yeah. Well, I wasn't even asking to dissect it for myself, more as using an example for people to think about. But you just gave me some good things to think about. So I guess I'm going to kick it to you right away again, and then I'll just play cleanup, is how do our listeners decide what their strengths are, I guess? What would be the pool of case studies you would pull from or workouts or intuition, anything? Where would you guide people first? I think you just start by thinking of what have I felt during every race I've ever run? What courses am I on thinking, will this ever end? Or how is everyone so much faster at this thing than me? Or what courses where I'm thinking, oh, I'm really gaining ground here. I think that pretty, if you've raced semi-consistently in your life, you have a big enough sample size to pick from to realize what am I actually kind of good Let's just lost ground. And the rougher and more technical it was, the more I made up ground on people. And the same thing... You're comparing yourself to the very pointy end of the spear, but that's what we must do. Because you are a better descender on smooth, gradual descents than 99.9% of people. But when you're comparing against who you're going shoulder to shoulder with, you act in that... Just to be clear, it wasn't so obvious that it was embarrassing. It was just by comparison to the best of the best. You're right. The people I was trying to race against. I just want to make sure. I'm giving you a little credit here. You're a dang good descender. I've done it with you. And yet, every single one of those guys on that list out descends me in Tao. What happens to us every time we run a workout together? You just leave me on the descents. Barely. There's only one descent ever I've had even close to a leg up on you. And that was the worst technical descent. And it was like 30 seconds long. Let me just tell you, there's been two spots here about Bracken. I'm just going to stroke your ego a little bit. Both times when we've done sessions where it's like, yeah, I don't think I can safely keep up with you, literally. Like my feet can't move as quick as they need to to dodge the technicality, the boulders, the rocks, the ruts. It was like 30% grade. Like very steep. And there was hardly a flat place to put your foot, meaning it was boulder fields or it was so steep that like it might have been 40%, one of those at the ski hill, where like you have this other ability where it's like I literally am going to maybe seriously hurt myself if I'm going to get going faster and my legs can keep up, I think is... Yeah. You're making me think on that. 30% unbelievable technical. I've never seen anybody descend like you on that. And that's very kind. And I'll take your flattering. But you know I'm right. Like I said, people leave me on most descents and they don't on that type of descent. Or I catch them on that. And so right away I know if I ever want to choose a race, an ultra or a mountain race, for performance as my goal, I must find something that is more technical than less. And that is more steep than less. And so right away off the bat when I'm watching videos on YouTube to try to find what race interests me, I skip to the next one as soon as I see that they're on gravel road or dirt road. That's just not going to be it. I'm going to give up minutes per mile right there and there's not a thing I can do about it. And for you, I think you have a, again, really well-rounded descending set. You've made up time on a lot of people on a lot of terrain types. And for climbing, I don't know about you. We've never been next to each other climbing really in a race other than maybe at, in Minnesota that one year at the Spartan Sprint. And I don't even know if we were next to each other very long. No, you were ahead of me. I mean, you had a great race there until you got lost. So point is, I don't know what your climbing is, but you do. You can look at your peers around you and say, what grade do I climb best at? Do I climb best at uninterrupted climbs or broken climbs? And what grades do I improve when I'm on my treadmill and which ones are always just kind of a struggle? And then that starts giving you the blueprint for, now you can't change where the 50K is held for the USAATF championships. But in terms of looking at future races, you will have a blueprint of what style of race suits me at my core talent-wise. It doesn't align with what we want to run. But in terms of pure performance, if that's the goal, we can look back at our races and just know, what should I really be running? If I had to just design a course to make me win, what would it look like? Yeah, I'd give you a fighting chance anyways. Well, for me personally, I can tell you that when I've been in heated battles, I lose ground going up. It doesn't matter what the grade is. And I think a lot of it is because I'm 20 pounds heavier than anybody I'm racing. And then as soon as we flatten out, I reel them in. As soon as we go downhill, I reel them in even faster. If they're around my ability level. But up is still my, for sure, my Achilles heel when it comes to whether it's a short race or a long race, but the longer race in particular. So I know the answer to your question. Yeah. Point being. But then there's another, like you said, dial in one more. One more click in on the scope. The next question is, would I still have an advantage over them on the flats and downs if we hadn't gone up? Do I need to find a flat 50K? Or do I need to find a 50K that has punchy climbs and then time afterwards of running? And I don't know that about you. But you probably... I lose less the steeper the terrain is. I gain it back. So if you could find something steep and short on the climbs with long gradual descents, that might just maximize your running ability. 100%. Yeah. Steeper. It starts to even more out once we get to that like 20, 25 plus percent grade, which a lot of that stuff is in these races can end up that. But yeah, that middle ground, just like you said, it's like deuce grade plus is like I usually lose. I lose a lot. I lose a lot of ground on that, unfortunately. Okay. So the listeners then have to... First, you're suggesting that... Do some self-reflection. Okay. Like think of when I felt like I've nailed it and I've been happy with my performance, either for myself or compared to others. And then I think the other thing is to add on to that is looking at your training and you have to look at it closer than like... Because it's very... To look at like just flat metrics, like going to the track or running repeats on the roads, it's very objective, right? It becomes super objective. Like I know I'm a seven-minute miler and I know good people are four-minute milers. So like I have a comparative. But when it comes to terrain, it becomes much more subjective. So then how do I take metrics out of it saying, do I generally feel good and accomplished when I do flat repeats on the track and I feel bad and stupid and I want to give up when I'm on muddy trails? Or do I feel like I embrace it and get more of myself on this type of terrain? But when I'm on the flat track, it's so boring and mundane and my legs feel heavy and I hate it. So I think it's easy to go right to metrics and comparatives, but then there's also that like, I don't know what it is, but I'm a monster on the trails because I just love the diversity of terrain and I get lulled to sleep on the roads, for example. So I think the next thing you look at then is like, where do I feel like it accesses my gir? Where do I find my gir the most often? For me, it is absolutely, it's not the track. I found that out. It's the roads and it's clicking stuff off on concrete. That's when I'm like, I know I'm in control here and I can do what I want and I can sink my teeth in. I have my best sessions on the road. No doubt, no questions asked. I know this. That gets the most out of my fitness on concrete, not in a circle. What about you? This is very interesting because I am, of all the metrics I have, I would say track middle distance is probably my best. I ran a two minute 800 relatively recently. As an old man. As an old man. It's not world class, but in terms of anything else I can run, which means with like a couple of weeks of training, I can probably break two in an 800, which at 37 would be a respectable time. And it wouldn't, none of the other times I could put up would be, or the mile. So track would be my thing where I would be the sharpest end of the spear, as you would say, in terms of performance. But in terms of duration, track and road, I will get somewhere between like 20 and 50% less work done. So if I was to run 400s until I drop on 60 seconds recovery, I will get like probably 20% more distance if I were to do it on a trail than if I did it on the track or the road. If I did a long run. But, okay, well, no, sorry. I don't mean to interrupt. Continue. That's all right. If I did an aerobic threshold long run, you're not allowed to exceed 158 heart rate, just run that steady until your legs are toast. I would make it probably like 30 or 40% longer on a trail. Continue. I'm hearing some noises. I can't tell where it's coming from. It might be me. Hold on. Let me check for one second. I'm going to mute. Okay, mute. Was it gone? Yeah, I didn't hear anything through my headphones. Okay, one. Or not. I think Bracken's going to lay down the law with the household. He's got himself on mute. He has left the room. I think he's going to go lay the people's that has happened to me in a long time. And it has to do with garbage. All right, and then don't lose your train of thought because I think you were talking when we... Sorry, I know where I was at. I went out to my chest freezer yesterday, last week in my garage, and it died on me without me knowing it. I usually go out every two, three weeks, grab like a load of venison, bring it into the inside house freezer, use it for weeks until it runs out, go back out, you get it? I lost like 150 pounds of venison. Like what I worked so hard for in the fall, done. Rotten, gone. My whole freezer went, I didn't know it. That's like how I live. None, gone. Isn't that a travesty? How mad were you? Well, I was just like, I don't feel like crying very often, but I like opened it and realized what had happened and I wasn't even mad. I was just like sad. You were devastated? Yeah, you don't kill an animal without using it. First of all, that is a big no-no. That like kills me to know that that's happening. And then too, we eat it three times a week. Whole freezer is gone. Anyways, you just reminded me of that and I don't want my problem solved. I just want you to hear me. We can move on. That's a big deal in my household. Well, that's like at least 500 pounds of meat. It wasn't that much, but it was like probably 150, maybe a little more. Yeah. Oh, sorry, dollars. Dollars of meat. Oh gosh, more than that. Yeah. Oh yeah. I lost $1,000 at least of meat. I said pounds. I've been overseas, Kirk. That's what it is. Okay, anyways, thank you for listening. Continue. Okay, so was it a fuse? Because we tripped your fuse a few times when we were over there. No, because I have two freezers plugged into the same outlet. One is still perfectly fine. So I still have half of my cash, actually a little less than in the full freezer. That one just, it's not working. Just died. Don't know what happened. That's a travesty. I'm sorry. Thank you. Thank you. Anyways, continue with your thought process. Okay, so part of it might be that I have 60% of the cushioning in my knees missing due to surgery. And part of it might be that hard ground just has always treated me rougher than it has my peer group. But getting onto a trail extends by like 20 to 50%, depending on what I'm doing, the duration of what I can keep. Okay. So if I were to run a 20-mile long run on the road, it would probably beat me up the same amount that like a 26 or 28-mile run would on the trail. 10 by 400 hard on the track would beat me up like 12 or 14 by 400 on the trail. So even though I don't think I have great trail speed, I am way more resilient to terrain than I am hard, monotonous running. So now that comes into a balance. Does that help me in a trail 5K or a 10K? No. In fact, I generally am not very good at trail 10Ks. But ultra, that suddenly matters. I also think like other than structural fatigue, physical fatigue, there's like emotional fatigue too. Like just your ability to sink into it. Like I actually thought where you were going with that was like I could do, let's say I had to keep 70 seconds per 400. That was, I had to, as soon as I slower than that, I'm done. I might get 12 to 16 reps out of myself on the track, but I found the roads, I might go for double that because I don't even know why or vice versa. I thought you were getting at that, but you're talking more purely structurally. Just like I break down. Yep. Yeah. Which might be everybody. You know, everybody's going to break down on harder terrain, but there's like a certain stride and then a certain body weight and structure where it's like compounded interest, right? 130 pounds versus 180 pounds. Somebody who slaps the ground with their feet versus somebody who seems to annoyingly prance. I hate those people, right? So there's factors, right? Yeah. So anyway, breaking down that thing right there, which is now I know if I want to run short and fast and race to the best of my ability, I probably need to be on hard surfaces because of our years of college running, we're pretty darn efficient at that kind of thing and it comes back quickly. But if I want to do something long and be competitive, it better be broken terrain because I just get an added duration added to my endurance by being off road that is not engine. It's just purely my damage meter doesn't climb as fast. Yeah. Okay. So then you gave people more to think about. Just literally surface, I think. What if it's not clear to people? What if they're still like, I don't know, I suck at everything. I feel like there's like this. No, I don't really even mean that tongue in cheek because you know there's a subsector of the athletes you work with who may say that. Yeah. And the people listening are like, I don't excel at anything. How did we get to this place right here with all this race experience? By eating a lot of humble pie. By racing. By racing. If you don't know, just go date around a little bit. Go do the race your friend's doing. Go do the race where you know the race director or the company who's sponsoring it or the one that's convenient and close to your house. Go do it. And then you know. This is, if you are to the point where you have an A race, you have a purpose. You've raced enough, you know. If you don't know yet and you're still just like, I don't even know what I should, just go try it all. What if the heart wants what the hearteth wanteth and it's not in your known wheelhouse? Well, I think a part of that is we can talk about as well because my heart just wants ultras. It does, doesn't it? Darn it, I just am not like a hyper endurance athlete. I'm not. But my heart wants it. As soon as we travel someplace, I suddenly start looking for a big long route to do. Why are ultras so romantic? I don't know and I wish it weren't. What is with that? And you take the, maybe it's just the people who are on their phones the most. I have no idea. But we do an episode on ultras or we talk about ultras and we get messages or, and if we talk about short stuff or the track in particular, we get way less messages. And when people are asking their Q&A questions or just want to chime in, hey, I'd love this episode idea, ultras, ultras, ultras, ultras. I don't know if this is like a wave or it's just those who speak up, but it just seems like that has garnished more attention than I thought it would have. Yeah. And you could read into a whole lot of things about society and why ultras are important to us right now. But at the end of the day, ultras take you to places you've never gone, physically and emotionally, experientially, viscerally. You just, you're not the same after. And you can't say that. How many miles or 1500 did you run in college? Like 30, 20? Dozens. How many of them changed you as a person? One. Yeah. Yeah. Yeah, I was gonna say two or three. I think one, to be honest, one. Yeah. Maybe two, yeah. How many ultras have you run that didn't change you as a person? That's a good point. So there's just something about them, even if you're not good at them. I think it's designed for people that aren't good at them. I think it's designed for people who have never finished first or on a podium or in the top 10. I think it's designed for people to find out who they are in a way that doesn't require success, meaning winning or being on the top 10 list. Because it doesn't matter. At some point, the task of it becomes difficult enough that on the sliding scale of how well you finish, you are very accomplished after that line is crossed, no matter if you're first or gasp last. So maybe there's something to that. I guess that wasn't, I don't know, that was a by the way to your ultra fantasies, but I've just noticed it lately. It's been more and more rising to the surface over the five years of this podcast. Yeah, and the concept of DFL is a thing in track and cross country, which is dead effing last. People talk about it. Oh, look who was DFL this week, or I was finally DFL. I figured out what it's like. You don't hear that in ultras. It was the last finisher. That's the phrase. Because you beat everyone who quit. Correct. You didn't take last place. You were the last finisher. And that is almost all you need to know about ultras to understand why they're unique. And so you're exactly right about what you're saying. But even ultras, even if that's the thing you're not good at, every single one of us in an ultra, specifically 50 miles and longer, will get to a place where you're just at a low point. You're done. You don't want to be out there anymore. Something on your body is really struggling and you're lacking any reason why. And at that point, you better be doing the type of thing I don't want to be on a lake path. I don't want to be on crushed gravel. If it's the middle of the night, I don't want to see city lights. I want to be somewhere very, very remote. And so for people that are the opposite, if terrain is terrible for you, if vert or descending is terrible for you, there are events like the Desert Solstice. There are places where you could run around a track for 24 hours. There are places where you can run, I think we just had the 100-mile championships down in, was it Arizona? Yeah, yeah, I think so. And the entire 10K loop had like 40 feet of gain or something like that. And most of it's on pavement. If that's your love language and the thing you're best at, you can find that there and you'll still crumble, but at least you have your stride supported. So I think that that's important for people to not get too caught up in, well, am I taking the weak way out? No, it's going to be bad either way. It's going to be awesome either way. But when it gets bad, you should have the thing supported that you're good at. Otherwise, your skills have just vacated you and you're left to die. That's dramatic. Yeah. Yeah. But that's the difference maybe between DNFing and not. And if you're on a course where you're going to DNF, but your goal is to find out about yourself, can you push through? If it's to the point where your legs are so beat up from running on pavement that you can't be tough anymore, or you're on some nice soft trails that allow you to get even deeper into the pain cave, being on a course that suits your skill set actually allows you to hurt more. You want to look at it that way. Yeah, I agree with that. Just like the vultures circling sort of feeling. Remember when Yul Fivefinger, what ski hill was that? That is at Alpine Valley. At Alpine Valley. I trained with Bracken there once. This is back in like 2017, I think. Yeah, something like that. And we went there to do a training run. It was a small group of us. But something about that hill, it had like dozens of vultures circling the summit. And it was sort of like metaphorical in the way like as we were suffering towards the back end of that workout, and they just circled just waiting for you to be like, I'm done. It's not worth it. Come take it. There's a lot of vultures in Wisconsin. Yeah, it was like a really, it was almost odd. Like they've seen somebody die on that hill before and they are waiting for the next. Did you ever get that sense when you were there? Not there, but on the lakeshore path in Lake Geneva that I time trial on, and that's 22 miles, and I always die there. There's this one patch on the far end of the lake where there are like two or three dead trees, and the vultures hang out there. And it's just surreal to be running on a beautiful day or a bad day or whatever, and you're in the middle of a long, hard time trial, and then there's just a remote dead tree with 20 vultures on it just staring at you as you run past. Why do they always choose the dead tree? In The Lion King, they chose the dead trees as well, the vultures. So then the other bit would be the where do I feel the most alive? Where do I find my grr? Where do I reach a place I didn't know I had sort of thing, right? Whether it's in a sprint finish to outlean somebody that you don't even know, and it really doesn't matter. It's like a big road race, and it's for 111th place versus 112th, or if it's a final climb in a short, punchy 10K trail race. I don't know. I think those moments, the moments, how do I describe it? The moments where you felt like an animal. You were just proud of the effort you were putting out. You know those moments, not the out-of-body experience like where you're working hard, but it's effortless because that's hard to do while you're climbing in the mountains. I think that's a tough one. But like where you're pushing and it doesn't seem to be chinking your armor, I guess would be the – is that a good way to put it? It's not tearing holes in my clothes, right? It's just like I'm doing this and I feel like I'm in control and I'm working hard. I think about those moments with myself. Where have those moments been and what was I doing, whether it's a training run or it is a race? And for me, I've never had that moment on climbs longer than like 300 feet of gain maybe. Eventually, I'm maybe just maintaining status quo, but I wouldn't say I have that. I'm more like, okay, just hang here, hang here, hang here versus like attack and be awesome. And then it would be on any rolling terrain where I can get like a nice open descent and then roll into the next and I can start to just get a – it's like almost a dance, right? I press on, I press off, but the whole time I'm moving fast and feeling invigorated or it's the roads where I'm choosing a pace and my body does what it's told. It would be those two circumstances, but put me on a 1,500-foot climb, I'm working. I could maybe feel good about my effort, but I'm not feeling like I own the world ever doing something like that. So for me, those would be my things. What would be your things? I think varied terrain, technical terrain, sloppy terrain, but things that change up the game. I kind of look at it, Cardin's changed my metaphors a lot with or how I think about how the body works. But the more I think about skill sets and the more I'm around Cardin, the more I think that really having a good skill set is having more gear options. And when we used to race uphill, again, all those people I talked about, there were people uphill that could just do different pacing as they wanted to up a hill. Yes. Like Robert Killian could. Cody Mote could. Ryan Woods could. Those people could just decide to change gears going uphill without like an apparent drawback. Whereas I felt like I had second gear. Yeah, and I didn't have fourth gear. Like if I change gears, I'm up to fifth. If I accelerate at all, I'm at red line. Where those guys could play with it the way that we could in a track race. We can change tenths of seconds per 200 and get a lot out of it or save a lot of energy because of that. They can do that on their type of terrain. And we see Johnny Luna Lima could do that downhill. He talked about how he could set a heart rate goal and run it downhill no matter the terrain. I don't have that option. My option was flow or bomb. That's it. Or fall apart and chop my feet and break all the way down. Those were my three descending options. He could flow it. He could steady it. He could tempo it. He could red line it or he could bomb it. He could do anything he wanted. He had more gears than we had. Whereas we just ran out of gearing options. We go up anymore, we're done. If we go down anymore, it's too slow. We're not properly geared for this. And that's how I think about skill sets now. Where can you modulate your energy and effort the best without having big gaps in your pacing? And I think that's on technical and broken stride and sloppy for me or short, fast track or road races. You're very good at making things digestible. I think the listeners know that already. But it hit home just now when you were saying about I can go from second to fifth, but I don't have third and fourth. For me, it's like if I go 0.1 miles per hour faster up this climb, 0.1, just one little click on the treadmill if it were a treadmill, I suddenly went from in control to I have 30 seconds left. From just the smallest dial turn, the gears, you're right, are missing. That's something I feel when I'm climbing versus let's say flat if it's like, hey, you got to go three seconds per mile faster. I can turn that dial by choice and still have plenty of time to figure out the next move without red flashing lights going off. So that's a very good analogy for me. That's exactly how I feel. Maybe everybody feels that way. I don't know. I think there's very few who maybe don't. But the best people probably feel that. The best people, yeah. But then that question comes back to what do I get better at? Like for myself, for example, I've done my share of incline treadmill work. I've burned through three incline treadmills in my life. I've put my hours in on that. I haven't gained another gear. I've just gotten a little bit better at the gears I have. Whereas if I do flat work, I can gain another gear. What about just a personal curiosity for you? I guess we'll bring body weight into the equation. Sorry, but when you were in Colorado, you were what, almost 20 pounds lighter? I was like 168, 169 racing there, yeah. Okay, and you're 185 now? 80? Well, after this last 24 hours, I'm probably 150. Okay, but I came back from Sweden at 179. Okay, so 10 pounds, which is a ton, by the way. It doesn't sound like a lot, folks. You're wrong when it comes to going uphill. 10 pounds might as well be 20 on flat terrain, correct name in Wisconsin. Granite Peak? Granite Peak, thank you. It has two names, and as a result, I can never think of either one. Granite Peak or Rib Mountain. Rib Mountain, yes. And at one point, it was snowed over and icy in spots, and we were running it. But then at one point, I asked if we could go over off the ski hill into the woods on the side and scramble climb. And do you remember what happened? The trails on the backside? No, just on the side of the ski hill. Oh, yeah, yeah, yeah, yeah. I do remember that. That was fun, by the way. There was big boulders, and it was off trail. There was runoff water a little bit. And what did you ask during our second rep? Do you remember? Oh, God, I don't know. Probably about how hard you were planning to work or something. Oh, you said, can we get back on the ski hill? I can't. I feel like I can't even get my effort up here. I'm sure I would have said that, yeah. And it was just really interesting on that day. I thought, here I am really enjoying this, and you are too, and I'm getting a workout out of it, and I feel like I have options on this terrain. And you're like, I can't peg my heart rate the way I want to here. I need to get back onto the ski hill. You're making me have to be a little bee here. No, it's a skill set thing. No, I remember that. I remember that terrain being very cool, though, off the trail. Very cool. But if I look back to races, the only race I ever climbed with Ryan Woods or Cody Mote was the first big climb in Palmerton, the year they took us through the woods and scramble climbed to the top. It was the only time I ever got to the top of the first climb in an OCR race with the first group. And that's steep stuff there. And it was the only climb ever where you could use your hands if you wanted to. There was not accident. And then we never used that again, and I never arrived with the first group again. And so it's the inverse of Luna Lima's descending. The only gear options I have uphill are when it's really technical. Okay, interesting. And so if I'm building my ultra, it's very technical scramble climbing or broken climbing, traverse climbing, and then semi-technical to technical descending with spurts of flat running, whereas yours might be steep, maybe not scramble, maybe scramble climbing, and then a long, gradual descents. Yeah, I agree with that. Both of which exist in the racing world if you want to find it. So think back, folks at home, to when you were in your flow state out there, not even comparing yourself to others. This is the thing here. It's not comparing. I don't care if you were DFL or first. I'm taking this. How do I compare to others? I'm taking that out of the equation here, what I'm trying to do, and I'm trying to say, when were you out there just flowing? Realize I'm working hard, and I'm in control, and I'm sinking my teeth into the effort. What kind of terrain? What was the race? Was it a race environment with hundreds of people around you and the energy of a Chicago marathon does it for you? Is that something? That's a thing, right? I have people all around me. There is something I can access that I will never find in even training. Pick those races. Heaven forbid you pick the Green Bay Marathon and you basically run a solo time trial with the closest people a quarter mile ahead of you and behind you. That may not be your race. Or the distractions of others. You like to get in your zone, put on your Kid Rock on your headphones and go and shut out everybody else, and that works for you. I think for me it's finding those, yeah, those I feel like a badass moment and I'm doing well. So I think that's an important thing. And not only that, but not only will you perform well, but you'll most likely enjoy what you're doing, like you said, a little bit more as well. So I think... Oh, gosh. Did Kid Rock... Yep. Okay. So I grew up two and a half, three miles from, at the time it would have been County Stadium, then it was Miller Park, and now it's American Family Field, but where the Milwaukee Brewers play. And the Green Bay Packers. Way back in the day, yes. There you go. And I went, when I was in middle school, I was playing on this AAU baseball team, and we got entry for a few people in the league into one of the Brewers Fantasy Camps. They do it for adults, but they also do it for kids. And so you go down there, and they have Brewers coaches running a baseball camp. And I met this, one of the kids I got paired up with in the first drill was just like the coolest kid. He had the Charlotte Hornets starter jacket. He had a gold chain on. He had the haircut I wanted. He just like was the coolest kid I knew at that camp. And we were partners for the whole thing, and we were talking, getting to know each other, and I said, what's your favorite song? He said, Bow with the Bow by Kid Rock, and I just said, yeah, me too. It wasn't, but I was like, he's the coolest kid I've ever met, and I think we're going to be best friends. We never talked again after that camp. Did you seek him out to be your partner too? You're like, this is a guy. No, we got paired up luckily. For me at least. I don't know. How old were you guys? Probably 12. Bow with the Bow being his favorite song at 12. It totally makes sense. That probably means nothing, but there's a chance he's in prison. I don't know. I should follow up with this. It's Milwaukee. It's flipping a coin here anyway. That's true. I don't think there were any swear words in that song, so maybe he's ahead of many, many other artists. I prefer profanity in some of my music. It hits me just right. Anyways. All right, so we find your... We have Pandora on all our TVs at home, and that's how the kids play music throughout the day. And we always have the explicit filter turned on. Of course. But whenever it's time for me to go run, I do find myself turning the filter off so I can get the full impact of the song. It's important to feel all the vibes, Brack. And I am very... If I'm in an argument with you, there will not be one swear word said by me. It will be articulate, and it will be concise, and it will not lose its value because I need to use the F word. But if I'm enthusiastic or excited or explaining just out of pure joy, I'm going to swear. But you can't use it in an argument. That's a project for you. Yes, you cannot use profanity in an argument because it devalues most of what you're saying. I firmly believe that. But music and joy, swear away, folks. Okay. Anyways. All right, let's move to the next point of this conversation. What's the next part? Well, so I think then that asked the question that you asked at the beginning, like, how do you train for it? If it's in your wheelhouse, if it's not in your wheelhouse, how do we go about training towards it? And I think my biggest takeaway, maybe my biggest takeaway from the last... Let's see, when did I first coach? 2008? Do some math for me, Kirk. Who were you coaching in 2008? 2007, West All Central High School. Driving back from Whitewater. God, we were in ships in the night. I coached Hale in 2007. We missed by a year. I think we really did miss by a year. I was assisting coaching. Oh, I was track, so maybe... Okay, anyways, never mind. Driving back from Whitewater in my mom's VW Beetle. Oh, chick magnet. Good thing you already had a chick. Well, that year I did. That's right, dude. That was the first year of us. Anyway, so 2008, whatever we got, 17 years of coaching. Let's call it that. My biggest takeaway in 17 years of coaching, and I don't know how accurate this is in terms of my single biggest, but I don't think it could be outside the top three, is that if you do anything long enough and consistently enough, you're going to get really good. You will improve. It doesn't matter if it's A-tier, B-tier, C-tier training. If you just do it consistently and long enough, you're going to improve. And following up to that, the second is that engine is engine. If you're working your engine, you're getting better. And so with all that being said, I believe that there are multiple ways to build your fitness and that we oftentimes when we think we need to work our weaknesses, we do it by the style of our weakness rather than using our strengths to work on our weaknesses, if that makes sense. And so my quick example of that is my weakness is uphill running. I tend to do grindy work uphill because my other weakness is grinding as a runner, just holding a steady state for a long time. But if I really wanted to improve my weakness in the most manageable way and the most sustainable way, I would do it in interval form because I like intervals and I'm good at intervals. And because of college track, I've wired my brain to accept interval work. So even though it may not be the best 10 or 12 weeks mentally. Whereas these thousand foot finishers, by week three I'm like, this is becoming a real chore for me to get through. Okay, that makes sense. And so I believe that with terrain as well. I believe that with duration. If long runs are tough for you, then it's long workouts. If concrete is tough for you, then you take your very best workout you've ever had and you do it on concrete rather than just kind of slaving away at the thing you don't like in the fashion you don't like. And I think far more often than we think, we pair those two together when we try to work on a weakness. Yeah, but how often is the, you know, you rub your dog's nose in the poop on the carpet and eventually you get, like you rub your nose in it, you get through and you avoid the backlash, which would be suffering immensely uphill. So is there a rub your nose in it? Like, is that a good approach? Meaning, I actually hear more on the opposite end, like I don't feel fast. Like, God, I see 400s or 800s or even miles and I'm like, oh God, I hate this because people feel slow more often than people. People as you age especially, and that seems to be the demographic that hires us, like you don't have a lot of 18 year olds hiring us, but you sure have a lot of 38 year old pluses, right? They have disposable income, they're seasoned in their life, all that aside, seems like I would say more often than not people are like feeling slow. I can go forever, that's fine. But the fast... I think it's the same rule. You do. If you hate speed, do it at the place that's most enjoyable for you. Well, I should go to the track by nature for speed. People pair 400s with the track. Yeah, I'm just like myself. I don't necessarily enjoy climbing a ton. I enjoy the wind through my hair and feeling the breeze that I've created by propulsing myself through space on flat ground. That is invigorating. Tears in my eyes from the air hitting them on a descent on a crisp morning, right? You know what I'm talking about. Love it. Sitting in my own pool of sweat with my quads and glutes burning, literally steaming up the windows in my gym room with my Nordic track and having to convince myself to take every step towards the end of those workouts. Don't really enjoy that. However, before Tahoe in 2019, I'm still comparing myself to the best, but I'm probably on the lower end of the climbing spectrum compared to the best of the sport we pursued for a long time. But you know what I did is I went all in for pretty much the whole summer, but that last 10 weeks, there wasn't a Tuesday quality session outside. I was either on the ski hill or I was on my Nordic track at 30% and I just worked it and worked it and worked it. And then every weekend I was out on real trails and I was bombing descents and getting durable. And I was as slow as I've ever been on a metric standpoint. If I had to race a 5K there, it would have been average, but it would have been 30 plus seconds slower than I was running a year prior because I just didn't, I wasn't working anything like that. Point being, is that actually worked for me? It worked. It actually worked. I actually was proud of what I did out there at Tahoe and I was proud of how I climbed and I was proud of, and I felt the most in control I've ever done doing it, but I hated it. I really did. I'm disciplined enough to do it, but it wasn't super satisfying and I never even saw it pay off until it did. So how much of an argument is there for that? Meaning suck it up. Well, that's the difference right there. You said discipline. Suck it up and go to the track or go to the flat roads and let's work on this. I don't care if you can run for five hours. It doesn't matter to me if you can do it slow. That's not what racing is. So what do you say to that? I'd say that you're disciplined enough to do it. And I think, well, most people are. No, I don't believe that. I believe that most people will fade out. Most people will find a way not to. If it's 4.30 in the morning, the difference between getting up and getting it done is looking forward to the workout and not. For a lot of people, that's the difference. And that's the difference between you and me right now. For the longest time, there was no option for me. In the moment I stopped trying to pursue running as my profession, I realized I'm not disciplined with my own goals. I don't care enough to put it over anything else. And so I now need to fabricate workouts that are fun for me. You don't need to do that. You've never lost that. And so for you, for the people like you, yeah, do the thing that is best practice and that also calluses you mentally. But for the people who are going to stop doing it by week three anyway, well, you might as well do the thing that gets you through week nine because nine weeks of something is better than three weeks of the best thing. And so that's my entire point with this is if you struggle with getting it done, do it in the way that supports you the best. If you won't go to the track and run 400s, run them on your trail and lose 10% of the effectiveness and get 90% of the effectiveness by doing it every single day. You're making a lot of sense here, Bracken. Kirk, for you, you don't need that. And you'll be better than the people around you and you're seeing that. You and your peer group now, you are staying there longer than anyone else. And part of the reason is because you're disciplined. I think the misconception though, I don't want to create this misconception about like now, like everything, you have to feel like a monster when you're doing everything and it has to be enjoyable while you're doing everything and you have to feel successful while you're doing everything because you can put yourself on a technical steep trail going up or down, which you say you excel at, and you can have a bad day or life stuff or low energy or you had a stomach bug and you feel empty when you're out there running, all of those things. It's more like you can't have the expectation that, oh, every time I'm on the trails, I nail it or every time I hit the track, I nail it. It's like when I've had those days and those days are fleeting no matter who you are and what terrain you're on and the circumstances, but I bet you all can think back. I can think back probably if you made me to a dozen to two dozen runs over the last three decades that like two and a half decades that like changed me. Like it was like I remember that day 15 years ago when I went for a run or a race and this happened and that's how I felt. I bet you have a handful of those. I'm thinking of those days because there's a lot of the average to below average days even in your strength type workouts. So like you don't know at this point being is it's not like yeah, every time I go to the track, I feel like a monster. That's not what I'm outlining. No, no, I get it. And in fact, noted. Yeah, it is. And when you say that, one of those days that I think back to had a climb finisher as one of the days. It was one of the days where I just knew like I've arrived. I am so fit because I looked forward to that climb finisher and I sent it and I crushed it and life was terribly great. So it's that would have been out in Colorado. You refer back to that the most of any time in your career as to highlights of fitness. That's the only time I was all in even counting college collegially. I was never all in. I was all in in season to an extent. Yeah, but it wasn't until we moved out there that I thought let's just really find out how good I can get. And that was a day there. I ran something like four by mile at 355 on I mean at 455 on grass and then went over to the incline and went like 2330 up the incline. Oh, really? Yeah. I don't think people can appreciate what you did that day. That's a big day. No, it was like it was like a full two two and a half minute rest between the miles. So and then probably 25 minutes to get to the incline and get started. But that was I mean, you can see why I got to the top of that incline. I'm like, I'm fit. I'm ready. And that was prior to that season of racing out there that went well, but that was the fittest I've been in my if I just could point to one day in my life where I was fit, that was the day. But that finished with a 23 minute hard climb on top of four by mile. Everything was so low. It was just a good day. It stands out in my life and it was the type of workout that I can't bring myself to do now. Climb finisher. And so until you get back to whatever place that is that allows you to be in that, then maybe I have to fabricate it with interval finishers or buy-ins. I don't know exactly what it is, but people I think I hear the track thing a lot. I just hate the track. It's like, well, then don't do it on the track. No, I think it's worth hopping the fence, breaking the law, sneaking in and getting it And I was out there doing a workout that included bleacher running. And at the end of it, some of the kids from the track team joined me for the final few circuits of the bleachers. And he was mowing the lawn and he came over and just started yelling at us to get off the bleachers because it was going to loosen the bolts. Can't be loosening those bolts, Bracken. That's a selfish endeavor. I was like, we have like 10 minutes left. We'll be done soon. You're second. You need to get down there right now. And I have kids in front of me, so I have to like go down there and be polite. No, you show them who their fearless leader is. Like Adler, we're in Wisconsin. These are football bleachers. The average person walking up and down this is 280. You think a bunch of 100 pound freshmen in high school jogging up and down the bleachers are putting more strain on your nuts and bolts on this thing than a bunch of quarter ton humans? Come on now. He's like, I have to go through here every spring and tighten these things down. Like, yeah, and we haven't been on here ever before. This is my first year here. So clearly it's the herd of football audience watching this, not us. I bet you said none of that to him. No, no, this was the conversation. Okay, you got to be a fearless leader. You got to earn the respect of your disciples, Bracken. But then I said, okay, we'll leave for now, but let's have a talk about this afterwards. Let's take a look at some of the specs on these things. We had to have a talk with the administration to allow us to run bleachers at our football stadium. A little bit of red tape there. People are going to be grumpy sometimes. It's just the grumpy nature. People unhappy. You got to find something to put your energy into. That guy. And he lived in the same neighborhood as me. We bought in a neighborhood that butted right up to the school. And I have never seen a single blade of grass out of place in his. He ran his life with an insane efficiency. Well, anytime I've been approached, I'm very pleasant, of course, but also firm. I'm not doing anything wrong. I'll get out of here shortly. I get it, but come on. I thought we were going to get booted on our workcation we had together when we ran on the track. Yeah, I thought so. It was a very nice facility. Yeah, it was, wasn't it? For being podunk Wisconsin, it was a great facility. Yeah, we had tornado sirens going off. Aren't you upstairs? Like the top floor? Second to top. How many stories is your house? Three. Oh, okay. Well, do you need to check on anything? No, we watched Twisters the other day. I'm going to be fine. That's a good point. Yeah, definitely going to help you out. I want to pose a question to you. Wow, I can actually hear that and our mics are pretty good. They normally block out that sound. I think they just went off, but if they turn back on, I'm going to mute for a little bit. It's not terribly loud. It sounds like it's way in the background. Anyways, this will be the last you guys are hearing of Bracken. Anything you want to say to the people? I'm going to see what the eye of a tornado looks like today. All right. Sacrifice the body for the recording. What is your opinion on the most difficult type of race to nail? Are some people longing to be an ultra runner, but it's really an impossible task to ever feel like you went out and you did it great? Or longing to be a 5K athlete, but always left feeling like something has been left on the table? I'm starting to form an opinion on this myself. Is that your place again? Wow, mute. You tell me. There are noises coming from both of our ends. I'm sorry, folks. Yeah, there's like a howling outside of my... You got the tornado. We got the siren. Okay. This is a very disrupted... Sorry, guys. I think there's something going on on my street or something with vehicles behind. I just can't see them out my window. What are your thoughts on the most difficult type of race to feel like it's your thing? Yeah, I mean, the race that you don't have any fitness for is the obvious choice. Running a marathon when you have half marathon fitness, because you can never just get near what nailing it would be. But at least in races that you don't have enough fitness for, you can just go slower and be comfortable the whole time. The very hardest race to ever nail is one that requires intensity, one that requires riding the absolute finest of lines the whole time, because it takes multiple attempts, and those are really draining attempts. And generally, the faster and sharper the race style is, the less frequent they are to find. You can find a road 5K or trail race or half marathon any weekend of the year if you want, but how often can you find, like for you, a 5K that's going to try to run sub 15? It's just they're frequent, and the timing of nailing it is very difficult to do. I've got an athlete racing the Red Bull 400 in May. Adam Buck, who's been on our podcast. In Michigan or where? I don't even know if I have the location written on his. I know they have one in Michigan, like Marquette, Michigan or something, I think, right? Or not Marquette. Yeah, Marquette, right? Yes, it's up there. Yeah. Anyways, I'm thinking, like, how would you nail it? So the Red Bull 400, very interesting event, which is actually one of probably the more painful experiences, is it's on one of like there's a host of these facilities around the country where let's call it a professional ski jump facility at like a local ski hill, and it's a quarter mile from bottom to top. And if you can imagine, like watching the Olympics and where these skiers and these ski jumpers take off from, it's almost directly downhill on the top, like almost like straight down at the slightest of angles. And you have to go the opposite and run from the bottom, and it gets steeper, steeper, steeper as you hit the top. And it's 400 meters is what they measure it out. And these 400 meter races take like five plus minutes for the winner. Think about how steep that is, right? I'm thinking that might be the hardest race to nail, by the way. That just crossed my mind. It might be. That sounds terrible. But anyways, I got an athlete, Adam, working on that right now, which has been fun, actually. People are in puddles at the top of that race. Oh, you have people on their hands, like literally being like, I can't, I'm done. I miscalculated. It's 100 yards away. I can't. You have to run it like a mile. You cannot run it like a 400. You literally watch the start line of this, and people are like, the first 100 meters is the only flat part. I'm using it. No. That's a good one to watch. If you look up Red Bull 400s on YouTube, that's good watching. Kind of distracted myself there. I think it's the opposite ends of the spectrum, the short, short races. I'm going 5K and under, and then the long, long races. When I say long, I mean like 50K at minimum and further. I think if you're prepared for all of them. Middle distance and ultras. I'm saying you're showing up prepared, and they're still the hardest to nail because 5K, in those middle distances, let's call it 10K for sure, half marathon to marathon, whether you miscalculate a little on the fast side or the slow side early, your fitness has time to show through no matter what, barring a major, major misfire on an effort level, which can happen, but you're going to find out what you're capable of by that finish line, whether you do it one way, the other way, or another way. You'll kind of end up in the same place, right? Whereas like those super long races or the 5K and under where it's, you said, riding the line and threading the needle, those are the hardest ones to finish and be like, nailed it. I can't do any better than that. Like I don't think I finished anything 5K and under and felt that way ever. Well, yeah, just that one, right? You get one in each distance. Sure, you get one, but it's just so much more rare. So I tend to look at it as outliers for athletes. Like, of course, you didn't nail your 100 miler. Like who does? You couldn't help the diarrhea three times. Like that's going to slow you down. Yeah, and that's the thing. Once you get to 50K, I mean, it probably starts at the marathon, but for sure 50K, fueling becomes a very important piece. For sure it starts at the marathon. But as soon as you are requiring fueling to be part of nailing it, now you've just doubled the complexity of your race, maybe tripled it. Because now your intensity levels have to also be, have to accommodate for ingesting calories. Hydration, temperature management. Yeah. It's chafing, shoe choice. It all gets exponentially more finite. Simply being fit and going out at the right pace is not enough. And that's, I think, the draw to those things is that the more that gets brought into it, the 100 feet of vert the last four years, four years. And my fastest time has been an hour 41 and my slowest time has been an hour 42.07. I think I have a 30 second finishing window in four races. Okay. Year one, I was almost four minutes slower, three and a half at roughly just past the halfway point, finished in this. The next year, Tyler Germain raced and I was a full four minutes faster than my previous year at the halfway chasing him around, died a slow death. Guess what? Right in the same 30 second window. And then the last two years I ran my own race within myself somewhere a balance between guess where I ended up Bracken. I literally have like a 37 or 30, 40 memo second discrepancy in an hour and 40 race four years running. And there I've run it three different ways. And so I have a very strong bias there, but I really think there's some truth to it in those 30 to two hour, 30 minutes to two hour races. It's like, you're going to find out who you are when you cross that finish line, as long as you don't misfire drastically. That's my one example. Yeah. As long as you're not stupid or weak, you're going to get about what you have. You want to know the other interesting thing? And this I couldn't have done if I tried and I've said this to you on the podcast maybe once before, but the state cross country meet in high school, my sophomore year I was healthy. And then my junior and senior years I was not. I ran 16.48 as a sophomore. This is the exact same course. You know this, Ridge's golf course. I ran 16.48 as a junior and I ran 16.48 as a senior to the second three years in a row on the same course at the state championship meet. You couldn't do that if you tried, could you? No. And those were all run different ways. That's mind blowing. To the second. Well, it made me feel like a real dunce by the time I got to my senior year. Yeah, as a sophomore you think I'm only going to get better from here. Nope. Stress fractures and galore. All right, so where do we want to take this thing? What else do we want to dissect with this topic? Well, I don't think we need to dissect further. I think people know what they need to know at this point, which is re-evaluate how you're choosing your races and your workouts if that's what you want out of them. If what you want out of them is what you want out of them, then you have to approach it that way. If you want to PR a 5K, don't choose a hilly course. If you want to have your best experience in an ultra, don't choose one that doesn't play to your strengths. But I think what this all started from is me watching NCAA Nationals and the Grand Slam track race, and we haven't touched upon that at all, but what was the highlight for me was the fact that you get all of these monsters into one race, and unless you have a unique individual, no one wants to lead. And as soon as someone doesn't lead, if the next person up doesn't immediately take over, it's already almost too late. If they even go two or three laps of whatever race they're running, indoor or outdoor, and the pace hasn't been taken up, now everyone's race is out the window, and now it just comes down to who has a big finish in their legs. And you see so many people that had the fastest time in the nation coming into championships that lost that distance, and then sometimes turned around and won a different distance. But the world, just like we talked about in the last episode, the world leaders, the national leaders, did not win. I think there's two-thirds of our listeners scratching their head not really knowing what we're talking about with Grand Slam track. I want to outline it really quickly because it's an interesting concept. A good bit of negative feedback online from it. I think from people who don't understand the sport as well as some others. That's what I think. I think most of those comments were coming from novice consumers. I'm going to say that. But there was a lot of them. But nonetheless... I had negative feedback. I didn't give it anymore. Well, I'd be curious what your negative feedback was. There was a very specific negative feedback that was the common theme throughout. Okay. Nobody liked watching people run that slow. It was just like across the board. And that's not mine. Right, because you like racing. I think a true fan would. But anyways, Grand Slam track, I guess Michael Johnson, the former world record holder and gold medalist for the United States, and he's been involved in track and field since. What was he in the late 90s? 90s, yeah. Anyways, he was just a stand-up dude. Everybody kind of liked him. Everybody did like him. He was sort of a pioneer for sprints in the U.S. Anyways, I guess he spearheaded this global track meet in which you get the best of the best committed to a race series, and they almost race themselves multiple times throughout the years at these venues. And let's say a field of eight, there may be three athletes signed on, and then the other five are randoms they interject in, give them a chance to shake it up. But the signed athletes are going to have to be committed to show. Is it three races, I think? Three meets? I don't know the details of it, actually. And here is the deal. Each athlete, and they try to pick the best they can find, whoever would sign on, races two events in back-to-back days. Basically their event and the next distance up or down from their event. They have to race two. Let's find out what these athletes are made of. So, for example, the groupings are 800 and 1,500 meters and the 3,000 and the 5,000 for the distance athletes. And you have 800-meter runners who literally have hardly run a 1,500 in their life having to now compete against the best in the world at that distance and vice versa. So it's been interesting. I see less discrepancy in the 3 and 5K group. I love the 8.15 group. That's the most fiery group to watch because there's a huge discrepancy there. The 3 and the 5 are the same energy system in my eyes, very much more similar. Anyways, that doesn't matter. But point being is you get points based on your finishing position each day in those two events. And the athletes, this is, hey, let's pay the athletes sort of circumstance. The person who has the best score, the best average finishing place after two events takes them $100,000. That's a ton of money for a lot of these athletes who are basically just getting by or making an okay living but not as much as you're making in the corporate world at home. So anyways, so this league is set up that all that matters is where you finish. Your time doesn't matter. Your place is what matters. And so what you've seen in these Grand Slam track races, in particular the 800 meters and up, not the quarter and down, is tactical, tactical, tactical races. The men's 5K was won in like 14.40. Those guys can literally run two minutes faster. They actually jogged and then kicked home. And so what you're seeing is these races that are super boring until they're not. And then they kick home. And so the criticism is I didn't come here to watch men run 14.40. There needs to be an incentive for them to hit a halfway mark or a bonus or something if they also run a certain time, which I can understand that angle. But nonetheless, that's what Grand Slam track is. And then they'll have another meet here in like a month or so and then another meet after that with the same main contenders and then new people that they get in there to shake it up. And so it's racing at its finest. It's championship racing only, not this time trial wave light racing that people like to beg on as well. So that's Grand Slam track. And NBC Sports have picked it up. So it's been airing on Peacock and it's now been streamed on their YouTube channels and you can watch it after the fact. It's high-level racing. Did I miss anything there? No, that's all very accurate. Okay, so what's your take on it? Your beef with it? I don't have a beef with the product. I have a beef with the concept. Okay. I am very over the idea of these people in their sports saying this is why the sport's dying. What we really need is blank. And they're almost always wrong because they're inside the sport. The sport's dying because the public's not interested in it. It's not because your format's not good. It's not because the events are too redundant. It's because the public's not invested in your sport. And so I don't think adding a new style of it that actually requires you to know more about track than less and putting it behind a paywall has anything to do with this. Like you shouldn't have to have Peacock to watch this if you're trying to grow the sport. If you want to grow the sport, you need to have it on free TV that people can find accidentally. So I don't believe that getting rid of the throws or the jumps is going to change the excitement to the average fan. I also don't believe that them running 1440 matters to the average fan because none of us care about any of the sports in the Olympics and we watch them. I mean, that's dramatic. We care about some of them, but we watch sports all the time that we don't care about in the Olympics because they're on and it's free weighty competition. Yeah, but throwing money at the winners has no effect whatsoever on the audience's enjoyment of the sport. It's a great take. But is that how it's been presented? Yeah, that was why they started this in the first place, is that track and field is old, it's broken, we've lost the new generation, this is how we're going to get them back. And we've heard it in different ways, shapes, and forms, and I just don't really buy that that's it. I think it's not accessible. It's not relatable. I mean, nobody watches fencing, and not to pick on fencing, but because we've never done it, we have no access to it, we have no investment in that product whatsoever. Why would we? We don't fence. There's a fencing unit in gym class, and there's not facilities. You've got to go out of your way. Do you know where you could go fencing locally? No. Me either. At least there's tracks behind every school, but it's also... I know where to go curling locally. So do I. That's a difference. Curling's all the rage, brother. There's a curling facility at the track I do my workouts at. You've got everything you need. And trails right there. One-stop shop. Okay, so your take is that this isn't helping, and I will spread the word, and I will say it, watching felt a little bit like watching track and field in the COVID days, where the stands were empty. It was interesting. The stands are full on the home stretch, but nowhere else in the stadium, because they're not filling the stadiums. I think it's a great product. I don't think it's a game-changer. They want it to be, and that's too bad, because they're throwing money at it. But anyway, point is, that combined with NCAAs is, there were so many tactical races, rather than just running fast. Everyone trying to run their fastest from the start, which is how championship racing goes. But as a result, so many people, to avoid losing, gave up their chance of winning. There are so many times where someone, if they just ran their pace from the start, would burn off half the field. And they may lose because of that. They may get outkicked at the end. But in this other style, they gave up any chance of winning by being afraid to lose. That's why I respect the heck out of Jakob Ingebrigtsen. Of course, he runs tactical races and wins, but more than anybody, he loads up the gunpowder and says, I'm going. And if I lose, and he does lose, and he could have won those races in other ways, but I admire that style of racing. But I like it all, though. That's the thing. I want to see a little mix. And I don't criticize these people. I was the same way in high school. And I sometimes would get a little flack for it, where I was going to run what it took in our small conference to win. I was going to run in first or second place or third. If it was a fast pace, I was going to run whatever it took to hang on. But if it was a slow pace, I was going to run whatever it took to get to the last lap in contact. Because that's what mattered. I was going to run fast if fast was available, and if not, I was going to run to win. So I get that. I understand. In college, I was never good enough to just front run. So all I did was hang on and try to make it a race I could hold on until the end. But there is no way you should set an NCAA record throughout the course of a season and then be afraid to lead a race at a championship. And I'm not saying everyone did that, but it's just interesting that many people did not run to their strengths at the biggest race of the year. No, it makes all that better. The DMR. DMR is so good. And the distance medley relay, it's a 400, 800, 1200, 1600, not in that order. And it is a time trial for every single person out there other than the anchor leg at times. But the tactics go out the window for the majority of that race, and that's why I love it. It is like we need to cumulatively get to the finish line fastest. And both were fire at the end. Yeah, so good. And they're still good races, and I love a tactical race. I don't need to see a world record to enjoy a race. I love tactical races, and so I enjoyed every single race out of the entire weekend. Love them. But there were some really foolish tactics used, and people just either burned their legs out by surging and slowing, surging and slowing, or gave themselves no chance at the end because if you let the race go long enough into it, it's just the person with the fastest speed at the end. So many really good runners did not race to their strengths. And all it would take is a few of them, two of them, three of them beforehand saying we're going to make sure this doesn't go out slow. But they don't do it. They'll talk about doing it, and they don't do it. And I understand at that level the stakes are so high. You don't want to be the person that the whole field uses as a rabbit and then blows around you. But there are a lot of people staring down the barrel of a long offseason with regrets because they didn't play to their strengths. And I think that when we get to races, the takeaway there is that we usually don't have the opportunity to decide whether the race goes fast or slow because we're not the fastest person in the race. That's the only person who has the opportunity to decide. But what we do have is the opportunity to decide if we pace ourselves to our strengths or not. Some people do run better when they put themselves out there and just go out hard and hang on, and other people absolutely build best in races. And we oftentimes get caught up in just going with the first back and then hanging on and slowly getting slower and slower, and then you get done and realize I didn't really find out what I needed to find out today. All I know is the last three times I've been on the track in a race, I've hung on for dear life from minute one. That's a realistic option if you're not the fastest, right? That's what most of the field is doing in a lot of races. Last thing, I don't know if there's more you want to add to this conversation, but you said something and now I just want to argue about it. Okay. And that is the person with the fastest leg speed will win the race in that situation. And it's my least favorite take among commentators. Well, if you let him, he's got mile speed and he's in the 5K. If you let him in the race too long, he's got more speed on paper than anybody else, and so it's his race. Don't let it go too long for the kickers. And I think it has very little to do with leg speed, and I think it has to do with the person who has used the smallest percentage of their engine up to that point, who is the most available. I still think it is the engine that wins because you've used a smaller amount of your gas tank getting to the point of the kick. I think in an all-out sprint, the person who wins the finishing kick may not win the all. If you told all of those endurance athletes on the line and said run a 200, the one who outkicks everybody else isn't going to have the fastest 200, most likely. It's because he's still the most available because he is the best, and that rises to the surface because he hasn't fatigued himself as much getting to that final sprint as the others. And so I don't like the they got great speed argument. I agree with you. It's used and it's valid, and then you see Wanyoni in the men's 1500 at the Grand Slam track, who's an 800-meter runner, outkick the 1500-meter guys. And then they're right. Well, they're right only if their pace goes slow enough, and I just said it. You let these people around long enough and you lose at the end. It's just speed, and that's because they were like in the 5K. Grant Fisher absolutely used the least amount of his engine in that race. We can agree on that, right? Yeah. He's what, a 1238 guy or something like that? 1230-something? Stupid. He ran 1443 or 1446. He used the least amount of his engine, but he didn't win the kick. Because if you go slow enough, no one's tapped deep enough that they're fatigued. And then it's purely speed or people who know how to kick. And he is a mechanical form-driven kicker. He is not a snap into a sprint form kind of guy. He's incredible at what he does, but if he runs 14-minute pace, I mean, if he runs 18-minute pace, you or I might outkick him the last 100. Probably not. But my point is, if you run slow enough, any sprinter can win. And that's what they did. Now, if it's a fairly honest pace, whoever's left at the end can't win. I think he win the 5K? I thought he did. You're saying with the 3K. He won one and took third in the other. The one he took third in, he used the least amount of engine. Yeah. Either way. If it's a moderate pace or even halfway honest, yeah, it's not about the foot speed at the end. It's about who has the biggest kick left, and you can't quantify that. Yeah, I just don't like that coming up for you people need to know about no no me either really I got a race this weekend I already talked about it on Tuesday and then other than that I press on I do I do want to talk about this you have a race this weekend yeah but I mean people heard about this race every year for the last four years I don't care we do this for us Kirk we started this as a vanity project that's not true give us the specs of the race 17 mile trail race like 2300 feet of gain and loss in the first 13 and then it's pancake flat for the last four four and change so it really runs like a Midwest mountain race is in its truest sense for 13 miles and very technical at times very runnable at times but very steep and aggressive and then it just makes you run try to run flat and fast on tired legs for the seemingly longest time to finish which is honestly more cruel than if they just kept us on the undulating terrain in my opinion and the thing is is I'm gonna bring both my trail alpha or vapor flies and my tectonics twos and I'm gonna assess out if there's a justification for wearing a road super shoe on the trails or if the terrain is gonna be too mushy and that would be a detriment what's the weather been like this week fine it's been hitting 60 here every day little rain today actually but I think it's gonna dry out but it's been consistent like 60 it should be around in the 40s at start time in the morning which is warm so it should be the weather shouldn't be a factor yeah we're 39 and drizzly today just like yesterday so really our trails won't be great a little bit of snow in the forecast too it's 39 currently where you're at currently huh we're at 50 right now yeah weird well last year you got done with the race and said I am wearing if it's dry next year I'm wearing vapor flies I said that yep could have said that all right well I'm bringing them with me if I feel like they're gonna be a liability I'll wear I'll wear the actual trail shoes do we know it's gonna take you an hour and 46 minutes no that's Afton this has been oh okay this is two hours right two hours so what are you feeling with for two hours pro bar bolt energy chews they still might go to still doing it oh my goodness do I love them and anybody I have tried the bolt energy chews they end up sticking with them too something about the way they sit the way they chew the way they make you feel they just work so bolt energy chews by pro bar I stumbled upon them years ago and I experimented with plenty of other things and they just work do you have a relationship with that company I do not so that's that's the fuel I'll have 16 ounces of water on my back if it's cool I can get away with that for the entire race if not I'll either need to refill or swap out bottles with my wife she'll have an extra on her at some point I might just be like hey can I have yours and we'll trade but that's it pretty much that's as straightforward as it gets she racing too she is not no but my father Pete same name as your father my dad has not watched me race since maybe a road race right out of college not watched me compete at anything and it's my sister's surprise 40th birthday this weekend and she doesn't listen to this podcast I don't think so I hope when do I need to release this and she won't she won't listen to this I doubt it anyways and so he's coming into town this is actually entertaining he's coming into town for her surprise 40th which is on Saturday and my mother who I said my parents are divorced but it's irrelevant they make decisions separately clearly for that reason and my mom says this is the day that we need to have the surprise birthday party on and I said mother I have a race that you know about this race I'm going to the race mom anyways dad's coming into town and I say dad I have a race that morning so I'm not gonna be able to make it to the surprise I'm missing the surprise part of the surprise birthday I'm showing up after the surprise has already happened and he says you got a race huh I was like yeah dude he said I'm gonna miss the surprise too Kirk won't come watch you race so me and Pete are heading down to Zumbrota and he's gonna watch me race for the first time since I mean I hate to say it but it might be in two decades so that'll be fun it will be I've been fortunate my my parents have seen a lot of my races really in adulthood well they happen locally I don't live in this I haven't lived in the same city as my father I've been four hours away forever four more four more same with my mom she doesn't watch so that's yeah that's it for the weekend so it'll be fun awesome I'm excited for that I hope they get the same experience minded at my last race which is that they had to like shuttle me around and nurse me back to health afterwards because I was so destroyed from going so deep into the well what race was that that was the the 4th of July mile race oh that hot day right where when you were done it hit you yeah yeah they just had to sit there while I laid on the ground in front of the nursing home for like 25 minutes and then they they had to drive me home because I couldn't I wasn't confident to drive that's what everyone wants to do with their 37 year old son well if it's under that circumstances versus like you were boozing too much or something I think that's acceptable you raced yourself into that state I just wondered if they were thinking they're like really this is what you're doing with your life could be worse things my father was a state champion in cross country in high school and he took second or third at his sectional the weekend prior as a senior and he basically got out kicked in the last half quarter mile and took third and he's all about guts right my dad there's no excuses you don't show up late to my dad's house you don't make excuses like your actions are you and that's all that matters right he's a good dude but he's a fundamentalist that way and when he went to the state meet as a senior not a favorite he got beat by somebody on his own team he said with a mile to go he turned himself absolutely inside out and his kick started then because he knew what happened at sectionals and he put 100 meters on the field and didn't give him a chance said he ran I was like an out-of-body experience and he was a state champ there's a picture of him at the finish line I mean he looks horrible like you're describing horrible like in the headline on the paper says DeWinton Company went state the team won state they're like the first and third place finisher and then anyways so DeWitt Mr. DeWitt runs with guts there ain't no there ain't no pussyfooting around out there Bracken I gotta lead with authority and I gotta start kicking from about mile nine and finish strong so I gotta that's the those are the shoes I have to fill well he's uh he's in a trade to be an exacting man that's fair that's fair all right enough about that not one last question yeah two last questions actually one do you have any idea if any local studs are showing up yeah there's a guy who finished four minutes behind me two years ago but he was young 21 22 something like that so he's like he's older now and looked at he looked like he had some pretty impressive results so you start to think okay I'm getting older he's getting older it's working for him and against me where does that meet if he's training hard so there's two in the field that have raced that have been within the realm but nobody that's beaten me head to head but there's two younger ones that I'm very curious about that have pretty good resumes that haven't showed up in a while okay and then finally if you were to time trial this and just go all in on pure efficiency of everything would there be a place in this world to put in speed laces and run the first 13 in tectonics and make a 10 second change to alphas if I could change in 10 seconds yes that would be if you triathlon style speed laces yank off but there's no drop bag in a 17 mile race I mean what am I put them on my back I'm just saying in theory if you had someone on the side of the road there on the side of the trail if that were the case I would do that because it would be faster and I'm sure I would get me DQ'd for some sort of a system but yeah it's that flat that packed and that fast for the last four and a half miles that's drastic between the two races that's why the vapor flies even if they're not the best choice for 13 might make up for it in four and a half of flat so it's a it's an interesting design right that's a very interesting yeah design so yeah that'd be an interesting put a pair of alphas on my back yeah wow what's your descent in the vapors yet yeah I'd have to last year great great descending shoe got a plate on them they protect your feet great well there you go you're set yeah I'll update the crew I'll update you folks next week all right well good luck no good destiny Kirk good destiny you said it correctly thank you and then yeah we'll catch everybody next week is this how we're closing this thing out it's closed okay see ya if anything resonated with you on today's episode and you're curious about taking your training to the next level check out the running public.com where we have a training plan to fit your needs"
}