{
  "guid": "0e4ebc40-df4d-3dd0-9686-eca6329c05cf",
  "title": "Training Tuesday: The Best “Bang for Your Buck” Workouts",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. It's Tuesday, folks, and you know what that means, Training Tuesday. We are going to take every rabbit hole, follow tangents, use useless metaphors, get lost in the weeds. This is Training Tuesday. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. Kirk D. Wint, you left us with a statement on the last podcast on Friday that you have done this trail race three times, I believe, and your total spread is like 40 seconds or something foolish between the three races. It's not 40 seconds, but it's less than a minute, I think. Well, you're misremembering because I was referring to a different trail race. Were you really? Yeah. I love where you're going with this, though. Whatever. Give me this moment. Point is, you've run this several times, and you're around the same time each time. Yeah, that's true. And you went out and raced this weekend, and can I spoil it for the fans? I'm going to start with the result, and then we'll work backwards. You broke your course record by four minutes. I did, yes. So that, to me, is an A-plus race. Yeah, it went well. I'm very happy with it. I was very pumped for you. We were at the track this weekend, so I was keeping tabs on a few people's races, and there's no way to track yours. So I had to wait until Lisa leaned over and said, did you see this? And she had Strava pulled up. Oh, she did? Yeah. That's nice. Oh, dang. Kirk popped one. So congratulations. Thanks, man. I know in the grand scheme of things, it's like a highly competitive but local trail racing circuit. But in the grand scheme of things, it's average potatoes. But for me, it's as good as we have here in Minnesota. It really is, as far as competition, as far as awesome trail and technical and vert and all of that. It's one of like three or four venues we have in the state where people come to race. And so I always put probably a little more stock into this race than maybe others, just because it's not a big travel race or a big national level competition. It draws from the surrounding states. But it went well. It's like, you know, fitness is fitness. And the longer the race, the more that fitness has time to just show its truth. You can get it right and you can get it wrong in a shorter race. And sometimes it has a lot to do with just miscalculation or perfect calculation. But I feel like the longer it gets, the more it deducts where you're really at. You'll find out by the end. And so I found out that I'm fit, and it was really good. 17 miles? Yeah, 17 just a little bit of change, yeah. It's long enough that if you race hard, you're going to find out. Yeah. And you described this that it's like 13-ish. It's like a half marathon of Midwest hill slash mountain, which mountain is not correct for other parts of the world, but for where we are. And then it's a four-ish mile gravel trail flattish hammer to the finish. So when you get to that point, you either have the ability to turn it up and run flat and faster, you don't. And you got to that point, you were able to work? I was able to sustain. I wasn't able to. Yeah, yeah. So, yes, my time last year in this race, we had similar conditions as in like with these trail races, as most of you know who run them, like course conditions largely dictate how well people can run that year, right? Luckily for us, it's a great trail system. It's always the same exact route. There isn't change often unless there's a rare circumstance like flooding, which we had a few years back. But point being is it was a dry course. It was a 45-degree start, a 60-degree finish, we'll call it. It was like really perfect running weather. And there wasn't, I mean, if there was a step of mud maybe in the 17 miles. So it was like dry conditions both last year and this year. And last year I ran solo the entire race pretty much from the gun, you know. I did my first look back last year about three miles in and it was like there ain't nobody back there that I can see. When we were hitting some switchbacks where you have a bit of view. And so I think last year, I don't know why anybody would remember this, but I lost a little bit of focus in the middle of the race because I kind of knew I was alone already. But I was chasing the master's course record last year because I did not have it. I had not raced as a 40-plus. And I ran two hours and two seconds. So just over two hours. And I only beat the master's course record by 17 seconds. It was that close. To the point where I was looking at my watch a mile out-ish and going, first of all, do I have a mile or more left? Second, I don't know if I'm going to actually get this. But I did. And I thought I ran a good race but not a great race. So that was last year. And then this year we had a little more competition show up. And this young gentleman, Tyler, who informed me after the race he ran at Eau Claire. Oh, cool. Yeah. For those listening, that is a school in the conference that Kirk and I ran at in college. Yeah, but he was there about 15 years after me. 27. It's funny. We were watching all these, like, dirtbag trail runners. And it was like all five of the top five have, like, mustaches and the same look. It looked like just a bunch of douchebag trail runners all, like, looking the part. I thought it was just funny. So this young guy's got this big bushy mustache. Anyways, he went out wearing a cutoff collared flannel, which is, like, the ultimate dirtbag trail runner vibe, right? There's a couple of these guys who like to wear flannels. Have you seen this recently? Yeah, and now they, like, rabbit and a few brands even make running button-up flannels or different prints in performance material just to accommodate these misguided youth. So there was a handful of people at this race. And I think maybe it was in a cutoff. I think it was a short-sleeve flannel. It looked like performance material maybe now that I think about it. It's just an interesting – like, it's something that you're just starting to see the last couple years. Yeah. Anyways, and I made a tactical wardrobe error as well, which we'll talk about. But anyways, Tyler went out, and there was a few guys right on me as well that I could feel right on my shoulder. And he had a 20-meter gap pretty early up the first climb. First climb, I was like – in the first mile, we had, like, 300 feet of gain, and we came through in, like, 7.0. I mean, we ran hard. Great adjusted pace was, like, 5.20 for our first mile. And I was like, he's stretching me already. This is going to be a problem. But I didn't want to let him out of sight. And then we go down the downhill, and he's got this big, bouncy, powerful open stride. And I was like, well, didn't reel him in at all on that. I thought maybe I would. And I was like, he might have put a little on me even there. And then we hit the first flat section. And lo and behold, that AlphaFly running maybe paid off even in that regard on the roads. And I slowly, without any extra effort, started reeling him in on any flat section we found. And that's about mile 2-ish, 3-ish. And you sort of hit these rollers for, like, 3 miles. You're just feathering on and off the gas. And I found myself in a good rhythm and passed him there. And he leached on to me for a few miles. And then we hit that second big climb, and I said, nah. Nah. This is going to be where I'm going to do this thing. And so I pressed pretty hard. About four-plus hundred-foot climbs, you know, something like that. And then I looked back at the summit, and I didn't see Tyler anymore. And so then I kept pressing mid-race to make sure that gap stayed. And just kept on it. I think I ran a little bit fearful, which is a good place to be because the trails are tight. You can't always have good visual. And then that would be that. And so I got through pretty trashed to that flat section and did everything I could to run six-flat pace. And that was all I had at that point. I think I ran 1.55, and then I was like 6.0s for the last three miles. And that was me extended at 178 to 180 beats a minute. Just like that's where I was at, trashed. But I had enough of a gap there where it didn't matter. So, yeah, I ran 1.55.58, over four minutes faster than last year, and smashed my own course record. I think this one's going to be a tough one to beat for anybody coming up in the May I have a few takeaways as well now that it's wrapped up. Okay, but I want to get to those, but you said something right before we started recording. I asked if you were beat up and you said a little more than I expected. And then you told me you're going to take a certain amount of days off. And I think that the listeners should hear that as a reminder of what is appropriate after a big effort at the end of a big block of training. Yeah, I will scream this out. This is the one rock I'll die on, which is like take your dang rest. And I think a lot of people are actually in this boat. So I want to rewind just a hair with that. And that is I got the flu in January and it forced me to take an entire week off of training. I was wrecked. That's just January. It was really on a calendar three months ago. And a lot of you out there probably went through a similar thing this winter, COVID, flu, norovirus, XYZ. And most of us are like, yeah, I was sick. So that was my rest. And now it's April. I've only been running for three months. I don't need a break, right? I have races coming up this summer. Well, if you're doing your job and you're training hard and with purpose and you're racing hard and with purpose, which I did this weekend, it's time already to take a quick reset to make sure you're available by the time your next big race comes. And I have Grandma's Marathon in nine weeks. And I'm taking this week off by design because if any of you think back to past builds, barring you're not coming off a long injury like you have, Bracken, injury bouts, fitness doesn't go anywhere that quick. And I would rather be at a start line hungry than like I haven't taken a break in eight months and I've been training hard and with purpose. And so I'm going to take this week. I'm only going to strength train. I might do my first run a week after the race on Saturday. I might go out for an easy run. But I just think if you're one of those who are good about training, you need to also be good about your resting. And so, yeah, I'm still sore here just a bit today in the hips and quads, and it's three days, four days removed from the race. So it tells me I need to chill. The stock reply that you get from athletes who are either inexperienced or not confident in a rest period, not confident in their ability to step away, is something like I don't need to take any more days away from running. I really don't want to lose what we built. And this is just your probably quarterly PSA reminder from us that you can't lose anything in a week, especially if you've built. If you've built to the point where you need a break, you can't lose anything in a week that you can't get back in like three days. Yeah, and heaven forbid I have a clunky first seven to ten days back just because I'm, you know, relearning impact and the muscle memory of the mechanics. But I can sacrifice ten days of maybe ramping back up and then, bam, feeling like myself again and even better. I don't know about you, but I remember this. This was in college, and I experienced this for sure, and maybe that's why I'm so adamant about resting. But every time in college we had basically three seasons, cross country in the fall, indoor track in the winter, and outdoor track in the spring. Sometimes indoor and outdoor felt like one season, but you understand what I'm saying. Good coaching makes it two seasons. Correct, which is what we did. Or great coaching makes it one season with a preseason build. Sure, sure. I'll stop muddying the waters, but basically, yes, you have three things you're trying to be good at. So what I'm getting at is we would have this cross country season, taper in, have a big summer of training, race a bunch, have a nice taper to your last race, so you almost feel like you're deconditioning there, race, and then we take our week plus off. I'd come back to running, and inevitably I'd have a tough week or two back where I'd be sore and stiff. I wouldn't feel that great, and then I would just start popping. And we all would, popping. And suddenly I'm running five seconds a mile faster three or four weeks back after my break, and now I'm like a new – it's like my body had time to absorb the last season. And suddenly I leveled up by just resting. And then we would take a break after indoors and come to outdoors, and guess what? Same thing. I'm just better now again. And it wouldn't have happened without those breathers for your time to actually soak in and recover cellularly, structurally, metabolically from the whole season previously. And so I noticed that like every single time we took a break, returned to training, like where did that come from, this new fitness? Well, duh. You finally let it soak in. And so I've just been a firm believer since then. Did you ever experience that? Yeah, in particular that cross-country feeling because I didn't run cross-country for three straight years. That's right. And then I did my first year, and then I took a year to go try baseball. And then when I came back to running, I was just like a bulked up 800-meter runner. And cross-country held no appeal to me since I wasn't good at it to start, and now I was like 15 pounds heavier, and I was like I don't need that. I'm just speed. And then finally I realized that endurance is speed, really. Like it's what you need for a middle-distance runner. So my final year I ran cross-country, and I struggled all year to hold on to real cross-country runners. But part of the way, two-thirds of the way through the season, we did a one-mile time trial, and I want to say I ran like 429 at practice. It was on a trail, a flat, packed trail. Like there's probably 20 total feet of gain in the mile and loss. Anyway, it was like 429, 430, something like that. And it was all out. I was kicking and I was trying to catch people. And like probably four weeks later, the season ended, and then we took a, what, 10 days down or something like that, and we came back in the first week back. We did a normal week of training. We did like one tempo run or something. Then we went indoor and did time trials. You weren't allowed to spike up. You had to wear your flats. And we got to run either like an 800 or a 1200. And the distance guys ran 800s, and the middle distance guys ran 1200s. This was like December? Yeah. Yeah, or maybe even November. Okay. But it was just two weeks after cross ended. And so I ran a 1200 and basically was alone 200 meters into it and ran under control because the plan was run hard, don't kick. And I ran like 309, 308, 309. Way quicker on paper than what you just did in 429 in a full mile. Yeah, so that, I mean, that's on, let's just call it 309. That's on pace for 412 for the mile, which I wouldn't have held on for 412. But I also wouldn't have run an 82nd last 400. I was in under control that day. So I probably could have run for just right then if he had said, you need to hang on. You're on a whole other quarter mile. I probably would have run about 420. Yeah. And it was alone, and it would have hurt that last 200 or 300, but it would have been fine. So it was like a 10-second difference just, I mean, part of that's the trail, right? You can't really compare apples and oranges, but just from resting for a little bit. The weight of the cross-country season was in my legs, and then it was gone. And so while I should have been really rusty, instead I was just able to use all the things I had built all fall. And that was the day I also realized cross-country training will absolutely help my half mile and miling. But, yeah, it was a stark slap in the face that day, like, oh, yeah, you got to rest sometimes. Again, I know a lot of you out there listening have patchy training and you're working on being better, and this doesn't necessarily apply to that crowd, right? It applies to the crowd who is compulsive enough like me where you just have to no matter what, and you end up driving yourself into the dirt more often than not, which is what a collegiate season is, right, in college. It's just like two big workouts a week and a race every week and a long run sometimes the day after your race, and pretty soon you're just having a hard time absorbing it. But you know what I'm talking about with the rest period and the leveling up. And so it's like we put, you know, we referred in the past plenty of times like bank deposits, right? You put money in the bank, money in the bank. Like that money just doesn't disappear because you take a week off. Like it's still in the bank. Yes, you're losing just the tiny, tiniest grains of sand at the bottom, right? A few pennies fall out that week and maybe a couple nickels and quarters. But like you're not losing $100 bills, you guys. Like they're not falling out of the bottom. And so you're just a little behind, but you're also refreshed and invigorated and craving training again and actually recovered to the point where you might feel a little fat and sloppy and or seven days after a race, you're going to be just fine. Yeah. So anyways, you'll hear that PSA from me again and probably Bracken periodically as we move forward. Every about six months you'll hear us shove that down your throat. But I think that pretty much sums it up well. I just think that consistency is rewarded. And I think I've also learned a little bit about, you know, I took a trip out to Monterey with Jess and I beat the living snot out of myself for like basically two hour runs in the mountains every other, every few days and came back wrecked and ruined and feeling terrible to be honest. Had really good work while I was out there. But the timing was good, right? That trip ended. I had four, three weeks until the race. And so I kind of listened and backed off and let that soak in. And I think in hindsight, it was the perfect lead in like, right. And I had some tough workouts after that trip for like two weeks, but I knew I just needed to listen. I backed off here and there. And the race week taper, which was just enough to get rid of all that other fatigue and allow my body to access my fitness again. So I really like, like really like that overreaching phase to end three weeks out and then just a gradual, gradual sort of soft landing into a race. I think the more I do this, the more I think that three weeks is that magical number to like, you can feel like crap three weeks out because you've just done a lot of intensity and a lot of volume and then just slowly let off the gas all the way into race day to the point where you're almost wondering if you've lost fitness by race day. You haven't, but that's like, I think if you can plan it that way, I think I like that lead in. It's the natural taper. Get a little too tired and beat up and then have to pump the brakes a bit. And that works for a lot of people just as well as an intentional taper. Yeah. So last thing I want to talk about is my nipples. Good. Yeah, I figured. So I've never really been a nipple chafing, have you? I've had it happen, but it's not a very, like it doesn't occur often in my world. But when it does, you know. Yeah, I still know. I remember the first time I did it and it wasn't until I was in my 20s. You ever hear like people talk about like their nipples bleed, they get so chafed they'll bleed? Yeah. Okay, well mine didn't get to the status of bleeding and it's awful. And I have to imagine if you get to the point of bloody nipples, that's a level that has to be nearly unbearable. I've got to the point where there's a scab the next morning, but nothing ever bled prior. Mine was like oozing and sticking to my shirt like for days, but never bled. So what I did, this is such a knucklehead move. So I decided to pull out my old Oshkosh jersey from 2003, which has been sitting in my drawers. And apparently the material has become stiff as a board over the years, right? It is not soft anymore. It is rigid and firm. Do you have that jersey? Can you throw it up on screen here? I think it's in the dryer. I could. It's not the checkers jersey. Well, the one I wore is just the black. It's a black with yellow Oshkosh. And I'm not built like I used to be built in college either. So I fill out the chest to the point where it's like almost acts as a mini sports bra at the same time as a jersey, right? It's pretty tight. In fact, I got some looks from people at the start line. I could tell people under their breath were like, what's this bro doing here? A couple times people were like, look at this guy. I was a little small, we'll just say, for my build now. Yeah. You were stuffed into that shirt. I was stuffed into the shirt. And by God, I was 15 minutes into the race. I'm like, my nipples kind of feel funny. Like, oh no. And by the time I hit 30 minutes, I was in pain. And I still had 90 minutes to go. You can't do anything at that point other than take your shirt off. Which I didn't because I had my bib on it. Yeah. So my nipples got rubbed raw for the entire race. Like something I've never experienced before. Like it was all I could think about. And the only thing that could make me not think about it was to press so hard that the overall effort from the race distracted me from the nipple travesty that was happening. And so even as of today, it's Tuesday morning. I raced on Saturday morning. Going in the shower is terrifying. Like the burn. And then I have to sit there shirtless for the next hour until it dries all out so I can put a shirt on. It's like people deal with this on a regular basis. I made a grave error. And I really wanted to wear that jersey again in the future, but I just don't know if I have it in me. Well, two points of, I guess, advice. Not necessarily just for you, but for anyone is I now tape my nipples with KT tape. They also make little nipple guards you can put on, but I find KT tape is just fine for ultras or any race where I think my shirt might get soaked and I'm going to be out there long enough where I'm a salty sweater. Second is lanolin. Lanolin is the cure-all for nipple cracking, chafing issues. The aesthetic of KT tape or Band-Aids over your nips, like it's got to be obvious, though, if you're wearing tight-fitting clothing. Like, oh, that guy looks stupid. Band-Aids, yeah. KT tape just goes right down to it. I even have flesh tone. It's kind of a good look. It's not a boob if you can't see the nipple. Wow. That's going to go down in a book somewhere. You agree, don't you? All right. Well, anyways, that was it. Bracken asked me yesterday, he said, how's the body feeling after the race? And I said, everything's fine, but my nipples. And that's where I'm at as of today. Yeah, I mean, all things considered. It could be worse. Could be worse. Yeah. Well, congratulations. Then before we move on, I want to brag about another four-minute PR. We don't do this a lot on here, but this is one of those long-time coming things. A guy I work with, Dusty Jameson. Dusty. Dusty hit his Boston qualifier on Sunday at the Athens Marathon and PR'd by over four minutes. The marathon is a fickle foe. And so when you get an effort where, as he said afterwards, that was my max on that day. I just got everything out of it. And he ran solo. Next person ahead of him and behind him were both minutes on, one minute plus on either side. So it's just him on his lonesome out there, just right in the line. So congratulations, Dusty. You earned that PR and that Boston qualifier. What did he run? 3 flat 29. Oh, that's so bittersweet. Does he have the, what's the actual qualifier? And do you think he has the buffer if he wants to race? Yeah, so they've tightened down the standards again. Okay. And he beat that tightened standard. That's fantastic. Yeah, he tagged us on our running public account, I think I saw. Oh, nice. He's at least two minutes clear of the buffer. So our guess is he's in. That's awesome. Well, if you're going to talk about athletes, past guests on our podcast, an athlete I've worked with for years now, Hannah Franciosa. We had her on talking about her. I think she's missed on the Boston qualifier, Hannah, you have to correct me if I'm wrong, four-ish times, and it's become her nemesis. She went out and ran 3.15 and beat her PR by like 20 minutes. What does she need, like 3.24? Oh, she smashed it. I think she has like a 10-minute buffer now. She ran out of her mind and it all came together, and she ran 3.15 this weekend. Her husband, Jared, ran the half in 1.27. We thought 1.30 would be a great goal. Both of them just laid down. So we had some good marathon and road records this weekend. Running public family had a big weekend of racing. They sure did. Congrats, guys. All right, so I really – where did I – It froze up here. We haven't had a freeze in a long time. Can you hear me? I'm going to give it a second here. I wonder if we lost him. Oh, he's back. Can you hear me? I can now, yeah. So I could hear and see you the whole time. That was bizarre. Weird. Yeah, you were locked up. Here I am. So I was just saying, you came to me with the topic for today, and I freaking love it. Great. Let's dive into it. Yeah. All right, so this is one of those where I prepared the idea, but I did not prepare the content because I want it to be completely emotion and feeling based. Science may have informed some of our opinions on this, but this is basically just an opinion piece today, and that is right here in this moment in time, what do we believe to be the best bang for your buck workouts for interval style, tempo style, long run style, that kind of thing? And I So we're just going to go on our feelings and emotions right now at this point in time. And it could probably change a month or a quarter or a year from now. But we're just going to emotionally answer this. May I ask why this came to the surface for you? Yeah, because right now I did a consult yesterday and I did a consult last week. And I had two conversations with other athletes who are all kind of feeling the same thing I'm feeling right now, which is I want to go after more than one thing. And so I need to fit a workout in that helps me do another thing, but it can't be the main mover of my week. So what could I do that's the best bang for my buck so that, in fact, the guy I talked to yesterday wants, he's training for this really incredible 100K. It's one that's on my bucket list now after he's kind of brought it to my attention. I love the concept of it, but he also has a road mile he wants to hit on the way there. And he's like, I just kind of want to do what you want to do. Run a mile? Run an ultra? Let's be good at both. And so we're kind of having that conversation. What is bang for your buck that you can fit into a training load here? It's actually top of mind for me as well with a marathon and trail racing on my calendar. I'm in the same boat trying to kind of make sure I touch it all while keeping true to the staple of what I need. So I'm on board. Okay. So I think I'm just going to start with speed work. Now, we've had a whole episode on what is speed work. And I'm not going to talk about true top end speed. We're just going to say faster than 5K pace is our definition of speed work right now for this. We debated back and forth last time. We're not going to debate here. I'm just making the rule. It's faster than 5K work. I think the last time we chatted about this, we determined in its pure sense, it's anything faster than intended race pace. But I still agree that it's got to be 5K pace or faster. That feels like speed. Yeah. And I'm even going to say it can't be 5K pace. It must be faster than that. Because some people are running 5Ks closer to the time of a threshold pace. Fair. So I'm going to say it must be faster than 5K pace. You could choose only one workout to get a good stimulus. And for the audience to remember, the intended purpose of this is to make you faster, to be better at handling an anaerobic state, but also to become a more efficient runner. And so juggling those three things here, like you have to get somewhat anaerobic. You have to run fast and work on a great stride. But it also must give you some efficiency improvement moving forward. So with that in mind, what workout would you choose that is the best bang for your buck for speed work? Love it. But I need one more question for context. Okay. What lens are we looking at this through as far as like what racing am I doing or what? No guidelines. This is why I didn't want to prep for it. We're just wherever our mind takes us right now. Like it could be anywhere from a 50K to a mile? Yeah. But you're choosing work that's faster than 5K pace. Okay. I don't know if you're going to like my answer, actually. Well, you'll like it, but I think you'll push back on it. Okay. It is any session in which allows you to accrue volume with a finisher. Meaning maybe this session is a 30 to 40 minute tempo or threshold session, staying true. Oh, I hate it. You hate it? That's such good advice, but I hate it. Keep going. Well, right. And so I could argue against myself here, but if we're talking about having our cake and eating it too, it would be a mix of some sort of 30 to 40 minutes of mostly threshold, I'm going to say half marathon type work. I'm going to finish that up, and then I'm going to rip, let's say, four to eight by a quarter mile, finish with 200s, give me ample rest to turn it over. I've already done the bulk of my stay power work. Now I'm trying to have it all here. All right. So I'm going to distill this down. Your best bang for the buck speed workout is tacking on fours and twos as a finisher to the end of an existing workout. To keep it simple, yes. And then I do have a thought on if we're going to take that first part out and just a pure type of session, a structure, and then I'll give you the floor. Well, because it's our podcast and all we do is confuse things, I'll let us each have two. Okay. So if you want a speed finisher, which is, let's say, fours and twos tacked on to the end of something, I will accept that as a valid answer. I will not accept a combo workout as your best speed workout. Okay. That's fair. That's fair. You're right. Yeah, you're right. And I think for your buck workout in general might be a combo workout. Yeah, but it could even be like three by two miles and then you finish with eight by a quarter. I'd be like, beautiful. Right. So I will accept speed finisher. Okay. But you're right. Okay. So what is racing? Okay. Racing, whether it's a mile or it's a 50K, isn't I'm going to run hard and then rest and then run hard and then rest and I get to run hard and then rest. Like that is not your route to your fastest race, correct? Racing is keep the gas pressed down into a hard but sustainable effort and do that through the finish line. Interval sessions are not that, but they're very helpful in maintaining a percentage of your top end speed on race day. So I think if I were to go bang for your buck over speed or speed training, I would do cluster sets with bigger rest in between the cluster sets. A classic example of this. So you can get it. I don't want a classic example. I want the best bang for your buck version. All right. Fine. Dang it. All right. Four by four by 400 meters. Four by four by 400. What rests between reps and what between sets? 30 to 60 seconds is all rest between reps, but then three to five minutes rest between sets. So basically you would do like a 400 short rest times four. And then after your fourth rep, take a big reset, three to five minutes to charge back up. What it forces you to do is still run hard on short rest, but then it gives you a fighting chance at repeating it for duration through sets two, three, and even four. And so it keeps the integrity of the reps high and fast because you get that big break every fourth rep, but it forces you to, you're not fully recovered going into those reps with the 30 to 60 seconds rest. So I think cluster sets, four by four by 400 meters, 30, 60 seconds rest between reps, and then three to five between sets. I'm sticking with that. Okay. Are you happy with that? Is that what you were looking for? Yes. Yes. A singular workout that people can choose and say, I want a great bang for my buck workout. You gave that four by four by 400. And I think that covers the gamut from 5K to marathon, depending on your purpose of it. Yeah. And I would also say that for the entry level, three by four by 400. Well, three by three. Nearly as good of work without the drawback. Yeah. All right. So without explaining, why don't you go to what comes to mind for you then? Okay. So I like that. And I actually settle on the same kind of thing. I believe that bang for your buck, the two best paces for most people to work at are mile pace and 3K pace. I think 5K pace is just slow enough that you have to run bigger volume at the sets and it becomes very taxing. I think 3K pace and mile pace are like the best strides most people can run. So I like... So let me... Sorry to interrupt already. When you say it's the best stride that people can run, what do you mean by that? I think it's like your most triumphant stride. I think for most people, if they run much faster than 3K or mile pace, depending on the individual, they can get sloppy. They can start reaching for power and doing it inefficiently. And if they run much slower than it, they might run into the same kind of thing. More ground contact time, worrying about thinking about the stride. But I think somewhere between 3K pace and mile pace, most people click into their best version of their stride. Not everyone, but mostly it's fast. It's powerful, but it's still smooth, especially if done in short bouts. So that's what I'm going to choose. I would either take 200-meter reps of mile pace or 400-meter reps of 3K pace. 200-meter-ish slow jog recovery for the mile paced. So 200 on, 100 to 200 meters off for the miles, about 15 to 20 reps. Low end for pure bang for your buck. And for 400s at 3K pace, 100-meter slow float. And I would do about 10 to 12 reps. Like how, like let's say you're running, let's just use clean numbers, four-minute pace for your 200s. Just, and this, okay, it's fast. But then what sort of recovery, pacing. You're talking continuous jogging, which I'm a huge fan of. That's most of my sessions. So why the jogger slow run in between? Because it prevents you from overrunning twos and fours. Two hundreds and four hundreds are, I think, the easiest intervals to overwork because they're short enough that you can overwork several of them before you pay the cost. You're running thousands. You overwork the first one and you're like, oh, shoot, I got to get this back in. Where if you're running twos, you might run six to eight too fast before you realize I've already not run the intended pace for this workout. So the slow jog is just enough that your breath doesn't want to come down well. And then you really focus on what is sustainable. Okay. So I'm going to say 10 by 400 for minimum effective dose with 100 meter float and like, let's say 15 to 20 by 200 with 150 to 200 meter dawdle at either mile pace for the 200s or 3K pace for the 400s. Do you want to know one of my last sharpening sessions before my track 5K last year? The one where I ran the fastest was? What? 12 by 400 meters with 100 meter recovery. Love it. And you know what happens in that session? I love it more, I think, for a 5K session especially because you're running 3K pace, you're running faster than 5K pace, but you're having to sustain it for duration. Your heart rate and the feeling, you start each rep compromised. Just slightly. Right. You don't want to start yet, but shoot, I'm already at my 100 meters, I got to go. And you end up feeling the feelings towards the back half of that session like you're in a race, but you're not taking the damage because you're getting the reprieve. And so it just locks you in. I love that 400 meter on, 100 meter off or float session. Beautiful. Yeah. And I find that both of these are invigorating when you're done. These aren't turn yourself inside out sessions because the intervals are short enough compared to the distance that the race pace is. Mile pace for only 200 meters is not a challenge. It can get challenging towards the end of the workout, but you're never fighting to run your mile pace for 200 meters at a crack. And so while you're getting great stimulus from the stride and with a little bit of lactate buffering, you're not killing yourself and you get done and you're like, okay, I could work tomorrow if I had to. And I think that's kind of that feeling I want from these. Get some benefit, don't be destroyed. Yeah, I like that. I love those sessions. Do you think there's a place, some of the athletes I work with have seen this session. It's one I turned myself onto like by experimentation years ago and it's actually fours and twos, so it's a combination of both, but going back and forth. So actually it's like a 400, a 200, I'm actually weaving in and out. Not all fours and then all twos, it's back and forth. Have you ever played around with that style? We used to do that a lot as championship season got closer, but we'd change paces between the two of them. I just always found that to be a little bit solo, to be a little challenging mentally. I love the work. 400 starts to feel really long actually. The fours feel long then, yeah. I love the workout. I think it's very good, especially priming yourself for races. I could easily be talked into it, but it's just, if you're solo by yourself, which most of us are when we have to do speed work, these are very approachable workouts. Yeah. Love it. And again, I'm not saying I'm right. I'm just saying that's what I feel in this moment. If I had to just assigning generic speed session to someone that I wanted to still be available a day or two later to do the real work of the week. Well, you know, build yourself some credibility here. How many quality interval sessions have you done in your lifetime as your case and subject study? I don't even know. I couldn't even put a number on it. Three a week for four years in college. For six months out of the year. I'm in the thousands. Yeah. You've had a lot of chances to experiment and play and see what makes me feel the best, what makes me race the best, what is the most bang for your buck. I mean, thousands of sessions we've done. Yeah. So what you were saying, you don't have to back it up at all. It's like, listen, I've done the stuff. Yeah. And I think that it doesn't always matter that we ran in college, but because we were middle distance runners, our entire aim in life was to run fast intervals. And so we got a buffet of interval workouts and we got to feel what they all felt like. And a lot of them are really miserable. And some of them aren't, but still feel like you've been accomplishing something. And these are that. What's one session, if you look back, the actual exact session that stands out to you the most from college that you thought, like one, I get it now. And two, like that felt productive. What is one? I have two that stand out, one in particular. Productive. Oh, you know what? Honestly, it was when we would run some sort of cut down ladder. I've talked about this one before. Let's say it was 1,800, 6,6, 4,4, 4, 2, 2, 2, 10 minute rest, all out 800 or all out 1,000. It was like when we say all out, it was as fast as you can go without kicking. So like a 95% effort. And those, you'd get done and be like, I get it. Because you would dread the entire workout. You would dread that finisher. And so you would kind of stay within yourself on the reps, but you still had times you were supposed to hit. And so for college kids, it was a great way to keep us from overworking the reps. But then you would just know this is going to be terrible. And then you'd get through it and you'd find I got through it better than I thought. But the entire 800 meters was a useful tired stride. And so you didn't have any floating in there. It was just work start to finish. And it gives you something in the second half of an actual race knowing that I can run pretty quick pre-fatigued. Now I can try to fall asleep for the first half of this and then still know when I'm tired, I know how to recruit my stride. So I think that was the one that I would want to do the least and do the least frequently, but just felt like I leveled up as a runner today. I bet you did about once a season. You would do, I think, two of them indoors for six months out of the year. I'm in the thousands. You've had a lot of chances to experiment and play and see what makes me feel the best, what makes me race the best, what is the most bang for your buck. I mean, thousands of sessions we've done. So what you were saying, you don't have to back it up at all. It's like, listen, I've done the stuff. Yeah. And I think that it doesn't always matter that we ran in college, but because we were middle distance runners, our entire aim in life was to run fast intervals. And so we got a buffet of interval workouts and we got to feel what they all felt like. And a lot of them are really miserable. And some of them aren't, but still feel like you've been accomplishing something. And these are that. What's one session, if you look back, the actual exact session that stands out to you the most from college that you thought, like one, I get it now. And two, like that felt productive. What is one? I have two that stand out, one in particular. Productive. Oh, you know what? Honestly, it was when we would run some sort of cut down ladder. I've talked about this one before. Let's say it was 1,800, 6,6, 4,4, 4, 2, 2, 2, 10 minute rest, all out 800 or all out 1,000. It was like when we say all out, it was as fast as you can go without kicking. So like a 95% effort. And those, you'd get done and be like, I get it. Because you would dread the entire workout. You would dread that finisher. And so you would kind of stay within yourself on the reps, but you still had times you were supposed to hit. And so for college kids, it was a great way to keep us from overworking the reps. But then you would just know this is going to be terrible. And then you'd get through it and you'd find I got through it better than I thought. But the entire 800 meters was a useful tired stride. And so you didn't have any floating in there. It was just work start to finish. And it gives you something in the second half of an actual race knowing that I can run pretty quick pre-fatigued. Now I can try to fall asleep for the first half of this and then still know when I'm tired, I know how to recruit my stride. So I think that was the one that I would want to do the least and do the least frequently, but just felt like I leveled up as a runner today. I bet you did about once a season. You would do, I think, two of them indoors Yeah, I really like that idea. So let's do at least two more of these. Yes. So next one up, threshold intervals. We're not doing tempo runs here, threshold intervals. So roughly, I'll even give it a wide range for this. I'll say 40 to 80 minute race pace. I'll give you a very generous range here. You get to choose what you think is the best bang for your buck threshold workout. Not the most effective one, but just the single most bang for your buck. My guess is we're going to be very different on this one because mine's going to be entirely personal. Yeah, you're going to pick like 1,000 meter reps with short recovery. I'm not going to give away anything. This is a poker face. Here's the thing with 1,000 meter reps. My first was like, I want to go 1,000 meter reps with short recovery. Inevitably, I overcook that session and I end up way beyond threshold. I just, for some reason, that session just gets not too much, but more work out of me. Like I have a hard time with that session staying true to, let's just call it like threshold. I just do. I turn it into like every time I end up cooking hot. So this is so like, everybody knows what I'm about to say too because it's not mine and it's somebody else's and I love it to death and it's amazing. And it's a combo. It's somewhere in the ratio of like that 3-2 float style session. And it's anywhere between 45 to 75 minutes worth of work, three minutes on, two minutes float, feathering on and off the gas. You look at your heart rate data and you're weaving throughout threshold almost the entire time, maybe breaching it at times, but also falling below it at times towards the end of your two minute float. And it just sneaks so much work out of you, but it's also self-regulating, meaning you're going to end up where you need to end up. You go out too slow, great. Your floats are going to feel too easy and you're going to pick it up. Go out too fast, your floats are going to feel recovery enough and you're going to slow down. But by the end of that workout, you're going to be right where you should be. And you're going to be, you can, without even looking at your heart rate, you can trust in a 3-2 float session, the majority of what you just did will, heart rate wise, will be in threshold. Don't even need to watch for it, like heart rate monitor, because it will put you there. So I'm going to say 3-2 float. There can be combos. I really like the 5-3 float as well, a little grindier, but that one works. But I'm going to say three minutes on, two minutes float recovery. I love the 60 minute mark. So to be more specific, just to use round numbers, three minutes on at 5.30 pace, let's say for somebody, and then you're only dialing back like 45 seconds a mile, 30, 45 for the off. So for me, I probably am trying to run like 5.15 and then floating at six minute, 5.15, six minute or something like that, maybe floating at 5.45, but feathering on and off the gas. That's what I'm going to say for that. Okay. How do you feel about that one? I like it. It's too long for me personally, but- The best thing is you can cut the sessions. You could start at 30. Yeah, but I'm not you. You have a level of fitness and durability I do not have. For me, that wouldn't be bang for my buck. It would make me, it would be great fitness improvements, but it would be costly to me currently. So I really like it. Like from an emotional or physical standpoint? Physically. And this is what I would say, and that's why you said our answers are going to be so different because you knew I was going to go here. I didn't know you would go here, but I knew it'd be long and grindy on the road. Yeah, yeah, yeah. But I really do like it. And I also could have written your intro as mine. Okay. I believe that around that three minute rep range is like really, really, really good for threshold work because it's the same thought process as running mile or 3K pace for speed work, but doing it as 200s or 400s. Three minutes at 60 minute race pace or 40 minute race pace is just so easy that you could do a lot of reps of it, but it's too easy to overcook for most people. If you don't have a coach there or you are not super self-disciplined of not overworking, it's too easy to overwork. So I actually- Which is what I said about the thousands for myself. I sometimes just- I was in three minute reps. I'm calling them the same thing, even though most of us don't run in three minutes. Neither do I. I'm doing the same thing you're doing. I can't choose that as my best bang for the buck workout because it's too easy to screw up for, let's call it the non-professional. I have no idea what you're going to say right now. I'm very interested. I'm going to invert it. It's not 10 by three minutes, three by 10 minutes. For me, is the best threshold session I can do. 30 to 40 minutes of work is generally about, of the on portion, is generally what we target. And if you're doing the three two float for 60, you're right in that range. 30 to 40 minutes of the on work is beautiful. So for me, best bang for my buck is closer to 30 and extended intervals. And what I find is that a 10 minute interval is way easier to underwork on the front half of the workout than a three minute interval is. And so I end up spending more time in the appropriate range and zone. And it allows me to play with my stride a little bit and find what is truly efficient for me to work at. Three minute reps, they're over too quick. I'm not doing a lot of change. During a 10 minute rep, especially since I do mine slightly uphill on the treadmill, I'm watching my form the whole time, watching my heart rate the whole time, playing with my lean a little bit, playing with my arm carriage, seeing what my heart rate's doing and my perceived exertion. I just get a lot out of three by 10 minutes. And when I get more fit, it becomes three by 12 or three by 15 or four by 10. But three by 10 is my biggest bang for my buck. If I have to make it my personal best workout, it's at 10% incline, eight to 10% incline on the treadmill, but it certainly doesn't need to be. I love it. And it's not sexy at all. And that's exactly how it should be. And 10 minutes, you're right. 10 minutes is long enough where you're gonna have to sit in it. You're gonna break down a little bit the back half of those reps, especially the later rep or two. And you're gonna have to mentally engage. And you're gonna have to be conscious of how you're moving through space. Yeah. The trend here, I'm sure some people are picking up on, is that I'm choosing workouts that have a self-limiter in there for overworking. The 100 meter float in the 400s isn't necessarily best practice for getting the most out of your 400, but to me, it's best practice for not taking too much out of the first few 400s. 10 minute reps are too imposing to overwork the first one. So this turns into almost a natural cut down for me when I do it. If I'm on a treadmill, it might be like seven miles per hour, then 7.1, then 7.2, something like that, where seven I know I can do, but I still have 20 more minutes of reps. I really don't want to overcook it. So I choose best bang for my buck workouts that just seem to also have a rev limiter built in from like a mental standpoint. You didn't say rest on these. Yeah, this, honestly, I don't care a ton about rest on this. I do. 90 seconds is what I take on these. So short, very short rest. Yeah, yeah. I could lower it down to 60. I could move it up to two or three minutes if I wanted to, but 90 seems to be perfect for me in that it's short enough that, again, I don't want to overwork. What I end up doing- Just walk. Just walk. You could jog if you wanted to, but I don't see any real need to on this one. And what this ends up turning into me is I hop off the treadmill, I switch shoes, I get back on the treadmill, I mop my sweat off my face, and then I start the next rep. And it sits between 75 and like 95 seconds. Well, I think in that's, I think the key takeaway from both of our sessions, the 3-2 float, let's say, or the 5-3 float, I don't really care, and then the 10 minutes on is little to no rest, really, is the idea. Like the idea is that the rest is so, like a two-minute float isn't true rest, and a 90-second rest on a 10-minute rep, your heart rate may not even be down to recovery-type run heart rate zone by the time you have to start again. And really the limiter, the self-governing is in the your best bang for the buck tempo run. So this would be like, I can't be like, oh, my 3-2 float again because that's an interval style session in its purest form, right? Yeah. Well, this is a version that I have made 2.0 of something that you taught me. Okay. Or not that you, yeah, that I was first exposed to through you. And I've been implementing this in my last half marathon build, and then I will be implementing this style in these next nine weeks towards Grandma's full marathon. I have no idea what you're going to say. I know. Good. Okay. So it is the Kenyan tempo run. Okay. It is the Kenyan run, which you often prescribe as a midweek long run sometimes, or it's like the go out conservative and then come back faster and build as you go throughout. Except now we're threading the needle. And I've really enjoyed this style. And that is, for example, I did a 10-mile tempo run in a build where I said, Kirk, you are going to go out and run, I think it was an eight or 10. And I said, Kirk, you're going to run 545s on the way out. Nail it dead on the nuts. And then you are going to progress, but a narrow margin on the way back. I'm going to go run marathon-ish pace on the way out. And then I'm going to try to go 542, 539, 535. And I'm going to cut down on the way back. It keeps me in check early, but it's still great work. And then I still am forced to make decisions and turn over the back half. This could be a four-mile tempo run for those. It could be two miles out at pace and then progress on the way back. And it's just one, when you choose your pace and your body does it, it's a confidence booster. And two, it prevents me from going out a little harder than I should in a session, in one of those longer sessions. And three, I've never finished that and not felt productive. And heaven forbid I have a bad day and can't progress on the back half, still very productive. So basically starting at marathon pace, maybe even just a little slower, but knowing you're going to progress the back half. I've found that session really productive. Why are you smiling? Well, because this is exactly what I was going to say. Oh, it is? Yeah, I have two types that I find way more beneficial than any others. And one is the cut down. And the other is the out and back or the bring it home or whatever. But just to interject, this isn't like put on your running shoes and go out my door and start running slow recovery effort. This is I've done a warm up. I've done my dynamics. As soon as this starts, I'm getting to work. This is a big time quality day. Is that what you're talking about? One of those two. Yes. So you took that one. So I'm going to take the other one. I love the idea of a cut down tempo, basically, where you're running something that is in that range of what you want to run. But then in the back half, you've got to start chipping it down. It's a steady run into a cut down. I love it. So I'm going to do the opposite now. And that is the out and back or the bring it home run where you're going to run easy, capped at aerobic threshold on the way out or for the first X number of miles. And then you're just going to finish fast. Three miles. For me, it's three to six miles. That's my range I like to do. Sometimes it's three miles out and back, just three out easy, three back hard. Four out easy, four back hard. Five or four out, one easy back, and then three back. Whatever it is, it's very free form. But it's the idea that once you've been moving for generally at least a half hour, but not always, now you just got to start leaning into it. So yours is scripted in the step downs. Mine is free form. Get out easy, get back hard. And I find that those two style of workouts are very productive in that at your most fatigued, you're reaching for more. So you have to get your stride together. You have to recruit more to run well. And running that tempo-ish pace, and people are going to hate hearing that, but running that tempo-ish pace while you're tired is just like golden hour for running a really good clean form when you're tired. So I love it. We went right to the same spot. I didn't choose the classic 20-minute tempo, four-mile tempo, fresh, because I think it's way too easy to overwork, and I think almost everyone overworks it. So once again, it's my same theme throughout. I'm choosing workouts that self-regulate. Yeah, and what you're outlining is you're seeing this, I mean, across the board in the marathon world right now. You're seeing, we've talked about this a couple of times on recent podcasts, but now you're seeing, you know, because everybody's outlining their training on YouTube. It's kind of fun to follow along, but they're putting five to 10 miles of duress in their legs. Then they're choosing to hit about hard, like they have 10 miles of recovery-type effort. They have to switch gears, run hard for, let's say, 30 minutes. The only difference between what you're saying and they're doing is then they're putting in another 30 minutes after that back at recovery effort, right? But it's literally what you're outlining. Get mileage on your legs, get some damage, get some time under feet, start getting into those glycogen stores a little, and now force yourself to work hard. That's exactly it, and it's all the rage in the marathon training world right now. It is, and I'm just not adding that 30 minutes at the end because that's unnecessary damage for a lot of people. If I were at the point where I could handle it, that would be in there. But, I mean, there are people at home right now that I coach that are listening to this and be like, I have six miles easy plus four miles hard for this weekend's run. Yep. Because I think it's great bang for the buck. It's also really tough to switch gears. It, like, forces you to, like, you don't, by the time it's time to run hard, sometimes you don't want to. Like, you get into it, you're like, that feels bad. But guess what? When you come to race day and you don't have those six miles in your legs beforehand, it becomes so available to you. So I just, I like that session, yeah, a lot. And I find that easing into it, I find myself more efficient at that. Let's just throw numbers at it. Let's say I was running seven minutes on the way out, six minutes on the way back. If I were to go out at six-minute pace after a warm-up, I might spike right up to a certain heart rate and I might be running kind of prancy for a while and then I fatigue and my form degrades. When I go out in seven and come back in six, I am more efficient at six-minute pace. It forces me to run a smoother, less dynamic form, which is in turn more sustainable. So I think it teaches really good efficiency of motion when you're trying to do it tired. Yeah. Yeah, I agree. It forces you to run your most economical stride. Yeah, it's like tired tempo form, not fresh tempo form. Yeah, I agree with that. All right. I think it's interesting that for the last two, we chose very, very similar workouts. And these are the type of workouts that I think you could do all the time because you're just available for these kind of things. And then my last tip for this type of workout, I love having a two-part playlist. It's something chill on the way out, then it's time to get to work, and I switch into the second one, and then it's like, all right, now it's time to work a little bit. Yeah, I do that same thing. I change the music after my warm-ups or something, yeah, just to get me in the mode. Yeah, I like it. You could take like a cheater training plan. You could literally take the, let's call it six workouts we just gave you and rotate through all six of them and just like rinse and repeat, and you're probably going to be in really, really, really, really good shape. And you'll be over 90% of the way there. Yeah, for sure. All right, well, I like this game. This is a fun little game. What we should consider doing with this game, and we have to cut it here, but is we should do a trail mountain version of this game. Okay. And then I want to do the opposite. I want to do the ultimate hero workouts. That'd be fun. Maybe we should do a little series here, Bracken. Let's do it. It's our podcast. We can do what we want. I agree. Well, hey, man, I appreciate you being invested in my race, by the way, and asking. I had so many people reach out and say, can't wait for the recap on the running public, and I want to hear about it, and at least pretending to care. That makes me feel like we're doing something right here, Bracken. So thank you for people reaching out and caring. I felt like I had a bunch of coaches this weekend. All my athletes were like, go get them, man. How'd it go? And I'm like, thanks, coach. So kind of nice. So I just want to say thanks, people, reaching out and give a crap"
}