{
  "guid": "bfa591b5-680f-3d5f-9e5c-77431118eeb7",
  "title": "Episode 517: The Best WORST Bang For Your Buck Workouts",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. Whether you are a brand new runner or you already have a great mustache, we're here to help you increase your running knowledge and present it at a practical level. This is The Running Public. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. Even StreamYard's a little laggy today. It's unbelievable. It took like three seconds for that recording to start. Now you have your alibi for why you were late but weren't late today. Who was waiting in the room? You hold the key to opening the door. Sure do. Go ahead. You have like the classic post-race sickness starting. Now you say that people around you were sick, so it was going to happen either way, but how often does this happen where right after a big, hard effort, an athlete gets sick? It used to happen to me every season in college after like nationals or the last meet of the year. It was like inevitable half the team was sick. I mean, my wife got sick Monday. She woke up, felt bad. I think that's what happened this time is I think I lived with a sick person. But I do think it's very often our body finally has a chance to go and like actually take care of itself when you have some downtime after a big effort, and I think that is a very common thing. Is that something that you experience? Yeah, for sure. And I believe that we only have so many fixers in our body. This is a scientific term. All the little things that are responsible for fixing the things that are wrong internally. There's only so many of them. And when they're already working behind the scenes to keep sickness under control and you throw a massive effort at them, they have to be diverted. It's a triage center. And they can't handle both at once. And I believe that oftentimes you either make yourself more susceptible or something you were kind of you're fighting a battle on two fronts. Suddenly one front wins and you get sick after a big race. Yeah, I think it's I don't think it's like you're going to get the flu or you're going to get like whatever no matter what. But it's those like periphery sicknesses like some random cold virus or your allergies suck way more than they should have. It's like that. I think like if you're going to get smacked with something big, I think it's going to hit you. But it's this all this like tertiary annoying sore throat gunk that stuff creeps in. Yes. Yeah. Are you feeling good? Yeah, feeling good. Good. Because you guys at your house were like wrecked for like a month straight. Yeah. And last week when we got the week after getting back from overseas, I got sick, but it was 24 hours. 36 really like the hangover day. Half day was I was no longer expelling everything from my body, but I just didn't feel good. I was achy everywhere, but it was done. I thought, oh, this is going to kick it back off again. And to date, no one else has gotten really sick. So we're good. Sweet. I was my wife and I were talking in close quarters on the couch. I think it was two. We're recording on Thursday. I think it was Tuesday. And behind her is like the window and the sun was coming in. It was in the evening. The sun was coming down, but she was like profiled by like the outside as she was talking. And I could see these like little droplets of spit, you know, like you would never notice them other than that happens every time we talk. Anybody talks, right? There's a little bit of stuff coming out. That's why we get sick. We transfer it. And it was like directly coming at my face. And I was like, there's probably I can literally see this entering my body right now. I think I'm going to be getting this. And then sure enough, you watched yourself get sick. I watched the spit from a sickie enter my body, I think, really. So, yeah, it happens. Very good. Anyways, go ahead again. All right. So we're going to pivot a bit here. I obviously have talked about that. I'm going to do a few mile races this year and then actually started working with someone nearby to me who's going to run some of the same mile races. And then there's someone else I'm working with that wants to PR a mile right now. It just kind of seems to be that a few people are in the stage of life to go try something shorter and faster. I think we all probably share the same thing of like that unsaid part, which is before it leaves, we're all kind of getting to the point where we're not young enough to ever dream of running fast as fast as we used to ever again. So let's just get one more before we move on. That's a depressing statement, but it's not. That's just reality. Anyway, I was looking up a few sharpening workouts and a few middle distance Google searches. And I came across advice on how to run the 800 meters and the mile slash 1500 from a website. And I wanted to read this to you. Okay. Okay. Can you tell me what is it, a credible website? I don't want to say anything. I just want to read it to you and I want your raw reaction. Okay. Start with the 800 meters. This is the event I ran probably 75% of the time in college and you probably ran, what, 10% of the time? Just a handful of times, yeah. Okay. A great way to run the 800 meters is to run the first 200 meters conservatively followed by running an almost all-out 400 meters from 200 to 600 and then finish with what is left. Many 800 meter runners go out too fast and when they reach the 400 meter mark, they think, I am hurting and only halfway. And that ruins the rest of the race. They concentrate on running a fast 400 from 200 meters to 600 meters. They fly right past the 400 meter, not worrying about being only halfway. They now are thinking about getting to the 600 and the final 200 meters is usually not so mentally stressful. So go out slow, run almost all-out 400 meters from 200 to 600 and then the last 200 is not so stressful because you're almost done. I think it's really good advice. Really? I do. Yeah. You think it's terrible? I don't like the term almost all-out. No, see, I just, well, how did you race the 800? Because I raced, I never got out on purpose. Like I couldn't get out. So for me, I mean, championship racing is a different stuff, but how to run your best 800 time-wise, I don't know. I don't know. I like the advice. I do. You hate it. You must hate it. I do. I can't stand it. I think that they identified the correct problem, which is almost everyone gets out too fast. Correct. But that's what I am stuck on. Terrible solution. Really? No, I disagree. Just run almost all-out from 200 to 600 and the last 200 just won't be that challenging mentally. I think anyone who's ever tied up in a race knows how impossibly long the final 200 meters of a race can be if you were tying up. And that is how you tie up in a race, is to run way too hard from 200 to 600. What about if you were to look at your 400-meter segments, 0 to 400, 100 to 500, 200 to 600, 300 to 700, and 400 to 800. Do you think if you just looked at all of that and said, I see their middle 400 being the fastest, would that tell you anything? Would you be like, okay. Because you wouldn't care if they couldn't finish. Correct. The 800 meters is all about who decelerates the least the final 200 meters. That is very true. Especially the final 150. See, I still kind of like it. It depends who your audience is. I honestly don't even care about it. This might be our biggest disagreement ever. If you're talking to somebody, a freshman in high school, who's never run the 800 before, I like the advice, except I don't like the all-out part. Which is the crux of the whole thing. Well, I know, but pressing in the middle and just practicing self-restraint the first 200, I very much agree with. But here's my issue. Hey, I like this discussion because I don't think you're wrong either. So I'm happy to be rebutted because I could soften my take, but I like it. And does a general slap it on statement. I don't think the best advice would be like, hey, what you're going to do is you're going to positive split the shit out of this thing, Kerry. I want you ripping out like a beast and then fading home, but hopefully you fade just a little less than everybody else. See, that's like terrible. I think that's poor advice. In the 400, sure. Anyways, go ahead. The thing we agree on is that you can't tell someone to run nearly all out from 200 to 600. You're tempering it with your own experience and knowledge and know-how of how to race. We're not actually going to do that, but I do think we shouldn't get out too hard. That's great advice. Yes, that's the pillar of why I like it, what you just said, correct? But they only have three pillars. Don't get out too hard, run almost all out the next 400, and then the final 200 won't be so challenging. It would be like you're running downhill. The third one is wrong. If you run from 2 to 6 very hard, the final 200 is going to be so challenging. Do you want to know my fastest 800 from high school, which I ran 158.0? Okay. I went 61.57. Yeah. Which is not a normal PR split, by the way, but it was at the state qualifiers and we went out slow and we were forced to kick. I even fell short then, but I'm making the finals, but nonetheless. Well, I do know that the 800 meter is a race that you are intended to positive split, meaning you run the second lap slower than your first, not due to effort. It's the longest distance in which I think any world record or anything was set with a positive split, right? You see it in them and shorter, something along those lines. You can run a good 800 meters by going out slow and finishing fast, but the problem is pressing from 200 meters to 600 meters is the costliest stretch of the race. You even see people chill through 400 and surge through the next 200 meters all the way to 600, and then they tie up the final 100. You cannot be pressing down the home stretch of lap one or your races are already done. And this right here, if you tell someone to accelerate from 2 to 6, where are they going to accelerate the most? It's going to be from 2 to 4 because they have a gear to change, and that is the most costly part of the entire race to accelerate through. You've burned through your phosphocreatine bonds already. Free speed is gone. The effort is just starting to settle into you, and now you are making a concerted acceleration. I think it's a recipe for blow up. However, this highlights the point of what I wanted to talk about. Do you see I'm kind of like sheepishly smiling over here? I'm fired up and you don't care. No, I don't actually. But that's not why I'm smiling. I'm smiling because there's probably only like one person listening to this podcast right now who even gives a shit about the 800. The rest are just waiting for us to get to whatever's next, and we're focused on this 800 meters, which nobody listening is ever going to run ever again. And it's a worthwhile conversation. It's just funny to me that we're talking about it. And I know there's like no, there's one guy being like, yeah, Brackett, freaking yeah, man. And everybody else is like, come on, guys, move on. My point is not to talk about the 800. It's to use it as an example for how we consume information online. Hey, you didn't read the 1500 or mile advice. No, we'll get to that second. Okay. So the point here is that we have two people who ran this distance in college, and we didn't agree on this advice. And one of us was laissez-faire about it, and the other one hates it. And the reason I want to bring this up is not because I think anyone cares about the 800. It's because I found this on a reputable website. Well, okay. Do you know who wrote this article? Is it a website that you'll say and I'll know? Or is it an author specifically? Both. This was written by Dr. Jack Daniels. Maybe the most prolifically read. No, it's on his website. Okay. Okay. So maybe the most prolifically read and consumed coach author of our lifetime in the sport of running. And I read this and thought, and I had a viscerally negative reaction to it. So I'm not saying he's wrong. I'm saying I wholeheartedly disagree with writing that down and putting it out for public consumption because people are going to read exactly what you tell them most of the time, and they're going to get it wrong much of the time, but they are going to read almost all out from 2 to 6, and that's what they're going to trust. Whereas you brilliantly demonstrated that you have to read it, interpret it, and apply it correctly. That does not happen on the internet most of the time. And so if we go, this isn't me calling out Dr. Jack Daniels because I've guaranteed he has scientific evidence for why he said that. We should call him up. No, we should. Get him on the line, Jack. My point here is that if you put something online, people are going to find it. And if they do not have the lens that you have of having raced this at the NCAA level, they're going to either believe it or not believe it with no real perspective as to why. And most of the time, they're going to believe it and they're going to trust it and they're going to execute it and probably tell their friends about it. So not that the 800 matters to any of our listeners, but the idea that anything you read online about racing, training, strategy, fueling, it all has to be acknowledged that it came from a fallible source, no matter how infallible they may seem. I just want to make this little PSA here because I read this and thought, what? I would never do this. But this is the most famous coach of our time saying it. And so there has to be people doing it. And some people succeeding with it, which means I can be wrong as well about this being a bad choice. And Bracken consumes all of the social media, internet content out there. So you got a big subject study. Not social media, but internet content as much as possible. Internet content. I think it's good that you're bringing this up because it's funny. I just saw something. It was like letsrun.com or flow track or all track. Was it all track access? Where it was like how to run your best mile. Did you see this post recently? No. How to run your best 5K. Let me see here. I was looking away when you were chatting and it probably seemed rude, but I was trying to find this post. I cannot. And it was a spoof about somebody running fast. And it basically told you to run like how to break four in the mile. And you want to go out in 66 because you don't want to go out too hot. But then you want to run your next two laps at 56 seconds each. And then you want to close about 62 because you'll be tired. And voila, you'll run your four flat. Which was it was a parody post. It might have been from the 1st of April. I don't remember. And the people that took that for value. You mean I'm supposed to run a 152 800? That's my middle 800 to this thing. And like the threads and the people were just eating it up. And it was not a real post. It was just to provoke. So I just read it like two days ago. It got fed to me after the fact. So there's a lot of people who don't know enough to know enough. Exactly. Yeah. All right. So I'm going to move to your bread and butter from college, which is the 1500 meters slash the mile. Is this still good old Jack's opinion? This is the next paragraph. Okay. All right. Now I ran probably 10 of these in college. I should have run this instead of the 800. I just wasn't fast enough. But it doesn't matter. I ran enough to know what worked for me and others. You ran a lot of these. So I'm going to pose this again to you. Again, I'm going to read the intro because I think he's right. You know what? And I had somebody ask me this the other day, an older woman. Older woman, meaning older than me. Didn't know. How far is the 1500 then? It doesn't work in my brain. What is the 1500? Just think it's like a mile. It's the mile for all intents and purposes. It's just shorter. It's a straightaway shorter. So it's a mile. A full, complete mile, 1609 and three quarters meters. This is 1500. So 900 and a half. It's a football field with the end zone short of a mile. And there'd be a few people that it doesn't click for them if they never ran track. So go ahead. Yeah. Now. Okay. Most younger and even many older runners go out too fast the first 400 meters of a 1500 or mile, followed by a rather major slowing down over the second 400 meters. Interestingly, most runners run the third 400 meter about equal to the second, both of which are rather slow compared to the first, and then try to finish with a faster final 400 or final 200. To maintain a better overall pace, try to run the first 400 meters at a pace that, if evenly paced, would be a second or two slower than your current best mile pace. Then make a concerted effort for the second 400 meters to be two or three seconds faster than the first. Interestingly, the third still tends to duplicate the second. So now you have two good 400s back to back after a reasonable first four, rather than a couple of poor after a too fast first 400 meters. Now there's just 400 meters to go, and you can just do what you can with that. Is he taking, like studies for this. Like if this is based on like athlete splits and data, if this is what his findings are, or if this is just like your opinion based. This is no context, me reacting to his article. I've never run one of my fast 1500s that way. Nope. We'll get out fast on pace or a hair faster. I think that's still necessary in the 1500. You're going to settle in and maybe you stick to that same pace for your next quarter, best case scenario. We're probably going to back off maybe even just a second that next lap. But a second is a second. It starts to hurt. You have to very much remind yourself that it's a short race in quotes, mentally engage. If you're lucky, you run the same time for your third lap as your second, but oftentimes it still slips again. And then you kick home and potentially your fastest lap of the race if you've paced it well. But I still find like if I were to label my laps, last lap would be the fastest. First lap would be the second fastest. Second lap would be the third fastest and your third lap would be the slowest, we'll call it. So I haven't raced negative splitting a mile, true negative splits, nearly impossible. I've once. I mean, like notably negative splitting it without just talking tenths or half seconds. But I don't know if I agree with that. I actually, it's so funny. Maybe it's lack of knowledge because I don't know the 800 as intimately as you, but I know the 1500 more intimately. And this advice, I don't know if I would go with. You got to get out. I got to be set up. I can't be behind from 400 meters. So what do you think? Well, I don't, I think again, he identifies a great problem. People get out too fast in a mile. That's the problem he's identifying with both of the races. Which is correct. You could say that about almost any race on earth. But I do not believe the third is paired to the second, no matter how you run it. If you make a concerted effort to go two to three seconds faster on your second lap, your third doesn't just follow suit. You start to suffer during the third. The third lap of a mile is, in my opinion, kind of miserable no matter how you run it. So it doesn't just like, you don't just flow and hold your pace in the third no matter what you've done in the second. I find that not to be true. Yeah. Even if you run a bad mile, meaning less than your potential, notably less, the effort is intense enough where whether you're having a great race or a poor race, somewhere between six and 800 meters already, you go, oh shoot, this hurts already. And you still have at least half your race to go. And I find I could be five seconds ahead at the eight or five seconds behind at the eight, and I'm still in the same ballpark of suck. Yeah. You don't know what you're getting in the mile until the last, I feel like 600 meters. You're like, it's there today, thankfully, and I have control over what my body's giving me, or now I'm just hanging on. Yeah. Is how I felt. Yeah, and I think it's like with 300 to go, if you're in it, there's a ramp up for sure. And that's when you find out what happens because you're going to feel kind of good or kind of crappy, but like crappy good. Like it's going to be a mix of both if you're relaxed and under control, and you're going to just feel crappy if you're not relaxed and under control. Like you said, you've run 1,200 meters at just above or under mile pace. Even if you're four or five seconds slow than what you should be, that's still 1,200 meters at just slower than mile pace, which is a big ask of your body. You can't feel good through that. Where I think people need to start pressing in the mile is about 600 in, meaning you're going to get out hot. That first 400 is going to feel free-ish, right? Free, not nearly as costly. And you're going to start to get to the back half of that second lap, and you're going to start to realize, oh my, I'm starting to breathe heavy. My legs are already kind of feeling like they're filling up. And right there is that conscious decision to just lean into it still instead of like, whoa, whoa, whoa, back off. I'm going to get burnt. And then, oh, I gave my camera a signal. I think from 600 meters on is where that race needs to, the middle part of your race needs to be consciously made. Yes, I agree. But yeah. We lived with middle distance runners and milers, and we had these conversations. We watched hundreds of these races happen. And I never knew one person who just chained their second and third laps together effortlessly. Faster than their first lap in particular, yeah. Even if they look clean, they are making deals with themselves in the middle of that third lap. So anyway, again, I don't think it's great advice. And I'm sure he has very specific reasons for why he gave that advice based on case studies or however many. And again, he's talking to younger runners, which might mean, and I don't know if he's talking to them, but he identifies them in his intro, which is younger runners tend to blank. So maybe this is a blanket advice that keeps people honest. But I think that first and last laps are almost always your fastest. I negative split one mile in my life. It was the indoor conference championship. It was a tactical race. And we went out fairly slow. Not that times matter, but to put it in perspective, I ran 418 in that indoor mile, and we went through the 800 at like 210, 212. So I either went 210, 208, or I went 212, 206 for my two 800s. And the last lap then was like 60. So there was a significant ramp up in pace, and that was the slowest I ever went through the halfway point. And my third lap still felt really uncomfortable. So you just can't get through that. I just don't believe they're chained together, and this gives that kind of false hope, which then when you get to lap three and you thought, well, my lap three will just be like my lap two, and you feel it, you're like, this sucks. You don't want to be surprised by that. So again, just an example here where he's not inherently wrong. I just don't agree with it. And this is the most famous running coach putting this out on a website, and people will read that as gospel. So a reminder that when you read runners say, here's the workout I do for sharpening, and it's the best, and here's why, or this is the training plan that's the best, and here's why, you have to be able to justify it yourself when you read it, if it really makes sense or not. What do you got against Jack? Nothing, nothing whatsoever. I own two of his books. He was the first legitimate running book I ever bought. I still refer back to a lot of his stuff. I disagree with a lot of his stuff, but he would disagree with a lot of my stuff. That's okay. Just the fact that I don't think I could refer someone to a more reputable source for the masses than Dr. Jack Daniels. Yeah, I think if you were sitting there and you had a group of sixth graders in front of you, 12-year-olds, let's call them, and they had never run track before, of course they played in their young life, and it's like, you're about to run your first 800 or your first mile, the overwhelming sentiment I'd want to get across is let's not try too hard too early in this thing. Yes. So I think the more novice you are, having somebody press lap two and three in a mile is going to be a death sentence if they're new to it, but I think you're right. I think this applies more to very green athletes at these distances more than anything. And I'm wondering if you told a 12-year-old with no predisposition regarding this distance or never having felt it out if the easy 200, hard 400, and hang on might get them close at a first crack. I don't know. Yep. But I would say to the tenured athlete, I don't agree with this from that lens. And that's exactly it. The title is Jack Daniels on a race strategy for 800 and 1500 slash mile. If this said how to run your first 800 or 1500 slash mile, I would say, you know, if this is going to set you up for a better chance at success than most strategies. I still like his 800 meters advice because it's my own personal lens. Like I often had too much left of a kick. I was just kicking people down, kicking people down, never being out kicked. And I was like, well, maybe I could have pressed a little earlier and actually got some more time chipped away on my own personal belt. But it's interesting to bring up though. Just, I mean, this is actually, I didn't know you were going here. You didn't tell me we were going to talk about this. I didn't know Jack Daniels is an idiot. Someone's going to hear that and not be looking at you and know you and think that you're being serious. He's not an idiot. We would be lucky to have a 10th of the career that Jack Daniels has had. And I respect him immensely. So please don't get it twisted what I'm saying. My only point here, even though I disagreed and argued with you about his stuff, is that nothing we read about running is guaranteed 100% true, what you just said. Which brings us to our topic today, which is not going to be 100% true for anyone. This is very much experiential based. On Tuesday, we talked about the best bang for your buck workouts. And we prefaced it by saying, this is opinion. This is our opinion right here in this moment. We believe these workouts are really, really good bang for your buck. They'll give you good return for not maximal input. And you can recover well from these and you can repeat these a lot. And they're just very, not easy, but easy-ish to execute and repeat. Today is another opinion based, but it's very experiential based. And it is, these are the biggest cost workouts we have done in our lives. And they didn't all go great. Some of them did. But there's no guarantee on what kind of return you get on this investment other than that it changes you afterwards. Sometimes for the better. Hopefully for the better. But these are workouts that we have done. And I suppose we could also talk about workouts we gave others that are just hero workouts. It's the opposite of Tuesday. We are intending to turn ourselves inside out with the knowledge that it's going to burn us to the ground. And that hopefully we rise up from those ashes afterwards better than we were prior. But that it might take a long time for us to reap that reward. So DNA changing sessions to the point where it is going to snub you for days, if not weeks afterwards. With the potential for it to make you better eventually. But things that you can't repeat week in and week out. Correct. Is that what I'm getting at? Yes. And there's no guarantee on what sort of return you get on your investment in these kind of workouts. Because it's so subjective in how you turn yourself inside out that it's really hard to say what you're going to get out of it or what the cost is going to be. These are the type of workouts that are the sexiest thing to post online and the easiest thing to disagree with. Because it's kind of a wing and a prayer with some of these. Okay. I'm assuming this came to mind because you have some things that came to mind in regards to this. That you're mowing over yourself or maybe considering doing in your training. Not currently. But it's the things I always want to do. These are, whenever we talk about a topic, it's hard not to think about the opposite side of the coin. And talking about easy, repeatable workouts always makes me think about, but what are not easy and repeatable? You asked about some of the workouts we did in college and I talked about that one where we went 1,000, 8, 600 meters, 4, 4, 2, 2, 2, 2. All with relatively lowish rest. Took like 5 to 10 minutes recovery and then raced an all-out 800 essentially. That is a big workout. That was a costly workout. But then a week or so later I was feeling like, what could you possibly do to me in a race? I haven't done to myself. So when I talked to you about that one, I started thinking about other things I've done. And you've talked about these. In the past we've talked about sometimes you just got to swing the hammer big. So do you want to start with workouts? Like sessions that we... I have two that have come to mind immediately. Yeah, start with one. All right. Because I look back and I think, God, some of these stick out in my mind for years. Like this was the number when I did that. Almost like it took a race type of effort to hit it, correct? And races can be costly but also beneficial depending on where you're at with your training and racing and all that. All right. The one I want to say I'm going to save for a second. The one that came to mind first. So I'll leave that one because I talked about it recently on the podcast. Okay. Is anything that includes quality, by quality I mean hard, purposeful bouts of running, where that said run lasts anywhere beyond two and a half hours. Okay. What do I mean by that? Clarify for us. So you have an ultra coming up. It's in six weeks. It's in four weeks. You decide that it is time to go not only do a long run of three hours, but to go three by 20 minutes in the middle of that thing at threshold or some sort of pressing on terrain. And so you get into your run. You now add a quality component to an already damaging session of three hours on foot. And you start to get into like race feel territory just with let's call it metabolic damage and structural damage. And so I go and I run my first 30 minutes relatively easy. I do three by 20 minutes with a five-minute recovery. And then I run the last hour just tired on dead legs and get to three hours. Those sessions are very helpful and can be very important and can help you feel what the back half of an ultra may feel like or even like a three-hour race. But I find if I'm trying to combine the two, even this can apply for over 90 minutes, certainly over two hours I felt this. But when you get into that two and a half hour range or more, I find like it might be 10 days before I'm operating okay again. And so a long effort combined with notable quality work can get me. And so that would be a hero workout. Maybe I need to feel it a month out from a race and that's okay. But it's that session, what's one that comes right to mind. Okay. Do you have an example of one of these that sticks out to you? Like an exact session? An exact session that you've done that changed you? Yeah. Yeah, in hindsight, yes. At the moment that wasn't my intent. But we've actually, we've done this. And I think it's part of why I had a poor race in Tahoe. I also got very sick the week of the race and was on meds. I felt real bad. But you and I got together at Five Fingers with Mike Ferguson and a group. And it was... John Penland, probably? Yeah, and there was a couple other guys. Dan Sanders? Yeah, Dan Sanders is there. I don't want to forget anybody. But point being, and it was a great session. And I felt good and I ran hard. And we ended up doing a warm-up and then a 30-minute, give or take, tempo up and down the hill. And then we finished with heavy carries and then time on feet. And if you remember, I went extra. Everybody was done and I went out and kept running afterwards. And I don't think I had a good session after... Was that two weeks out? I don't know. But all I know is I felt like shit the next two weeks. We had a terrible World Champs. I mean, I ran okay, but I felt awful doing it. I've done it again. I was sick. And that was one of those that it's like, yeah, if you do the math... And we were trying to workhorse each other. I was trying to leave Mike on the carries and be a hero and run down the hill hard with the bucket. And I think I went 245 that day, 250. Could have been almost three, yeah. Almost three. I remember picking up a sandbag to just add an extra time because you were still going. Yeah. And I was dying. And it was so wonderful. But I think I maybe left my race that day. But I did get really, really sick. So, again, who knows? But it's an example like that. And I have a handful of the OCR-style sessions that did that to me. We went to Highland one day, and it was a great workout. We came up with hill rep repeats that were like 1,200 meters, and we did those by how many and then did some all-outs up some hills and da-da-da. And I just think once you get out there, it's like some sort of CNS also structural thing that, okay, you're depleted and you kept working, and now you're going to pay for it. So does that make sense? You following? Yeah, it does. So that workout that day, if I'm remembering correctly, is we did our warm-up run and got all of the sandbags and buckets out to the base of the hill for the second part. And it's like a 200- to 300-meter carry to get it out for each one of them. And then we did the five-finger death punch loop, which is all five ski runs up, loop back down around the service road, and do them all. I think I ran like 27 to 29 minutes. It was a time trial. It was around a 30, yeah. If I'm being honest, it was a time trial. Yeah, our goal was to do it for time. And then we finished with that, and then we did Mount Majestic from that point on. But we did it up and down a hill once or twice, up and down the steep stuff, and then carry a quarter of the way up and down. And we just repeated that for the next, like, two hours. Yeah. It's a big day. Yeah. Yes, and if that session were cut, if you did five-finger death punch Then I'll ska band, alternative band, right? Five Finger Death Punch. Not ska, I think it was... Heavy metal? From my perspective, it was pretty hard rock back in the day. I never listened, but Five Finger Death Punch, and then maybe it's like, hey, let's do a 20-minute carry finisher with a cool down, and now we're at 90 minutes for the day. I think he would have survived in advanced, but the need to do it all. And that could be a pure form of... I've assigned 60-minute tempos in the middle of a quality session, but it might be 15 on the front end and 15 on the back end for cool down and warm up. It's a 90-minute session, very demanding on the trails, but something about extending that out further with even just additional time on feet. I think that was three weeks before Tahoe, but looking back, maybe that's like a six-week out or a four-week out type of thing. It was great work. In fact, I remember feeling great about myself, but the caveat, the asterisk is I got sick, so that muddies the waters incredibly. But I think you're getting the point across is if you grind and you work hard and the session extends two and a half or beyond, for me it's the two and a half, it takes me a while, brother. It just does. And that was seven years ago, eight years ago. This isn't like I'm getting older and that's why. This was like 36-year-old Kirk. Yeah. 35-year-old Kirk. It's just they're damaging. Yeah. So that's my first one I want to start with. Yeah, and it's not like a Tuesday quality session, but it's something we would do, especially training for mountain OCR races, and I think the ultra realm could definitely fall victim to that sort of duration with quality in it. Well, that leads me to what I wanted to talk about first, and it was OCR and ultra led me to this. So this takes place in 2019. I had already coming off my first break from the sport and decided to do a quote-unquote little comeback, so I decided to do a stadium race in the spring, and then I wanted to do the Tahoe Ultra that fall and just get an ultra. I was starting to get the call for the ultra, but I knew I wasn't going to be fit enough and sharp enough to race the world championship, what, 15-mile race the day before, so I decided to do the ultra. And then if that goes well, then the next year I'm back. This is 2019? 2019. So this is in the end of the first third of my build. So I had the full spring build and then summer and then fall prep. So this is at the end of spring. I mean, it's technically summer, I think, but on Saturday, June 22nd, I raced the AT&T Stadium Sprint down in Dallas, Anaheim, Texas. And that was, according to GPS, which is hard to track, it was a 3.91-mile Spartan race. Was that the sprint off with Kempson? No, that would have been at Citi Field, and that would have been a year after. No, because that would have been COVID. A year prior then. Maybe it was that same year. Okay, anyways. Now I don't know. Anyway, so I did that race on Saturday, flew back home Saturday night, and the next morning went out to the Kettle Moraine and did a long run. Cheekily titled post-race shakeout. And I went 17.81 miles, and I cut down. I did two nine-mile loops, essentially. I did a nine-mile loop one way and then turned around and ran it back and negative split it. So that is a big weekend of work for me. With the concept of I'm training for an ultra, I got good work in Saturday. I'm a two-day after Dom's guy. I'm going to be rocked from this race either way, but I have an ultra coming. I'm going to get out on the soft trails, but they have vert to them, and I'm going to work for 18 miles. And the last six of that, I got into this state of running where I had been really tired by 11, and then I started pressing a little bit, and I kind of came alive and got into this really tired, rhythmic stride that you can get when you're in good shape, but you're tired, but you can keep it together. And I was just running down these trails feeling like I am fit. The training is working. I'm hurting. I'm not running that fast, but I'm working well right now. And every single stride I'm taking here is worth like three strides, three normal strides. It's just I knew I was in that zone where everything I'm doing is affecting me big time. And I was pretty rocked the next week. But that was June 22nd and June 23rd, and then June 28th, I paced Benny for a time trial. I remember that, yeah. And then I did some 30-30 climbs the next day and hard descents. And then one week later ran a 425 road mile. So I wasn't doing any of that sort of work, but this was one of those workouts where I could just feel myself recruiting so much of my body to try to stay on track with my stride that I was so tired that during the mile I felt like I was doing the same thing. And then a week after that I ran my first trail 50K. Okay. And it went for me very well. I ran a 413 with several – I think 4,000 feet of vert, which for me was a very good first attempt at that distance. So all of it dates back to that weekend, I believe. I believe that's when my fitness really popped. But it took a week and a half to come back from that effort until I felt like I could do anything again. And then when I did, everything was there. I could run hard for a mile if I wanted to. I could grind for a full 50K and negative split. And I negative split up until I think mile 29. There was a mile with 440 feet of vert, and it just took my soul. But up until that point I was running hard. But it all kind of gelled once I recovered from that big Saturday race, Sunday quality long run weekend. So you're outlining – and how long was that quality long run? Did that take you over two hours, I assume? It was on trail, so it had to have been. Let's see. Just for context, I think it's important. Yeah. Two hours and 18 minutes. Yeah, so just to simplify it, you're saying – I mean, you swing all – you race, so let's call it a near all-out. Yeah, I raced all out. Right, you ran hard. So you got 30 minutes of like race effort work in, and then you went and did a drawn-out threshold session, probably a good portion of what you did that next day intermixed in a long run. 90s and nine cut down. It hit you hard, and you took damage, and you were compromised for a bit. Yeah. But it paid off. This is an example where you're saying like it was a hero workout. It was a big two days. I paid the piper for a bit, but it came around when I needed it to. It was a good execution. Yeah. So the next day I got up and I did a shakeout – oh, not even got up. I ran at 4 p.m. the next day with Lisa, and we ran four miles easy in 33 minutes. So over eight minutes per mile. I took the next day off entirely of running. I did 10 at nine-minute pace on a pancake-flat soft trail the day after that. Ran one mile the next day after that. So you took it really – you let it soak in. Yep. Then I did a 10-mile run, again, at nine – 10.4 miles in an hour 37, so over a nine-minute pace. And then I did a hill workout and then a six-mile easy run. So you didn't do anything of quality for like six days, five days. Yeah. Yeah, it took an entire week before I could even contemplate running another quality. And then four days after that quality, I ran a one-mile road race. So it was like 10 or 11 days after that where I started to feel like, ooh, I have something in my legs. But up until that day, I don't think I'd spent a single day feeling good. Yeah, I think it's a very viable – I mean, a common thing in the road space, which I've actually done a good bit here lately this winter, is you have your Tuesday quality session, you have your Friday quality session, and you follow up a Friday quality session with a Saturday long run. Traditionally, that long run should be a low to moderate effort, and you just go put miles in without any other purpose than time on feet, right? Let it come to you, but don't work too hard. The next level to that would be I'm going to do my Friday quality session, and then if available to me, I'm going to run hard again on Saturday for my long run, in a sense. You're outlining a typical pro-level week, but you're choosing to run hard again the day after, in quotes, quality day. Yeah, and I think the key here is that I did that one time in that entire training block. It's a very powerful weekend. It is in no way, shape, or form a repeat repeatable or sustainable weekend. Yeah, and I would argue that it's probably more damaging than back-to-back long runs, meaning let's say you went out and did 90 minutes to two hours on Friday and then you went out and did two hours on Saturday. Still a big weekend, don't get me wrong, but most approach those with caution, meaning I'm going to take it pretty easy on Friday, like I'm going to jog my first one and my second one will take what I have. But something about pegging a zone four, zone five heart rate in a race the day before a big time, like that amped up intensity far surpasses just duration of back-to-back long run stimulus in my opinion. So like you had a hero workout already on a Friday, it was a race, that better be a hero effort, and then followed it up with another one. I've done this, so a current training cycle that I did in this build to my trail race and all winter was a Tuesday flat session, a Friday incline trainer session, and then a Saturday long run. I've been on that script. And there's a couple times where I just needed to run hard on a Saturday following my Friday incline session. Now, very little damage because it's uphill running, but tired legs, but I've actually had some really good runs on a Saturday following a Friday uphill session. Suddenly I'm going and I ran one of my runs, I ran like 16 miles at like 540 and change pace, one of my big long runs. And then I'll tell you what happened after that, I didn't really come around until the end of the following week. But I think those actually really were helpful. Like you could say in the short term idiocracy, and I agree, like it wasn't the smartest short term move, but given the appropriate time afterwards, could be a really propelling move. So I experimented with that a little bit and I think there's some benefit, but you just have to understand on the back end of it comes the depression of bad legs and all of a sudden feeling like you have no fitness. And why do I feel like crap four days in a row and those sort of things. Yeah, because if I was following myself on Strava and I saw this pop up, I'd think, oh man, this person is heading for something. For sure. And whatever happened in the race, I would say, yep, and that's why. Because if I ran this 50K a few weeks later and this one mile road race and tanked or got through one of them and then not the second, I'd be like, yeah, that's why. And if I popped and ran great, I'd be like, yeah, and that's why. Because you survived that type of thing and recouped from it and you are better for it. But you don't survive it. And yeah, that was dumb to do. So this is the kind of thing that you can't even take at face value. And it must be scheduled few and far between. How often would you recommend that to an athlete that weekend if you were coaching them? At most once every four weeks, but probably more spread out than that. Yeah. Yeah, and I think that's the main takeaway from a lot of these. Yeah, and I would say if you have a long tenure ship in running and endurance training and beating the shit out of yourself, you could almost use it as your last big swing three weeks out, but it might want to be four weeks out. And then, yeah. My saving grace is that I had way more fatigue than I had damage coming into that workout. I had flown the night before. That's never easy on the body. I had raced four. I looked it up as a 40-minute stadium race. That's a long time to suffer. But it's also a stadium race. Two-thirds of the time are spent going up and down stairs. So while you get a lot of fatigue, you're not taking crazy amounts of damage. Downstairs can create damage, but I had been doing stair work. So I wasn't in a place to get injured in theory. I was in a place just to get very tired, and I did. But it wasn't as risky as if I had run a road 15K and then gone out to do this. Yeah, I agree with you. Yeah, you were moving sort of dynamically and animalistically in the stadium race. Of course, there was a biomechanically typical run component, but it was very different. Yeah, very much so. Yeah, the most sore my calves have ever been in my entire life was after my first stadium race at Green Bay. Yeah, something about going down the concrete steps at race effort. I was sore for almost a full week in my calves in a way I'd never been before. And we were running vert, and we were doing – I was training what I thought appropriately, and that still smoked my calves. Well, and if you think about when we first entered the stadium that day, we'll test our race recall here because this was years ago. But when we did something – what did you say? 2017. 2017. Okay, so that would have been – I think that was the year that they came to battle. That doesn't matter. When we first came out of the concourse, we did like hand-release push-ups and then took off down into the stadium, and we had those wide short-drop stairs. And so you could actually open up down them, but it is entire breaking every time you hit the ground because you can't lean forward into it. And so it's the worst mechanics you can use as a runner is you're literally breaking yourself almost to a halt but then propelling forward on every stride. So there's a massive breaking effect happening, and that's really hard on you. Yeah, we went around the first corner, and they had like the bear crawl under bungees immediately, and you were already 50 meters ahead, and I didn't even see the bungees, and I clotheslined myself. Oh, you did? Oh, yeah. I was wearing a hat. I don't know. Or my bandana flew off, and everybody went by me. I literally was like that. It hit me right in the face, and I fell backwards and then was like, oh, that's a bad start. That's not a good start. Didn't look at the race map close enough to know that was right around the hairpin blind turn. Indoor black shock cord. Not great. It got me good. Yeah, and you were right. It was hand-release push-ups and that stupid heavy jump rope, and then we went into some carries pretty quick. Anyways, I digress. Should we go to another one? Yeah, you said you had two that came to mind. Let's go to that second one. Well, one is sort of on riding the coattails of yours, and I'm going to call it the training camp week like I had out in Monterey. We're going to touch on it, but I'm going to use a different one first. Okay. Next time I have two more, but we'll touch on the training camp, which is like a whole thing in itself. Like this is my week to blast myself, is anything. This more goes for us in the Midwest, I feel like, and maybe those in the mountains because you deal with winter. Your first big descending session with purpose. If you are training and today is the first day I'm stacking vert, but not only am I stacking vert going up, I'm getting myself ready for damage going down. And maybe it is in the long run. Maybe it's a shoots and ladders up and down at perceived race effort workout or whatever it is, but anytime you descend with purpose and that's a focus of your session, I'm running at race effort downhill, which is vital if you're going to race well in the mountains or on hilly terrain. I'm talking 10 days, man. Like let's say it's a no downhill left behind long run for me, which I did out in Monterey on one of the days, and I'm just below race effort on all descents. I'm running up within myself, and anytime I go downhill, I'm pressing. The damage that causes just structurally here, my heart rate might not even be that high towards the tail end of some of these descents, depending on your skill level going downhill, but the quads, the hips in particular on me, done. And I can feel even no soreness anymore four or five days later. It's all supposedly left my body, and I'll be real sore from that session. Even better, like you and I did, if I can find a nice concrete hill where I'm smashing like as hard as I can, it's so good for creating damage and adaptation. Five days later, you can have all the soreness is gone, I'm ready, and you go to run anything with turnover, and it's like the worst workout you've ever had in your life still. And I'm talking like 10 to two weeks, 10 days or two weeks for me to come back from, let's say I do a two and a half hour long run and I race descents through it. It takes forever, and it's so vitally important, and I think it should be plugged in, especially if you're not frequently descending, but that big descent workout, especially on hard terrain, the first one, you might as well not show up to a start line for two weeks, in my opinion, after that. And so that session there is huge, hugely costly. I used the term system shock with Ian Hosick last time, he didn't love it. Yeah, he didn't love a lot of what we have. There's system shock to that workout. You're shell-shocked. Your body's eyes are wide open, like what did you do to me? It's like running, this is as directly as I can put it, it's like running and getting used to the damage of running is like being punched in the face by a guy with a big cushy is that guy takes his glove off and he beats the ever living piss out of you. And then you deal with the damage afterwards. That is the downhill equivalent of what it does to your structure if you're not used to it. And nobody's ever going to get used to getting punched in the face with a bare fist, I suppose, but you understand the analogy. It breaks you. Now, if you have no skill, a lot of you out there, if you're really slow, can't even run fast enough to create damage, this might not mean as much to you. But if you can open up and get after it downhill, which many don't have the privilege of because it is a privilege, those are the people who can actually attack the downhills. You take such a beating, man, just such a beating. So every time I've done that and then been like, I'm finally not sore, it doesn't matter if my legs still aren't sore, I'm not going to have anything real productive I'm proud of for quite a while. So that's my next one. This is an aside, but my first year racing out at the Spartan World Championships in Killington, Vermont, was my first time on a mountain running. I'd used my little Midwest ski hills the best I could, and they prepared me well, but it was a two hour and 59 minute race, and I couldn't walk downstairs without assistance until Thursday that next week. Like two hands on the railing, trying backwards down the stairs. I did some backwards up, trying to figure out any way to get up and down the stairs. It was horrific. The next year, I did way more speed work, way less hill and mountain work, and I DNF'd the World Championship at like three hours and 11 minutes. And I raced the next weekend and raced well. And the difference was I slow played my race, descending wise. I cruised, I flowed the descents, and about the time I wanted to start getting to work, I started cramping. And so even though I was out there for 12 more minutes than the year before, I didn't take the descending damage. And I raced a week later well. And I felt good during the race for the most part. The year prior, I couldn't have, even though it was a shorter effort. And the entire difference was the effort at which I worked the downhills. As soon as that was taken out, the damage really was like cut in half at least. And you probably had a little more wherewithal in your training leading into that session now to know like, hey, I need to put a serious emphasis on the downhill portion of my training as well, or no? That next year I had done less hill work because I was so obsessed with getting faster. So I was less prepared, but just because I didn't rip, I never took the big damage. So just to your point, if you are able to rip a descent, you're able to rip your body apart. Yeah, simple as that. And more like the first big one. I mean, the next, once you adapt to that damage, it'll get a little more approachable, a little less damaging. But for me, it always seems like there's that ceremonious first session where the trails clear here, or I can finally get on the concrete hill without ice or whatever it is. And then I'm like, today's my day that I'm going to wreck myself. And on paper, metabolically, that day may not look like, I may have had a long run the week before with a higher average heart rate because I attacked the uphills and it kept my heart rate up, for example. So on paper, you wouldn't know any different by looking at like the metabolic stimulus, but that's irrelevant to structural damage. Just because your heart rate didn't get up doing the bench press doesn't mean your chest isn't going to be sore and wrecked from it. And the same goes for downhill running. So yeah. All right, so I'm going to make a listener request at this point. I want you to play a specific song for me. You did a hill workout downhill in California one year out of, I think, spite and shame and anger. Oh, yeah. And I just don't want it to fade into the annals of history. I believe this is a truly special run you had, and I want to keep it in the Running Public's consciousness as often as I need to. I don't want it to fade. And so I want you to tell about that. You've already mentioned the components of this. Big downhill work. Find pavement if you really want to beat yourself up and open up and attack the descent. Those are soul and DNA changing days, but they destroy you. So please regale us with the story of the infamous California two-mile PR downhill. I thought you were talking about something else. Well, I want to hear whatever that thing is, too. You know, what's interesting is I had a great... That was coming out of COVID, and I had some really good races after that, actually, as well, in the trail scene locally. But that was my only Spartan I ran that year was the San Luis Obispo. What happened, okay, is I went out to the San Luis Obispo Spartan race to open the national series, still the most stacked Spartan race, I think, on the field, other than maybe a single world championship. Jack Bauer did the math on it. It was, I mean, you could take 20th place, and 20th place, like the top 20 all had podiumed in a national series race, like at some point. It was just stacked. Anyways, I was having a really good race, actually. I was running in just outside the top five and shoulder to shoulder with Atkins and others. You had virus shorts, man bun. Yeah, that was not the man bun days. We all make mistakes. COVID did a lot of weird things to people. But Jess loved it, and that's all that mattered. No, Jess loves me, and that's all that mattered. Not because of. She says, anyways. Yes, and I got to the spear throw, and it was an absolute debacle, and I think it took me like a minute and some seconds to even throw the spear because it was knotted up and slipped under. It doesn't even matter, and it ultimately ended in me missing the spear, and it was burpees, and so suddenly I was three minutes back from where I should have been, and now I'm in 30th place instead of 5th or 6th, and I was pretty frustrated. And you went into that with slightly behind was Ryan Atkins. Yeah, Atkins, Vierman. 5th, 4th? Somewhere around 5th, yeah. Anyways, and I was feeling good. I was ready to move. That's the problem. I was ready to move. Anyways, my wife and I were taking a vacation out in California after that for a week. We rented a cabin in the mountains. Pine Mountain Club, California, which I had never heard of. It's just we found this Airbnb there, and that's where we ended up. And I wanted to run out my frustration, so it was the day after or the next day. I tend to do that. If I have a bad race, I tend to rub my nose in it. Have you noticed that? That is a WEAC trait. The self-punishment long, hard run after either a bad race or a night of too much partying. It seems to be a WEAC staple. That's the college conference Kirk and I ran in. I remember one of our best guys, Phil Keskinin, who was third at Outdoor Cross Nats, had a real bad conference race, and even I beat him. And we got home from that ride, and he went out and ran 20 miles the next day on Sunday. It was supposed to be an off day after the conference meet. We had nationals two weeks later, and guess what? He still ran phenomenally at nationals two weeks later. It's ridiculous. But anyways, and I went and I found at Pine Mountain Club, I found this one road that went basically from the top of the mountain all the way down, and I decided I was- Paved road, correct? Paved road that was between 10% and 30% grade. Like this road that you almost were wondering if you should be driving up that sort of steep, right? And I did repeats on that thing for over two hours, and I decided on my last one that I was going to race myself all the way down. It was a two-mile descent, and this is after an hour and 45 in my legs. And I ran 9.06 in the two-mile. I ran 4.36, 4.38 or something, and really punished myself. And it was absolutely worthless for the rest of my trip. The rest of my trip, the next week after, luckily I had nothing, but I don't think I did a step that was productive after that. I still would do that over and over again. What was the time? 9.38? What? Your two-mile? 9.06. Oh, no, sorry, 9.06, 9.06. A 9.06 two-mile is just so fast. It's on my Strava. I'm not lying about it. It was legit 9.06, yeah. And downhill on pavement is so fast up into the point where it's painful to run. And this entire grade started at painful to run and went up from there. So just the mechanics of doing what you were doing don't make sense to me. I've seen you run down a paved hill. I've done a workout with you where we went on the backside of a big ski hill and ran the access road, which was paved, just for that same thing, to take damage. Doesn't show on that effort is the last quarter mile was pancake flat and even had a little bit of a rise in it. And I was at like 420 pace ish, four high teens. And then I hit that little rolly finisher section and I was all out kicking to finish my run to hit that mile split. And I kept time as I started to add back on, right? Because I wasn't going downhill anymore. So it turned into like a race effort because the last bit I hit a little roller or two and it was predominantly flat and I was starting to bleed out time, but I kicked home. So I will admit I kicked home. In terms of downhill runs, was this the most painful run you've ever done? Can you think of a descent that hurt worse jarring wise or just pure effort wise than that? Yeah, but it was for lack of preparedness and that would have been Tahoe my first year in 2016 when I never run a mountain, but not prepared. No, gosh, no. Maybe one of the runs at Big Bear because it was like so steep, but it was not nearly as long or extended. So no, I'll say no. I've never seen someone running 430 mile pace down a road hill. I can't imagine seeing that for like someone coming from the distance out of sight into view past you and continuing on running 430 mile pace. Do you want to know the kicker about that? I remember looking and I'm like, there's got to be a Strava segment up and down this hill. And I took a Strava segment up the hill. I think I even got the KOM of the two mile climb because I worked one of the climbs pretty hard. But on the downhill, some prick in a car or a bike must have had their watch on. So I didn't even get the downhill. It was like 132 per mile. And I was like, oh, come on. You got to flag that. Do the Lord's work. No, I should. I remember that being that stung a little. Anyways, what's your next one? I just I still I can't get over that. What is this? Six years later, seven, eight years later. I can't get over that run. That was like nine. Oh, no, it was like 2021, I think. Whatever. Time's a construct, Kirk. Anyways. All right. So this is one then that I've talked about before, but I'll briefly touch on it. But we had the until you drop 200s in college as the last workout before Christmas break. And it was all. Oh, no, no, no, no. That's not true. It was the last workout of Christmas break. Anyone who stuck around campus for Christmas break did this workout. It was at Catchall Fieldhouse. It was on the indoor track. So indoor 200 meter track. And the workout was run a 200 meter interval and break 30 seconds, 29.99 or under. And then 200 jog around it. Same direction until you can't anymore. And you get one miss. Once you miss, if you miss another one, you are out. And it is just a last man standing workout. And that is like the definition of a team hero workout. There's really no justification as a coach you can give for the purpose of this workout. Yeah, but sending your kids home for three weeks over winter break, like let them beat the crap out of themselves and go. Yeah. Yeah. That's it. It was just a test of fortitude and how deep you could take yourself into it. Because you had an out whenever you wanted in this workout. All you had to do was run 30 flat and you're done. You get to head out and then you can be like, oh, I got to get back under. And like one rep later, you can run another 30 flat. You'd be like, oh, I can't believe I missed it. Can I please continue, coach? I'd be like, sorry, no, you're out. You could play that game if you wanted to. You had an out. And eventually some people would take it when it got bad. But almost everyone ran themselves ragged during this workout. And what would end up happening is that because 29 second pace for a 200 is slow enough for college runners that you can get a bunch of them done, you get deep into the workout. But because it's fast enough, it's still real running. I mean, it's sub four minute mile pace. It's still real running. This is faster than mile pace for everyone on our team. The fastest miler that year was 407. So this is. Yeah. Yeah. And he wasn't even part of this workout. This was for our 800 meter crew only. No one else was allowed into the workout. It was like our trial by fire rite of passage workout. And oftentimes the freshmen weren't allowed to do it for the very reasons you expect. They're the people that might try to kill themselves the hardest. So you had to graduate into that group to try it. But anyways, for all of us, it's faster than mile pace. And so you're running much faster than mile pace 200s with 200 meter jog recovery. And so what would happen is you get deep enough into it and hurt enough that you would start fudging that 200 meter slow jog. You might start out the first rep might be two and a half minutes or two minutes. No, no, no, that wouldn't be true. It might start out being a minute. And then it gets to a minute 10 and then a minute and a half. And by the end, it's a two minute 200 meter. And the coach didn't care. As long as you didn't walk, he allowed it to happen because it just allowed you to get deeper into the workout. And so the point of it wasn't like any specific internal benefits you're going to do. It was just testicular fortitude. And that workout. Did you say testicular fortitude? Yes. Okay, just making sure I heard that right. Yeah. And that workout just smashed everyone because you would get to the point where the only way to get through the rep under 30 and he'd be counting down and everyone had their watch and people would be anyone who didn't finish the workout was then on the side calling out times as you went by. Someone would be at the 100 knowing like you got to get through here. Sub 15 for sure if you want a chance. The only way to get through would be to start kicking a little bit. You'd have to start surging to get under each time. And then once you do that, you're on borrowed time. But just one more rep could be enough to move you up past someone else's performance. And we kept track of what historical bests were. But that workout destroyed every single person on the team. And you didn't even want to run an interval for like two weeks afterwards because you'd wear your fastest shoes because you wanted to get the most out of it. And that would inherently trash your calves. And the effort destroyed you like at a nervous system level. It was just the most brutal workout I ever did in track and field. How many reps was your record? I was like 16. 16? Yeah. So you've run a four-minute mile. Yep. I think 24 was the best we had that year. Someone got a full eight reps more than I got. But 16 200s at significantly faster than mile pace with jog recovery is just too much to ask for me. Maybe it was 18 was my best. I don't know. I never hit 20. 20 was the gold standard. If you could get 20 or above, you were like guaranteed you were going to be an All-American that year. I love that concept for a session. I like the two concepts of picking a time that you like a time constraint, let's say for you, you're going to do mile repeats and you're going to choose I have to run under seven-minute miles with one minute rest until I can't. I'm not deciding how many reps I do. It's going to be decided by the effort. Sometimes that can sneak a lot of work out of you. So knowing what the time you should pick is, is important. Right. And the rest you're getting, but just picking a time and saying I'm going to sneak under it until I can't. I love that. And I also love the style of, all right, I am running 400-meter repeats and I start every 90 seconds or something like that, where if it takes me 70 seconds to run the quarter, I have 20 seconds rest. That can be a hot and fast one, but like basically giving you a work and recovery total time to hit. Oh, I don't like that. Yeah, just as like a, for sure, I love it until you have to just pull, until you can't sustain your chosen pace and it turns into a race effort is what it ends up turning into, right? Yeah. I think you're one or the other. You never heard that style? Yeah. Like the, I'm going to run 800s and I'm going to go every three and a half minutes and it doesn't matter how fast or slow I am, it dictates the rest. And eventually once it's compounding interest, the snowball effect, and eventually you start wearing and get slower and then you don't get enough rest and then the whole thing goes to shit and you pull the plug. If you want to test, like I'm talking for like a benchmark session. No, I get it. Yeah. I just think you either are or you aren't an EMOM person. I am for sure. And I am not. And Yancey used to use stuff like that all the time. Oh yeah, he did. And I would refuse to even do them because I don't know, like it's the closest I could feel I know this is a really dramatic way of saying it. What do you mean, the word itself? No, no, no, the concept of it. It's too open-ended. These aren't interval work. I must have it more specific. I get it. I can choose my own effort and just try to gamify. No, I don't like that. Well, no, but the... I identify why it's good. I support people doing it. I cannot execute that. I do not want any part of it. No, but the caveat being to take it... I understand what you're saying, by the way. Sure, so I can run a minute 55 quarters and have five seconds rest, but I could do that to perpetuity. I could do that for six hours, right? That doesn't serve a purpose. But having a minimum performance standard, if I can't keep my 70 seconds anymore, it's pulled. But you're right, if there's kind of an open end to it, I don't care how fast you run them, you just have to start again every 90. That's different. Because then I could just run 90-second quarters and six-minute pace and do it, not hit the spirit of the workout whatsoever. But I get your point. I'm not against them. I just can't do it. I'm glad I was going to just say before you brought up this last one, I said we're doing all these big, long-type stuff. We should get something to the track. Yeah. The track. So I'm glad you outlined that. So then I'll follow that up with a brief track workout. Down at Campbell University our first year, we did what our coach called a max heart rate test. I thought it was terrible. We ran an all-out 800, three-minute rest, all-out 400. Race. We raced 800. The three-minute timer started when the first person crossed the line, and the gun went off three minutes later for a 400. It was just the most lactate I could have ever imagined feeling in my entire life. It was so bad. I don't think you'd see a max heart rate in that test for what it's worth. I don't either. And then we did a different, like two weeks later, we did the reverse. We did all-out 400, three-minute rest, or 90-second rest, all-out 800. What race distance do you think would be the most likely to get to see your max heart rate in? I want to say mile, but it might be end of a 5K. My gut says end of a 5K for me, but it could be mile. But it wouldn't be an 800. I don't think it's enough time, no matter how hard you press. I don't know if I'd see my max heart rate. I don't know. I feel like I could be limited by too many things. I wouldn't want oxygen consumption to be my limiter, which this workout was. It needs to be something you can ramp into and press the final 600 meters. You have to empty it entirely. You have to spend a notable amount of time with an elevated heart rate before the finishing push. And how many minutes is that? I don't know. It has to crescendo. And in this type of workout, you fizzle out. You're just in a bog full of mud the last 200 meters, and you can't move. I didn't know enough to know for sure, but I didn't agree with it. And maybe it was just because I knew how bad it was going to be. But that type of workout, we got back to the dorm rooms after that. It was just dead, just shell-shocked zombies. It was too much effort to get up and take a shower for a while. It was just system overload, way too much intensity with not enough rest. How much work is that? That's less than three minutes of work total, and we just survived some nightmare scenario. Reminds me of our 1,500 predictor test we did indoors in college, which I've mentioned it to you maybe once before. Do you recall the session? I don't because lacrosse had a 1,500 and an 800 or a mile and a predictor session, and I always confuse yours. Yeah, it was. And really, this was meant to be race. This was spiked up. This was preseason to give us an idea of what we thought our potential was for the year. And it was, let's call it all out, but you couldn't go all out because of the short rest. So it was an 800 meters, minute rest, 400 meters, 30 seconds rest, 200 meters, 15 seconds rest, 100. And so it was, I mean, after that sort of effort, and so you just totaled your time. It adds up to 1,500 meters, and you totaled your time, and that was going to be your ballpark most likely. And it's funny, I ran 355 in that first session as a freshman. I ran 356.0 that year. So it wasn't far off. You add the times of the intervals up? Correct. No rest included in that addition? And it wasn't the full mile you did? We raced the 15 indoors then. You raced a 15 indoors? We had the 15 all the years I was there. Didn't turn over to the mile until. That's interesting. Yeah. So I was an All-American in the 15. That dates you. Yeah, it was pre-mile indoors. Wow. So anyways, that one, it was like you were so, I mean, you were not ready to go a minute after your 800 and then only 30 seconds after that after running. So you'd run like 205, 206, and then you'd run 63 or 62, and then you'd run. Anyways, it got you in the ballpark. After that one, I just remember feeling like that was a similar feeling, like it was terrible. Yeah, nothing was enough rest at that point. Yeah. I often want to duplicate that, but just make the final 200 than another 200 go like 8, 4, 2, 2 and see like I don't know what that would do to me, what I could accumulate and be interested to see. That's the type of workout we talked about priming yourself workouts for a mile as an adult, something to do. That would be the kind of workout to do. It'd be perfect because you'd feel it. Yeah, and in college we were so accustomed to running interval work that you can handle it pretty well. We wouldn't handle this well. We wouldn't recover very well, so all our intervals would be like feeling the last lap and a half of what a mile would be like. Yeah. I'm struggling to come up with a track workout. Yeah, I think very few hero track workouts in college because you're running two more workouts that week. Right, that's exactly right. I think there is a place in hindsight. I'm going to use distinctly 400-meter repeats, not anything further and not anything shorter for volume. So for volume, but this isn't a threshold workout. This is like I'm running faster than 5K pace, notably a few seconds per quarter faster than 5K pace, and I am sustaining it for reps, 24-plus, like really a strength endurance session, but you're not allowing yourself to run that slow. I did 40 by 400 meters on my 40th birthday, an average 70 point with a minute rest. That one stuck with me for about two weeks because I prioritized the quality of it, and a lot of times you'll see over speed training, you know, 12, 16 reps of like let's say quarters, which is still a big session, but if you really amp those up, Dathan Ritzenhain in high school, his coined workout was 32 by 400 meters with 400 meters in between. I don't know if you remember this, and it was like a 16-mile day. It was one of his big days, or maybe it was 200 between, but it was 32 by 400 for sure. He's now the on athletics coach, right, OAC. Anyways, those big volume 400 reps with short recovery, but the integrity of the rep is important. I've found stay with me quite a while. I end up racing it sort of the back half to hit splits, and so it's a nice combo work of a lot of volume of speed, but I've found that I feel good about those, but they often leave me much more in duress than like a typical well-thought-out session. So like the whole as you're aging every year, run your birthday in amount of quarters with a minute rest or something, that high volume quarters for me, I'm going to say in hindsight hit pretty hard. Yeah, that's a hard workout for me to fathom. That is really difficult. That's just so much volume, and those are the workouts. That's the type that changes you and destroys you when you have to reach and fight for extra speed and at a point where you should be pulling the plug. And you still have 10 reps left. Yeah, every rep, once you get to the point where I should be done, I can't sustainably maintain this efficiently anymore, every rep after that just cuts closer to your soul. You start digging, you know, 50 meters out from the finish when you're 10 reps in, and then you start digging 100 meters out, and pretty soon you're hitting 200 to go on your last few reps, and you're kind of kicking to make time. Yeah. Is that what you're outlining? Yeah, yeah, that's exactly it. Or you're fighting and fighting and fighting because usually the workout is we stop as we start to fight. And this, it's like, no, you're going to fight way past the point where you should. And those are the ones that 60 by the time it's next rep, right? Like I'm literally in threshold while I'm resting and then I go again, right? You never even get below it and then you're on borrowed time and their DNA changing. It's hard to hurt you once you recover from that session, you get into a race or something else. Like, well, I got through that. So the workouts where in college on the team, you knew it was getting real when suddenly it was quiet. Right. You're 60 seconds into your rest and no one said a word yet because everyone's in their own personal cage just trying to think of how can I not be the one who quits first? And then it's why team workouts allow you to do this more from an interval standpoint. It's too easy to quit interval workouts by yourself unless you're a special person. But those are really bad. When it just got quiet, you knew everyone's in their personal hell right now. That's also why it's on the coach, which I always would do. Kirk, you're out. I'm pulling you. I got pulled from one workout in all my years, one. And it was a cross country workout. I had a bad day and it was obvious. And that's where like the kids probably aren't gonna. So you can see the duress on their face and you can see they were a second behind where they should be. And you'd go back and I'm sorry, buddy, I'm pulling you. Because that's what it takes in that situation. That's interesting. Our coach would sometimes have someone lead. If they were starting to struggle and were kind of given off that vibe that they wanted to be done, he'd have them lead the next one as proof. Like if you can't stay ahead of these guys, you need to be out of the workout. But if your ego is enough to get you through another rep, like, all right, kid, you learned today. You had more than you thought. I always thought that's a mean but very effective way of proving this. Not really mean, just harsh. You ready to be done? Okay, you got to lead the next one. Prove to me that you're ready to be done. I think I like that. So we did a workout when we were out in Crested Butte. Crested Butte is beautiful. It is like you are in Switzerland in the middle of Colorado. Very high altitude. The base of the mountain is like something over 9,000 feet. And then it goes up to 12,000 at the top of the mountain. But I did a workout out there prepping for like yourself, Tahoe, one year. And I explored the mountain to the top, descended down to the top for time, raced down. And I was a mess for a while. So it was like aerobic threshold up and down round one, time trial to the top, raced down. And just it's a 3,000, maybe more, closer to like 3,500 foot climb. And it takes five or six miles. I don't remember what it is. It's called four miles to the top. And just four miles of hard, hard, hard descending once you've already been at 12,000 feet and time trial to the top just required a lot of mental like just stick to itness. You had to keep yourself focused because the footing is just bad enough. It's a pretty runnable mountain, but the footing is just bad enough that you don't want to miss. So you can't slack off mentally. And then that keeps you on it physically. And if you're fit enough to get through that workout, I found myself getting back down to the gondola area just like ravaged, jello-legged, feeling like I probably didn't move for the rest of the day kind of workout. That up-down, it's just the up-down at hard, just sub-race effort. No matter if it's a 100-meter hill or it's a four-mile hill, I feel like that sticks. Getting to the top jelly in your legs and making yourself work through it until they come back is a very destructive thing. Yeah, I have a really hard time summiting and then turning right around and pressing. It's almost like I need to gather for a minute. It's almost like my heart rate spikes even more when I start going down that first little bit. It's really interesting. Your quads are full, entirely full. And like this one, you're at 12,000 feet elevation to the table where on the way up, every quarter mile got harder to breathe. So you get to the top depleted and oxygen-starved. It was a really, really difficult workout for me. And the night before, we had done a 15-minute for a treadmill challenge on the treadmill at 9,000 feet as like a buy-in to the weekend to see how bad the altitude was. And it just combined to make it a rough one. And you'd do it all over again. Yeah. Yeah. That whole season, you felt fitness from these type of things. Well, that leads me to the last thing that I want to talk about. And then I'm fresh out, but this is what's coming to mind. I don't want to force it, of course, is the training camp week, training camp weekend, training camp. I don't know about you, but the corral of athletes that I work with, probably you, the one that would hire a coach and really pursue their run goals, a vast majority of them have like a training camp week. I'm going out to train in Flagstaff for a week, or I'm going on a trip to Boulder or wherever, and I'm going to go visit my buddies in the mountains, or we're going to go train. I don't know if you have a host of people that do that, but I do. And it's, I'm off of work or it's a spring break. Yeah, I have a handful. And I want to use that week to the fullest, which is what I did on my vacation. And it's knowing you're tired and putting on your shoes to go another two hours, or it's, I hit a quality track session on Tuesday, but me and my boy Bracken have all week together. We're hitting another one on Thursday, and then we're burying ourselves on a Saturday chasing vert for three hours. And suddenly you have like an every other day schedule of intensity for a six day window, and you're going further than normal, more intense than normal, and on terrain or something that isn't typically available to you. And you leave a shell of yourself in the most wonderful way. And I just recently experienced this with putting together a really nice race last weekend after having sort of one of those weeks in hindsight, it wasn't the full intent, but it turned into that, right? And so done right, it ruined me initially, but came around in time and I made gains from it. And so the fitness camp, which I love, or people can do it from home too. Like this is my week. I'm going to swing hard for a week, screw it. Great, do it. Just know that on the back end, the pendulum swings and hits you in the ass, right? In the recovery front. And so I think there's a time and place, especially if you're racing events, let's call it two hours or more, where it just takes durability. You've got to be on your feet for a long time. It's okay to stack things when you're not fully recovered. My legs are still sore from climbing and descending two days ago. Guess what? Another two hours today, bro. Go for it. And I think there's power to that in the endurance space. I think if you're racing like an hour maybe or less, you could probably argue it might not be the juice worth the squeeze. But if you got longer stuff, I think there's just, you know, you talk time on feet. Somebody walks 10,000 steps a day for their job and then they hit their long run afterwards or whatever. It's just time under duress. And so those weeks, I think you can't have them often. You can't be doing that every four weeks. This is even a more spread out thing, once every three months or less. But those set you back, but they also propel you forward if you can allow them to soak in. I agree. The training week. Yeah, the idea of a camp. In fact, I use this justification with athletes sometimes that I really want to do this thing, but I have this and this as well. Is that safe or smart? I was like, well, probably it's not smart. But is it safe? I mean, if you slap that label on it, cross country camp, this is what you would be doing. You'd run twice a day, every day for four days, and three of them would be quality and you have a long run in there. And that's just what thousands of kids in the US do every year. They call it cross country camp. Then you're beat up afterwards and you recover. So if you just called it going away to camp, anything you did under the auspices of camp would be an acceptable run. Wake up and go hard again the next day. Because you know when you leave camp, you just sleep and rest and recover and that's your break for the summer. So yeah, we can always do that. And it is, you're right, that crazy amount of accumulated work in a small window of time, but with sleep throughout it. That's also one of the big pieces of camp is there's not much else to do. You do your campfire and you go to sleep. It's a pretty powerful tool when it's paired with sleep camp and recovery camp the next week. Yeah, and it may be, I mean, my first few days back after this recent ones, like I had a five mile day, a zero mile day, and maybe another zero mile day. Like you have to accept that, like I can't keep my training volume up the following week. Like I want to or think I restrained on the back end too. It's important. But yeah, we can do it at training camp in high school. Did you go to any training camps in high school? I didn't. My brother went to a few, but I didn't. I went to one and left with a stress fracture. So I guess not everything stays at camp. No, I really, I went in with like barely a mild, mild, mild case of shin splints and couldn't even run the last day. Ruined my senior year of cross country. I mean, we were doing so much more volume than I could handle. It was twice a day, long runs, interval sessions. I came back with a stress fracture. And I remember Coach Witt at Stevens Point. This was the Stevens Point cross country camp. And he was coming into my dorm room and yeah, you should really think about running for us at Point. You're a heck of a runner and we want you here. And he was coming to my room. I was the fastest guy there, along with the D2 state champ from the year before, Kyle something. And he was buttering me up and then I left injured and had a very average at best cross country season. I was like 30 at that state or something. And he wouldn't even return. Like, hey, you still interested in having me run there? And I never got a response from him. He just dropped me. And I used him as my personal vendetta because Oshkosh had recruited me. Eau Claire recruited me still heavy and Point dropped me like a bad habit. He forgot about me. The camp coach because I didn't come through during the season. And anyways, every time Point was there, I literally thought about like his face on a dartboard and ran harder because of it. I was an All-American my freshman year and I just wanted to go up to him and be like, F you, man. You could have had this, man. I wanted to go there, I thought. Anyways. That was lacrosse for me. I went up there to play baseball my sophomore year halfway through and I didn't make the team and I was partying and pity partying and all of that and decided to get back into running and I was running by myself and then noticed there were all these people running that weren't part of the team and it was the D3 gray shirts. It's the D3 version of red shirting, but it's not a real thing. You basically just get to practice adjacent to the team, but you can't be coached. It's just a club, really. It's club running. But eventually the coach told one of the guys to tell me that I wasn't invited to the gray shirt runs anymore. Yikes. Because I was lifting after the runs and I was still baseball sized, which wasn't massive, but it was a few deviations away from what lacrosse's runners were. And he thought I was a bad influence on them, that I wasn't taking it seriously enough because I was dividing my attention between running and the weight room. So he asked me not to come back, but didn't say it to my face. He had an upperclassman come and tell me. Those sting at that age. But then you remember. So then I transferred back to Whitewater and handed off ahead of them at the DMR at Nationals and that was all I cared about. And anytime there was lacrosse singlet ahead of me, it was just a little extra to be like, if every single lacrosse eagle I finish ahead of is a direct middle finger to that entire coaching staff. Probably had no clue who I was. But then my brother went there when he graduated high school. He's three years behind me. And then they'd always get like, oh, how come your brother's not up here running? Because you told me I couldn't, you jerk. They had forgotten me entirely by that point. They probably never knew who I was. They didn't know my name. They just said, tell that guy to stop coming. So I don't think they even knew when I was at Whitewater that I was the same guy they had told not to come to their running group. That's so interesting. And their middle distance program fell to shit. The 800 meter fell to shambles while I was there. Their milers were strong, but their 800 meter runners just like really underperformed. They got a couple of straight state champs who got worse in college. And so I would have been their number one. And I just wore that like a badge of honor for three years. But no, he doesn't even know he did it because he didn't know I was that person. So we both have our WIAC vendetta team. It's the kind of thing that you come up with a chip on your shoulder because you need to be. Something's got to get you through the workouts. Being catty out of made up spite is a wonderful, wonderful fuel sometimes. Yeah. And looking back, that kid might have just come up and said, hey, coach said we can't have you here anymore. He might have just not wanted me there. It might not even have been from the coaches. Back in the back, he keeps all his receipts. All of them. Do you have anything else or are we done with this podcast? I think we can be done. I think we can be done as well. All right, Kirk, you are now what, five days post-race? Five. How's your body feeling? Good. No DOMS. Yesterday I said it's the first day I have energy. I'm sort of feeling like I'm coming around and then I got woke up and got sick this morning. So I'm now a little confused now, we'll say. But I think I'm pretty good. I think I might only take six days off and go for like an easy run on Saturday. So one week post-race, flush things out and then go right into a full training week again. I got about a nine-week window to grandma's and I think I'll be ready to go. So I think I'll only take five, six full days of nothing, but no cardio stimulus. I'm not on the bike. I hit the weight room three times already this week. Love that. My butt is sore as heck from heavy lunges and squats, so I'm still using my body. But I think strength work can propel the recovery process in a vacuum. Even leg work, just because it's DOMS from legs strength doesn't mean it's going to set you back on the running legs recovery front, if that makes sense. And so just strength work and then depending on how this cold progresses, either run Saturday or I'll take a full week, but it's not going to make a difference. That's just for my sanity that day. If I run Saturday, it has nothing to do with my ability to run well coming up, but pretty good, I guess is the answer. So you're sticking with your one week off and then you have a nine-week build or rebuild or whatever you want to call it to grandma's marathon, which is your marathon debut. Yeah, I'm happy to report my nipples have recovered. I got quite a few messages about my nipples here. Didn't expect that, but I did and they're feeling really nice today, guys. I think they're about 90%, so all is right. Your nipples came up on our race brain team meeting yesterday, our conference call. How so? Someone said, I had to go to the store and I listened to Bracken talk about nipples on my drive home. I don't need an excuse to talk about nipples, Bracken. Nope, none needed. Free the nip. How are you feeling? Real quick, rundown. Have you been feeling all right now that you're back from vacation? You back to a groove? Yeah, I'm just, I feel like I've said this several times on here. I'm firmly in the everything's making me sore stage of training. Lifted several times this week. I'm sore. Every insertion point, right here, right here, right here. Everything's sore from lifting. I did a speed-ish session over on the ski hill and tried to flow the descents a little bit and I'm beat up from that, but it's all good sore. So I'm paying for my time spent away from running in the way you're supposed to pay it. Yeah, that's a satisfying feeling, knowing that you've earned it when you're ramping back up. And then the wonderful thing about the phase you're in is you won't know when it's coming, but you'll pop something here in the next two weeks where you'll be like, I think I might be doing all right here. And it'll happen, right, when you ramp it back up to consistently. And you can't always predict what session it'll be, but I always feel like I look forward to that. Like when I'm ramping back up here in the next two weeks, I probably won't be super proud of any effort, but then like two to three weeks back, I'll just hit one and be like, I'm back. And it's all to go, which I like. Mine will take me longer, but I'm getting, I have little signs that this is still a thing I can do. Can't do it for long. Can't do it very well for long, but it's still there. Like, hey, I'm here. I can do this thing. Just keep feeding me and then I'll be fully back for you. Sweet. We're going to need a training camp, speaking of which. We'll have to talk about that offline, but. Yes. I want you the week after Grandma's. Interesting. Okay. Why? Because I'm going to keep up then. You're going to be trashed from Grandma's and I'm going to be in mediocre shape and we'll even out very nicely. Your first week back after Grandma's, that's when I think we should do it. Okay. I'm the injured wildebeest out in the field and you see that? All right. I'll be the prey. Fine by me. Perfect."
}