{
  "text": "five minutes of work, where it would just be like pretty continuous, like 800 meter run, 37 to 50 meter sled push, 800 meter run, sled pull, 800 meter run, burpee broad jumps, just do that. Right. And just keep that in succession, build some volume. And like, I would rotate that out. So sometimes it'd be lunges, sometimes it'd be the row, any like things that would give me like specific problems or anything that I wanted to feel like later in the race. What sort of intensity? Like starting at like seven out of 10, like marathon tempo type intensity and letting that kind of that fatigue build. This is when you were starting to improve before you popped that 60, we'll call it. That's what you found is like a good winning formula at that point. And I think that's incredibly effective. I think that works really well for beginners just to understand the pace of it all. Like what minute five is going to do to minute 40 is it's just like really helpful to have that. So are you talking if you had to put metrics like starting around aerobic threshold and letting the fatigue take you over by the end? Or were you sticking at high end aerobic the whole time? No, I was definitely going over at a point, right? Like, but like the pace wasn't super fast, but the feeling and the fatigue from the muscular side, I think was just like, so like it would get harder, but I'd get like a little slower in those times. So yeah, I'd say probably finishing right under like anaerobic threshold feeling. Okay. For sure. Then like the double threshold years, it would be like morning would be, I don't know, 12 by 90 seconds on skier with 45 second rest, something like that. Right. I like the shorter pieces on the machines just because like muscularly like will be taxing eventually. And then the afternoon could be something like, like straight up threshold run, could be whatever four to five by 1600 with a minute rest, or it could be something more high Roxy where it's like three by 10 minutes at like 600 meter run, burpees, lunges, rest two minutes type of thing. But usually the morning was either some sort of machine or some sort of mixed modal or some sort of like, I guess it's not mixed modality, but it would be like straight sets of like, I would do like six by 60 second ski, six by 60 second row, six by 60 second run, for example. So hitting all the modalities, but putting them, but having them be like isolated. And that was pretty. And then, you know, I would work some sort of longer, maybe one or two longer workouts or just like one longer workout per week, maybe depending on where I was in terms of the competition season. And so now I've been playing around with a couple of different varieties of this. And one thing that I've taken out of these like tempo runs are like the repeated sleds, because I just think that if you're going to do the sleds, you should do them with intensity and with speed and with power. And then ultimately, if like we're doing it 40 minutes into a workout, we're just gonna be so exhausted that like we're not getting, we're like, we're getting some stimulus in terms of fatigue building from the sled, but it's not specific. And you're just like training yourself to work kind of slow on the sled. So I kind of use the sled for like speed work only now. So I don't really put it in like these type of pieces. So it would be something, I really like the echo bike for this type of thing, just to keep stimulus up. It'll be similar format, but just with like shorter chunks of station work. I have something written. I have one for my session this afternoon. I'll give you a little piece of it. Sure. A little piece of my session this afternoon. So you have like a quality session prescribed for yourself today? Yeah, man. If I was eating bicarbs like every day, just every session, zone two, bicarb. Hey, some probably do. I carb in alphas, easy run. No. Oh, making a post about it. So I've actually started to blend. So one thing I've gone away from is isolated like track sessions, like speed sessions that are just running. For the sake of getting the density of volume in one shot. So I used to be able to split that, right? I was like, okay, I got my run work here and get my station work here. Now I've just like combined that session. So today I'm going to do like a straight up threshold run session up front. And then I'm going to finish with a 28 minute EMOM where it's going to be. So, okay. So it's three by two mile is what I'm doing today with, I'm just going to do one minute rest. And then two minute rest into a 28 minute EMOM where it's zero to three minutes is 52 cows in the echo bike. Minute three to four is 20 meter burpee broad jump. Minute four to five is 20 wall balls. I'll probably go heavy. I'll probably do 25. And then minute five to seven is going to be 50 meters walking. So what this is going to do is get my heart rate at that anaerobic threshold, like quickly within that first like, within that first interval of run. And so that 28 minute EMOM, I know that these, the duration and volume of each of one of these movements is going to be high enough that I'm able to keep my heart rate at that effort and not so high that it's going to burn me out. So you're running through that four times. How did you land on those specifically versus, I don't know, you didn't say ski or something. So I like the, for this one in particular, I like the echo bike so that it keeps me kind of keeps me in the game. Like skier and row are just kind of exhausting. They're just like a little bit too hard sometimes. So I've tried this and I get that and I'm exhausted trying to get into the other movement. So it's, and so more is just like more hittable, honestly. And same with all the other pieces, right? Like I like burpee broad jumps and wall balls in particular because the heart rate response is favorable. Like you can stay in a good spot, like it will go up. Where other things like farmers or like walking or sometimes walking lunges, even like things can kind of dip down just because the work rate is so much slower. So I've just found these to be like doable at a higher effort. So you went down to Austin, Texas, hung out with Nick Bear. Sure did. And you met an athlete I've been working with for five years, Simon Diaz. That's my boy. Simon's the guy. Well, technically he's my boy. That's true. We'll have that conversation later. But I thought it was funny because I had prescribed him like a mile buy-in session with High Rocks finisher that day. I think he had, he might've had like a mile buy-in cash out or he had three by a mile and then his hybrid work. And you guys all went down and hit a session together. And he told me what you guys did. I'm like, yeah, do what they're doing. Are you kidding me? Don't worry about my stupid workout. Go hang out with the boys and like get it done. And what did you do? You did like a mile buy-in and it was like very similar to what I was like, I couldn't have worked out any better. Are you often doing, so anyway, so big fan of that philosophy point being. Do you believe, do you always like the run uninhibited in the beginning? Do you ever, are you ever interested in a cash out scenario or vice versa? Have you played around with that? I have thoughts on it myself, but I'm just curious what your learnings are. So when I will flip it, it will, with the intent, the finisher will be at like more like tempo, right? One steady state as opposed to interval based. And the intention will be at potentially High Rocks race pace or more like marathon pace. Like just the output is going to be much lower. Like intuitively I've tried to do it before where I'm like, all right, I'm going to rip 35 minutes on this echo bike. Then I'm gonna go do some threshold intervals and it just like, I just exploded into pieces. So you'll get the same type of benefit on, but just at a lower output. So it depends on what my intent is for the workout. But yeah, I do like that. Okay. So you've gone 67 down to 54 using this process. Now along the way, it's always hard to tell if it's because of or despite. So if you took what you know now and you went back to day one, could you pick up with what you know now doing this? Or would there still be need for precursor work to get to the point where you don't need standalone run or erg sessions or as much anymore? How much of this is universal and how much of this is athlete training life and experience? Right. Like what steps could be skipped in this process? Yeah. What was not needed and what was absolutely necessary but not best practice for performance? So another thing I guess I didn't touch on here is I went through two different bulking cycles where I was like, I'm putting on weight so that I can put on muscle, right? And that step was very helpful. As Kirk asked in the beginning, it's like, how much muscle do you have on now compared to where you were? And I look much more muscular and I'm much stronger, but I went through this phase where I was carrying a little bit more body fat so I could get a little bit stronger."
}