{
  "text": "that early. I'd speak for myself on that end. But the totality of this race was that the race was breaking people down much more. And now I think there's a lot more information available. So many people have done this race now that we can kind of understand how to get as prepared for it as we need to on that first go. And that it is really serious and it will take you down if you're not incredibly prepared for it. So I don't think people experience it as much now unless they're just underprepared. Throughout this time, you've been at kind of the forefront of thinking about how to train for a hybrid sport. And you have that background of a 4.14 high school miler, a D1 college runner. You have running chops. You understand the physiological cost nature, how to just go along about becoming a good endurance athlete. And then you had your CrossFit days of figuring out and learning that from a strength and a metabolic conditioning standpoint. And you got to this and you did OCR training plus CrossFit. And then you started a hybrid approach to it. And correct me if I'm wrong, but how I remember the progression going was I need to get my pounds in. And then it turned into I need to get just more nasty work in to be able to handle what the first half of the race does to me. And then it was I need more volume. I just need more volume. And those two may have been switched. And then it was I need to just accumulate as much threshold time as possible. And then you kind of backed off on some things. And throughout this time, you had been like not boom or bust. But as you would talk, you'd always say like I have a good race and I have a bad race. And you've now strung together races. So you were going along the road of figuring out what works for this sport, but also through your own personal lens. So what were those steps? Early on, it was muscular fatigue. It was muscular endurance. It was muscular breakdown. What was next? So, yes, to address that. So after that race happened in 67 in Orlando or back when I was down racing as well. And then 68 in that next race in Chicago. So I just had like a little bit of like I didn't I had poor grip. I just didn't race as well. I just made some mistakes, whatever. So from the six months from that 68 to the next race, I dropped to like a 60 low. I think it was like 60 10 or something like that. So I took like seven minutes off of this time by addressing the duration. Like I was like, OK, I need to set myself in this spot and kind of do like longer tempo efforts moving in and out of station work. So accumulating a lot more volume in the station work and accumulating a lot more volume just with output. So I would do one of those a week and then I would do I was actually doing incline running at the time because I had I was nursing an injury after that first season. Yeah. What was that injury? I remember that, but I'm forgetting what it was. It was like hip, like knee issues. Then I had something in my like sacrum, I think that actually that put me down for a minute. So I was doing a lot more incline running to bring it back. So I started doing incline intervals. And as I was doing these incline intervals, I was doing them longer than I would typically do on flat because just like the work rate is just like a little slower. So I was just like building more and more volume. So I think I got up to like four by 10 minutes of incline running, which at threshold in hindsight, I was doing longer threshold intervals where I thought I was just kind of like doing longer hill repeats. So the combination of those two pieces worked really well to shore up my ability to work well in the beginning without overdoing it and finishing strong. I actually and then I had a the time to kind of reflect on how to do the race. And strategically, I was able to kind of share some things up as well. It's like, OK, I need to take it easy here and take it easy here and to make sure that when I get through it, I can still put out a little bit more. So it's a lot more conservative up front. And that took a ton of time off of my finishing high rocks with a combination of that. So after that, that works well. Right. But then, Bracken, as you said, I think shortly after there, we really started to get in on this like threshold, double threshold movement and like looking at it from what's happening broadly in endurance. It's like, OK, cool. Like, let's try to accumulate as much work at anaerobic threshold, at threshold as possible. And that should translate well, because that's kind of what these race demands are. So the thoughts with double threshold. So I started doing double threshold, right? Where it'd be like Tuesday and Friday, there'd be two different quality sessions, both at like that threshold area. One would be like run specific and one would be kind of mixed modality. And this I don't felt like worked that well for me for a couple of reasons. There I think it's just too much for me. I mean, I'm 39. I'm older in the athletic cycle. And I think just having back to back quality sessions just like wrecked the rest of my week and hurt both quality sessions. Right. Like I don't think I was ever really getting to where I needed to go. So I think overtraining really became a thing. And also for me, I need to accumulate time in anaerobic threshold, not in terms of frequency, but in terms of density. I need to have a big chunk of time where I'm just like sitting in it. And that's how I respond best. So if it's like if I can get like whatever, 100 minutes over the course of the week in four sessions, but like doing three or four minutes at a time, it's way less effective than if I was doing 30 or 40 minutes at a time, maybe getting 80 minutes throughout the course of the week. So can I pause you really quick? Sorry. Just to make sure that everybody's observing what you're saying. And again, this is Rich's stories. It may not be your story, athlete listening right now. But so the first big jump from like 67 to 60 flat, in hindsight, you were spending more time at output because you were stuck on the uphill treadmill. And so looking back, you were spending a little bit more time putting out, we will call it. And then you expanded just the overall, let's say time demands of your Metcon type high rock sessions. Right. So both of those things maybe, and then some acumen on course as well, but it all combined. Right. And then from there, you talk about. I want to pause you actually and just make one quick point. We'll pause. Those long tempo sessions that he talked about going in and out of running and stations, I believe build race acumen really well. Yeah. Because you get 20, 30, 40 minutes in and you get sluggish or a little dull and you start figuring out how do I get more efficient on transitions? Or I can't over grip this for 40 minutes. And I think that replaces some of that sim work or race work people did. Real quick, boys. I got a workout later. I'm going to take in some bicarb while we're talking. Oh, let's know. I want to see what's going on here. If you don't mind. I feel like I'm watching David Roach. Who's unpaused? Is it me or is it Kirk? Oh, no. Is this just a goop? Kirk paused you. I double stamped his pause myself. And now he's back to unpaused while you're still paused. I'm still paused. Okay. So that looks like hand sanitizer with little bubbles in it. Have you not tried this? No. I don't cheat. Doesn't like the Rebellion Pro. I will cheat. I'm just not fit enough to bother yet. Once I get closer to race specific work, then it's time. This is important. It's 1.30 our time, 12.30 your time. What time is your session? What time are you hoping to be training at? Like 2, 2.30. Okay. So I'm just wondering your time to... Hour and a half is pretty solid. Yeah. For the bicarb or for the conversation? Bicarb. Yes. Both. Conversation is limitless. All right, Kirk, unpause. I just want to talk about... Because I've watched Rich have some clerical errors on course in Orlando. Everybody does. Yeah. I had gloves to wear for the pole and I was like, man, I was warming up with Bracken and Megida. And I was like, I had these receiver gloves and we all know BK. He has his own line of them. I was like, should I wear these things? He was like, no downside. And then I get to farmer's carry. My hands are so sweaty. I can't even... I can't pick it up for one second. I take the gloves off. My hands are pouring sweat. I had like a four and a half minute farmer's carry. So some downside. Potential downside. If you're a hand sweater... I didn't know about this about... I didn't have all the information. I didn't have all the information. Anyway, the long tempos force you to get efficient at things because you're just tired. So unshun. Continue, Kirk. How many times have I been unpaused? It's been the same, but you just haven't started up. So I just keep talking. Well, I'm just being patient. Unpause. All right. Then we fast forward to double threshold"
}