{
  "text": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. Whether you are a brand new runner or you already have a great mustache, we're here to help you increase your running knowledge and present it at a practical level. This is The Running Public. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. So I'm the only one without any control over this environment. Yeah. Just with what you say. The only control of your words, BK and I are operating everything else. I logged in today and he removed me from the session immediately, just as a power play. The same joke to Kirk too. Yeah, you moved me all around and got rid of me. It's not cool, guys. When's the last time that you guys recorded a podcast together? I don't know. It's been some time. We did a random race brain. We just stopped doing race brain for like a month. Then we came back and we're like, all right, let's just kind of have that and just talk about what we're going to do. They're like, yeah, we might do race brain from moving forward and we just haven't. That was probably three months ago? It was February, I remember. Yeah, it was creeping on it. Oh. I saw him yesterday, but not for a podcast. We speak frequently, but we don't record them as often. So I've pried Bracken a few times during episodes. Now I've asked you a couple of times, haven't I, Bracken? Or was this off record when I've asked you about like, what's going on with race brain? One time on air you asked me and I gave like a really fuzzy answer. Is it going to keep it that way? No, we got him here, grill him. Well, the floor is yours. I know nothing. Kirk, you're still in the logo. With a man bun, which was like four years ago. That was COVID. Is that coming back? No. That was it? Have you ever grown out your hair, Rich? And Bracken, I know the answer to that. I wish. Yeah, I grew my hair out. Back in high school, it would go out big, kind of fro style. But no, I'm not growing the hair out now is not what anybody wants. But you're still in the logo. I actually went on the YouTube today and saw you on there. We were all on there and I was like, all right, we got to get rid of this. So we're on the last stages of the old race brain. So now race brain as a podcast, how it started, right? We were wanting to touch on the sport of OCR mostly, right? So most of the conversations that we're having were based around what was happening within the inner workings of the sport, how the national series was going, what the matchups were going to be, what the narrative and everything was, what everything means. Just kind of giving more context for the fandom of the sport. OCR as a sport doesn't exist the way that it once had. So my fandom in particular definitely started to dwindle and just like the conversations started to shift a little bit more into High Rocks Hybrid. And then we saw like that there was this opportunity to really double down on the High Rocks side of things. But how race brain existed where most of our audience were OCR fans and we weren't talking about OCR enough really to feel like we were serving them. We weren't talking about High Rocks enough to feel like we were able to grow and serve that audience. So like we were kind of in this weird gray spot that we needed to then either pivot or just find something else to do that will be a little bit more productive. So we chose the latter. Race brain exists now and actually we just launched something that was cool yesterday. So race brain is going to exist more like as a media platform now where there's going to be multiple verticals of content that is mostly going to cover hybrid with the option to do still OCR. But we have a High Rocks show. We have a YouTube show that kind of gives the news. We just launched our website yesterday to give like blog articles. We do like newsletter and just like do some reviews a lot like just being a lot more broad as opposed to being just like one podcast about OCR. So there's YouTube stuff out there right now. YouTube stuff's out there. All right. That makes sense. One of our final episodes prior to it, Rich, Jack and I talked and we all kind of agreed that A, we were forcing it. We were trying to do drafts and half the people had never made a podium in their life. Three quarters of the people have never made a podium. Not that they are unimportant. They do now. It's not compelling like conversation when we don't know anything about them. And we also were just getting so overwhelmingly negative. It was starting to become like a bad mood thing where we would just complain. It used to be we would complain, offer suggestions and balance it out with like love of the sport. And now our love of the sport was coming out sideways. And it was getting negative and we didn't like it. And we were dedicating time each week to being negative. And that was kind of like for me, that was my selling point. I'm obviously less in the high rocks world than like Rich is entrenched in it. Jack and I are less so, but it was an opportunity to be excited about a sport rather than be depressed by it. Yeah. There has to be a positive, alive passion for what you are going to show up and talk about every week or twice a week in our case. If it's not a positive and it's not a passion and it's slowly dying, AKA OCR. Rich, when's the last OCR you ran? Exactly. Yeah. It's tough to string it out. And pretty soon when the listeners can feel it, it's probably time. I think they tolerate negativity when it is a small percentage that's balanced out and kind of justified by all the other things you do well or positive. And we had less and less and less of that to even balance it out. And we just kind of felt we just got on and complained to the wall every week. Yeah. There's a point where, and I think where we kind of justified it a lot is like, okay, we're being critical to provide like a different lens to look this through to try to help improve things. And then we were just, we realized that we were being critical because we were just unhappy and dissatisfied with it. And it's like, why do we need to be, we don't need to share this. We don't need to record this and broadcast this out. So there's still space for what we were doing in terms of like what we started as like a brand and like a voice that I still believe in, but just like how we're going to deliver that and making it a little bit more, like much more broad and a little bit more systematic in terms of like an actual media entity is kind of now where the pivot's gone. Like we talked about being like, oh, maybe we'll just do like a round table show, make it a little bit more like YouTube centric. But we all wanted to do things that we were like passionate with instead of like trying to just like hang on to something because we had done it for so long. Like what is it? The sunk cost fallacy, right? We had like sunk time fallacy on that where it's just like, this is, we did this and it's over. There's nothing that the past can really give us now. So we have to figure out where to go now. I would like to think I just had a year foresight on you guys, but that's not the case whatsoever. I'm out of here. No, there was no writing on the wall. But the ironic thing about what you both are saying is that Bracken, Rich, Jack, all inherently positive, glass half full, super pleasant, level-headed people. And it's funny that even something that you see that you love and have a passion for and are unhappy with then can feel like it's displayed. I don't know, the other side of your potential personality. I don't look at you that way at all, none of you guys. That's just interesting to me. That's so nice of you. Thank you. Well, it's true. Well, there's truth to the fact that like nothing can withdraw true hatred like love. You know, like if you feel something so strongly, the opposite side comes out when that gets betrayed. And that's how we all felt. Like we felt betrayed, but we can save him. We can fix him. And eventually we just realized they don't want to be saved. It's part of growing up. Can't save everybody. Can't save everyone. Well, Rich, you're our guest on this podcast today. And people might be confused who listen to the circle of this and RMR and such. They're like, what feed is this on? Maybe it's on both. But I told Bracken last week, I said, I want to chat with Rich. Did I not, Bracken? Was it last week? I'm hazy on time, but you did say that. And then he put it together. I've been wanting to chat with you in like an actual podcast, non-BS style for like a while now, since you've had successes, ups and downs. And we haven't chatted with you since when? It's been some time. I've been on the show a bunch. Coaching series? Am I still a record holder? I've done like six. If you're six, you've got it. If you're four, you've got it. Hunter's had four. It's been so many episodes. I think I still"
}