{
  "text": "sort of metabolic something that I don't understand that has to do with riding a line or being able to breach and come back. Bracken breach and come back all day, for example. Hmm. I'm terrible at riding a line. Yeah, I guess. So like in terms of like if you're looking at physiologically like in that respect, like if you spike, right, BK, like say you're spiking, we'll talk about lactate here, right? If your lactate levels rise, do you think it's like tolerance that you have more than like ability to flush? Like where Kirk and I would sit there and just flush out over and over? Or do you think it's like the opposite? Like you can flush very quickly or as opposed and maybe we are mechanically and aerobically fit enough that we're not like we can go fast enough without like producing that type of byproduct. I've always thought I was bad at tolerance of lactate, but I thought I didn't produce it disproportionately in any other form of locomotion. Like I wasn't a great cyclist, but I could cycle as well as I could run. And I'm not a great rower, but I can row like a 1545K runner without like my fitness translates to other things. I'm not a, I don't run a lot of technical trails or descents because we don't have that around here a ton, but I can do that as well as I can flat run or maybe a little better. But if I have to do it for an hour straight, I can't hold that line. I think I'm just good at pivoting from thing to thing and it doesn't spike when I pivot. Where other people, I think they are super efficient at handling it in a movement and then another movement, they're not as efficient at. I think across the board, I'm moderately okay at it, but in a sport that shifts you from thing to thing a lot, it looks better. So do you think it could be more of a literal mechanical efficiency thing in certain planes of movements? And when that is other movement is required, it's as simple as that? Or is it actually lactate or whatever we want to talk about that's flowing through our blood? I wonder. It's just an interesting thing because you'd think it would translate, but why is an Olympic swimmer a 21K5K runner? 21 minute 5K runner, which exists, by the way. I'm sure. Like Rich, what are you better at your entire life? Were you better at long runs and tempos or interval sets? Interval sets. I'm mid-distance, baby. Okay, and that was me. My interval sets, I could interval set without overextending against people significantly better than me at running. But I would run my threshold runs or long runs and get stomped by people that I was way better than at mid-distance. Like I can't hold a steady effort. Well, we would think that would be aerobic fitness or some sort of mechanical breakdown in terms of just fatigue. Well, I think that's the key. I believe the strongest aerobic capacity people do great at high rocks. I think engine matters more than being able to spike it. I think speed, this is now a shift that I have made this season because I was there too. It was like, who can do the most? Where's the volume? What's the capacity to handle all of these different elements and being able to spread it across all these modalities so that you can build this massive floor, raise the floor like crazy. But now this event where it's dipping into low 50s, it's like we're kind of shifting faster and faster. So I think the speed now and the efficiency, the movement piece I think is really important and one that is going to be a separator because now we're at that point where everyone's kind of as fit as each other. But now it's like where can we see the margins in terms of explosive power and just like movement quality? Who can run well? Who can run well without taking like without it costing them? And yet if you look at the marathon, that's the same story now. Right. Like the three top finishers at London this past weekend for the women where the marathon world record fell had 800 meter PRs of in order first, second, third, 159, 156, 2 flat or 201. Like these are now, it's the same thing. It is an aerobic capacity event until everyone's maxed that out and then it returns back down to who can spike the best? Who is the most efficient fast? But I think the precursor is the capacity. Well now is this training methodology or is it tech? Right. Because that was the rub on some mid-distance before, right? It's like you put on those Adidas strong prime 2 Johns and you're not taking any of the damage that someone who might be a little bit more mechanically resilient or have the bigger capacity to like take on this bigger event. You can just kind of like do it now. That's true. All right. I have a list of questions I'm going to hold myself back. Start doing them. No. No. I want to go out of order and it's going to mess me up. Let's go. I don't have any written down. It's all just in my head. So we don't do that here. Are you a writer downer? Big time writer downer. That was always our thing. That was always a race brain thing. I'd be prepped, ready to roll, 90 minutes of prep. No, not 90 minutes. Sometimes. I haven't written down anything in years. BK shows up. He's like, wait, we got race brain in two minutes. Comes on, just fires off takes. Mouthful of pizza. Red lightning. Yeah. I tell myself to make myself feel better. That's what years of obsessive reading does. Yeah. Just like you have them ready. Have them ready. You think and process quickly. Have you ever taken an IQ test? No. Kirk? Yep. I've never taken one. I don't think anyone was curious about what my IQ was. We all want to know. No. Do you remember what your score was? Very high. I'm not surprised. No, they actually, when I was super sick back in the day, I went through this litany of tests at the Mayo Clinic. And this was like in my mold exposure days. And they took me and I actually had an administered by a psychiatrist. And it was like a three hour IQ test. And guess what? I finished in the 99.9 percentile. And they give you a number and they give you a letter and you have to say them in numerical and alphabetical order. So they may say 3Z and then you repeat 3Z. Then they may say 3 1 BZ and you have to be like 1 3 BZ. And then they continue to add all the way until you... 1 BZ. Oh, like Simon? Correct. And then it might be like 1 9 3 BZ X. And then you got to be like, and then you have a timer on it when you have to recall. And I broke the test. What? Yeah. I got all the way to the finish line. You're nice at Simon like that? It was like 12 letters and numbers or something. It was like 24 or something. And they're like, you're done. You're like, go all up high. You can just keep going. No, I don't know that. But I was impressed with myself at the time. But anyways, it was high. It was high. Nice. What's up? But let's move on. So what I'm... My test was inconclusive. Yeah. The one you took on the internet? It has six questions in it. That's it. Like smarter not. Yeah. You guys remember hotter not back in the day? Do you remember that? Were you on that? That sounds like a crook app. All of us in college, like it was that stupid. It was a website. Anyway, so what I'm hoping to do is help people. There's this huge shift towards people either coming from just pure running, a strength background, an OCR background that are like, you can't get away from high rocks now. The sport has done it. And you've been a part of that upbringing, right? Because you've committed early and you're part of the crew that people got invested in following and successes and failures have been along for the ride. And I think you have a lot of buy-in and emotional investment from people who follow, like they want to see you win. You're like one of the people's champs, right? There's a host of you and I say you would be in that group. And so, yeah, well, you've earned it, right? And so what I'm getting at is there's a bunch of people that are trying to figure this out. And you know that. You have podcasts about it, right? On our mark. I think there's a whole sector of our listeners that don't listen to you guys. We'll cross over. Right. And so helping to understand the progression, for example, of where you started, the learnings along the way, and what it sort of took for you to, no matter what the background, what it took for you to zero in on how to get better at this sport, right? You have a lot of life and training lessons over the last year. Your first Hyrox was four years ago? 21. So yes. Four years ago? Yeah. I don't need anything written down. You got it, dude. IQ. Four years ago. It's really complicated. So take me back to year one learnings from, let's call it a primary endurance background. I know you learned things in OCR. That's a slap in the face if you just come from. And I know you have a CrossFit background too. Like you did time in the gym. So you had the components-ish, right? What were the early learn"
}