{
  "text": "No matter if you have a VO2 max of 85, if you're 220 and 5'10\", you're probably not running fast. Sorry. Even though you have the best engine on the planet, right? And so it's always like that balance, like is there really a formula there? People break the mold. You look at Dylan, of course, but then you look at the athlete on the opposite end. So I guess I don't have an answer for it either. I just find it intriguing that you told me that you roughly weigh the same as you did in your OCR days, but appearance-wise, I wouldn't have guessed that. And so I don't know, just something that I haven't pinpointed yet personally. Bracken, have you pinpointed that answer? No, no. It's because you have to be able to put out. Either way, whether you can squat 500 or 155, you have to be able to work hard for an hour. And Dylan, every single movement is going to cost him a higher percentage of his max, which is going to cost him less than the guy next to him who it's costing him less percentage of his max, but costs him more every time he has to rep it. I think there's some minimal strength work needed to be able to structurally handle the work, but I just can't. We've tried numbers before. We've said numbers, but it's like saying, what 5K do you need for OCR success? Right. That was the next question I was going to ask, actually, is if you were to take the top 10 high rocks athletes in the world, men and women, maybe, of course, you probably know men a little bit better, but what do you think the slowest 5K and the fastest 5K, if you were to put you all on a start line, I'm not even asking for names, what do you think it would be? What do you think the slowest 5K top 10er and the fastest 5K top 10er would run right now? We actually did get a cool example of this last year because Ronkovich ran a 5K like the week after Worlds, and granted, he just won Worlds, right? So he's probably like, this race matters to me, zero. So maybe he could put out a little bit more. But he ran 16 flat on a track the week after. He was in spikes. He was like going for it. And the way he was talking about how fast he was going to run, 16 flat was a little disappointing. But looking at him, and if I didn't know what he was saying, I was at 16 flat, it's like pretty good. Really good. Where the slowest top 10. So he would be the fastest? I mean, what do you think? Well, he was the fastest high rocks athlete. I would smoke him. You could do that in your sleep. What would Palayo run in a 5K? Palayo would probably be like 15.30. What about you right now? Yeah, probably around there. Maybe a little bit faster. I'm not sure. It depends on sea level. What about like, what could, oh, I don't know. Watson's not top 10, but he's 15. If you say someone who leans on stations, well, let's say Hunter. What do you think Hunter can run? Can he do 16 flat? He'll tell you. But can he? Yeah. Well, what can, let's say, Graham Holiday run? Yeah, Graham Holiday, John Wynn. Colin Steefer. Colin Steefer. Yeah, if those dudes ran 16.20, I would think that would be pretty good. Really good. Better question. Colin really improved his running. Do you think asking, just looking at time domain, and we don't have these metrics readily available to us and they're much harder to test, but would you say like, what's your marathon? Would that be even less indicative or more indicative than a 5K or a half even? Less? Yeah, to me, I mean, for me, a marathon is just, I mean, it's like the pace that you're running is kind of, for me anyway, is pretty close to marathon pace. It's like what your marathon pace would, but over the course of two hours and change, like it's just like kind of a different thing. Don't you love when like an athlete's newer to this and you prescribe them something like, let's say you're 90 seconds on station work, just something approachable, but whatever. And they're like, should I be running like 5K pace for this 90 seconds? And you're like, you tell them like, let's work, let's start a marathon pace and see, and they think it's so slow. Like it's only 90 seconds of running or I'm only running four minutes at a time. And they look at you like, are you sure about that? Like, at best, you're going to be running a marathon pace during this thing for your first couple of go rounds. It's like so hard for people to wrap their head around. I always get amused. That conversation happens almost with everybody. When they say 5K pace, like you don't really know what 5K pace feels like. You don't want to do it at 5K pace. It's not something you want. No athlete ever asked, can I do this at 5K pace if the option was slower? For sure. No track guy ever pushed for more 5K reps. I remember when you prescribed, Rich might have had this prescribed back in our leaderboard days. You prescribed OCR 200s and the indicator was 10K pace and we were only running 200 meters. And I was like, this guy doesn't know what the heck he's talking about. It's 200 meters. I'm running 200 meters at six mile pace. This guy's an idiot. I got into that session. I understood. Yeah. Stuff gets real fast. The first 200 was a joke. And after that and the station work and now you're whatever, they were like 1200s in total. Compromised 10K pace is nasty. What happened to Burpee 10K? We still doing that? That was COVID. Bring it back. We were getting something to the people. Were you the champion or was Godette the champion? Godette beat me, sandbagged. He waited till I went. I got second and third in the beer mile. Freaking Bauer beat me in the beer mile. Unbelievable. That was his only beer of that decade. For sure. Shut up. He was wearing gloves. So with all this being said, you've identified pieces of why you're successful right now. But there's always like the binding pieces to that. Whether it's headspace, whether it's perspective, whether it's confidence, whether it is just getting race experience. Why are you so successful right now? This is your longest stretch of, in your words, good racing in a row. And it's the highest you've ever been ranked in the sport. I don't care which ranking system you subscribe to. And it's got to be, if there were Vegas odds, this would be the highest you've ever had to make the podium at Worlds. And you'd be on the list for odds at a win. You're at a place right now where you're as high as you've ever been and successful as you've ever been. And you're old for a running job. For an athlete. I would kill to be back at 39. Not old for a person. Old for an athlete. So why? What has all come together? With the whole process of figuring out what's working physically and all the nuance of the paces and the heart rate and needing to, like what effort needs to be there, what moves need to be there. None of it matters if I wasn't able to come and perform that day. So I started taking my recovery a lot more seriously. And I think that's just like, because I got to that point, it's like I've tried doing more. I've tried doing more these past two or three years and I can only do one other thing now and that's do less. So doing less has actually yielded just like such better results. And like I feel happier. I feel like I'm recovering. I'm sleeping well. Like nutrition is no problem. Like body composition is great. Like I'm not like fighting against all these factors because I'm just like overworked and stressed, which I think has like, if this was 10 years ago, would I have gone the route of doing less? Like probably not, you know? So I think it's a little bit of the byproduct of the age and like having enough experience and maturity as an athlete to understand like sometimes I'm going to want to do like something I don't necessarily feel like I should be doing to get better results. So like doing less has yielded better results. Specifically, what does taking recovery more serious look like to you? So one major shift I made was I started taking complete rest before my key quality session. Like no matter what, like I've taken a complete rest day where I'm just chilling. So I get to that quality session. I have two. I have one that's like the most important for me and I'm ready. Like by the end of my off day, I'm like excited for this workout where in previous cycles, I would just be like, okay, it's a workout. I'm going to be able to accomplish it. I'm going to be able to do it, but I'm not like looking forward to it. And now I always look forward to this quality session. I'm always confident I'm going to hit it. So I get like this physical rest, which leads to like this mental recovery so I can come into this event and just like know, come into like a workout and know it's going to go well. So it's given them a high level of confidence too. Like rest day as in nothing"
}