{
  "episodeNumber": "521",
  "title": "Rich ryan",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. Whether you are a brand new runner or you already have a great mustache, we're here to help you increase your running knowledge and present it at a practical level. This is The Running Public. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. So I'm the only one without any control over this environment. Yeah. Just with what you say. You only control every word. BK and I are operating everything else. I logged in today and he removed me from the session immediately, just as a power play. The same joke to Kirk too. Yeah, you moved me all around and got rid of me. It's not cool, guys. When's the last time that you guys recorded a podcast together? I don't know. It's been some time. We did a random race brain. We just stopped doing race brain for like a month. Then we came back and we're like, all right, let's just kind of have that and just talk about what we're going to do. And they're like, yeah, we might do race brain from moving forward. And we just haven't. That was probably three months ago? It was February, I remember. Yeah, it was creeping on it. Oh. So I saw him yesterday, but not for a podcast. We speak frequently, but we don't record them as often. So I've pried Bracken a few times during episodes. Now I've asked you a couple of times, haven't I, Bracken? Or was this off record when I've asked you about like, what's going on with race brain? One time on air, you asked me and I gave like a really fuzzy answer. Is it going to keep it that way? No, we got him here. Grill him. Well, the floor is yours. I know nothing. Kirk, you're still in the logo. With a man bun, which was like four years ago. That was COVID. Is that coming back? No. That was it? Have you ever grown out your hair, Rich? And Bracken, I know the answer to that. I wish. Yeah, I grew my hair out. Back in high school, it would go out big, kind of fro style. But no, I'm not growing the hair out now is not what anybody wants. But you're still in the logo. I actually went on the YouTube today and saw you on there. We're all on there. And I was like, all right, we got to get rid of this. So we're on the last stages of the old race brain. So now race brain as a podcast, how it started, right? We were wanting to touch on the sport of OCR mostly, right? So most of the conversations that we're having were based around what was happening within the inner workings of the sport, how the national series was going, what the matchups are going to be, what the narrative and everything was, what everything means. Just kind of giving more context for the fandom of the sport. OCR as a sport doesn't exist the way that it once had. So my fandom in particular definitely started to dwindle. And just like the conversations started to shift a little bit more into High Rocks Hybrid. And then we saw that there was this opportunity to really double down on the High Rocks side of things. But how race brain existed where most of our audience were OCR fans, and we weren't talking about OCR enough really to feel like we were serving them. We weren't talking about High Rocks enough to feel like we were able to grow and serve that audience. So we were kind of in this weird gray spot that we needed to then either pivot or just find something else to do that will be a little bit more productive. So we chose the latter. Race brain exists now. And actually we just launched something that was cool yesterday. So race brain is going to exist more like as a media platform now where there's going to be multiple verticals of content that is mostly going to cover hybrid with the option to do still OCR. But we have a High Rocks show. We have a YouTube show that kind of gives the news. We just launched our website yesterday to give like blog articles. We do like newsletter and just like do some reviews, a lot like just being a lot more broad as opposed to being just like one podcast about OCR. So there's YouTube stuff out there right now. YouTube stuff's out there. All right. That makes sense. One of our final episodes prior to it, Rich, Jack, and I talked and we all kind of agreed that A, we were forcing it. We were trying to do drafts and half the people had never made a podium in their life. Three quarters of the people had never made a podium. Not that they are unimportant. They do now. It's not compelling conversation when we don't know anything about them. And we also were just getting so overwhelmingly negative. It was starting to become like a bad mood thing where we would just complain. It used to be we would complain, offer suggestions, and balance it out with like love of the sport. And now our love of the sport was coming out sideways. And it was getting negative and we didn't like it. And we were dedicating time each week to being negative. And that was kind of like for me, that was my selling point. I'm obviously less in the high rocks world than like Rich is entrenched in it. Jack and I are less so, but it was an opportunity to be excited about a sport rather than be depressed by it. Yeah. There has to be a positive, alive passion for what you are going to show up and talk about every week or twice a week in our case. If it's not a positive and it's not a passion and it's slowly dying, aka OCR. Rich, when's the last OCR you ran? Exactly. Yeah. It's tough to string it out. And pretty soon when the listeners can feel it, it's probably time. I think they tolerate negativity when it is a small percentage that's balanced out and kind of justified by all the other things you do well or positive. And we had less and less and less of that to even balance it out. And we just kind of felt we just got on and complained to the wall every week. Yeah. There's a point where, and I think where we kind of justified it a lot is like, okay, we're being critical to provide like a different lens to look this through to try to help improve things. And then we were just, we realized that we were being critical because we were just unhappy and dissatisfied with it. And it's like, why do we need to be, we don't need to share this. We don't need to record this and broadcast this out. So there's still space for what we were doing in terms of like what we started as like a brand and like a voice that I still believe in, but just like how we're going to deliver that and making it a little bit more, like much more broad and a little bit more systematic in terms of like an actual media entity is kind of now where the pivot's gone. Like we talked about being like, oh, maybe we'll just do like a round table show, make it a little bit more like YouTube centric. But we all wanted to do things that we were like passionate with instead of like trying to just like hang on to something because we had done it for so long. Like what is it? The sunk cost fallacy, right? We had like sunk time fallacy on that where it's just like, this is, we did this and it's over. There's nothing that the past can really give us now. So we have to figure out where to go now. I would like to think I just had a year foresight on you guys, but that's not the case whatsoever. I'm out of here. No, there was no writing on the wall. But the ironic thing about what you both are saying is that Bracken, Rich, Jack, all inherently positive, glass half full, super pleasant, level-headed people. And it's funny that even something that you see that you love and have a passion for and are unhappy with then can feel like it's displayed. I don't know, the other side of your potential personality. I don't look at you that way at all. None of you guys. That's just interesting to me. That's so nice of you. Thank you. Well, it's true. Well, there's truth to the fact that like nothing can withdraw true hatred like love. You know, like if you feel something so strongly, the opposite side comes out when that gets betrayed. And that's how we all felt. Like we felt betrayed, but we can save him. We can fix him. And eventually we just realized they don't want to be saved. It's part of growing up. Can't save everybody. Can't save everyone. Well, Rich, you're our guest on this podcast today. And people might be confused who listen to the circle of this and RMR and such. They're like, what feed is this on? Maybe it's on both. But I told Bracken last week, I said, I want to chat with Rich. Did I not, Bracken? Was it last week? I'm hazy on time, but you did say that. And then he put it together. I've been wanting to chat with you in like an actual podcast, non-BS style for like a while now, since you've had successes, ups and downs. And we haven't chatted with you since when? It's been some time. I've been on the show a bunch. Coaching series? Am I still a record holder? I've done like six. If you're six, you've got it. If you're four, you've got it. Hunter's had four. It's been so many sort of metabolic something that I don't understand that has to do with riding a line or being able to breach and come back. Bracken breach and come back all day, for example. Hmm. I'm terrible at riding a line. Yeah. I guess. So like in terms of like if you're looking at physiologically like in that respect, like if you spike, right, BK, like say you're spiking, we'll talk about lactate here, right? If your lactate levels rise, do you think it's like tolerance that you have more than like ability to flush? Like where Kirk and I would sit there and just flush out over and over? Or do you think it's like the opposite? Like you can flush very quickly or as opposed and maybe we are mechanically and aerobically fit enough that we're not like we can go fast enough without like producing that type of byproduct. I've always thought I was bad at tolerance of lactate, but I thought I didn't produce it disproportionately in any other form of locomotion. Like I wasn't a great cyclist, but I could cycle as well as I could run. And I'm not a great rower, but I can row like a 1545K runner without like my fitness translates to other things. I'm not a, I don't run a lot of technical trails or descents because we don't have that around here a ton, but I can do that as well as I can flat run or maybe a little better. But if I have to do it for an hour straight, I can't hold that line. I think I'm just good at pivoting from thing to thing and it doesn't spike when I pivot. Where other people, I think they are super efficient at handling it in a movement and then another movement, they're not as efficient at. I think across the board, I'm moderately okay at it, but in a sport that shifts you from thing to thing a lot, it looks better. So do you think it could be more of a literal mechanical efficiency thing in certain planes of movements? And when that is, other movement is required, it's as simple as that? Or is it actually lactate or whatever we want to talk about that's flowing through our blood? I wonder. It's just an interesting thing because you'd think it would translate, but why is an Olympic swimmer a 21K5K runner? 21-minute 5K runner, which exists, by the way. I'm sure. Like Rich, what are you better at your entire life? Were you better at long runs and tempos or interval sets? Interval sets. I'm mid-distance, baby. Okay, and that was me. My interval sets, I could interval set without overextending against people significantly better than me at running. But I would run my threshold runs or long runs and get stomped by people that I was way better than at mid-distance. Like I can't hold a steady effort. Well, we would think that would be aerobic fitness or some sort of mechanical breakdown in terms of just fatigue. Well, I think that's the key. I believe the strongest aerobic capacity people do great at high rocks. I think engine matters more than being able to spike it. I think speed, this is now a shift that I have made this season because I was there too. It was like, who can do the most? Where's the volume? What's the capacity to handle all of these different elements and being able to spread it across all these modalities so that you can build this massive floor, raise the floor like crazy. But now this event where it's like dipping into low 50s, right? It's like we're kind of shifting faster and faster. So I think the speed now and the efficiency, the movement piece I think is really important and one that is like going to be a separator because now we're at that point where everyone's kind of as fit as each other, right? But now it's like where can we see the margins in terms of explosive power and just like movement quality? Who can run well? Who can run well without taking like without it costing them? And yet if you look at the marathon, that's the same story now, right? Like the three top finishers at London this past weekend for the women where the marathon world record fell had 800-meter PRs of in order first, second, third, 159, 56, 2 flat or 201. Like these are now, it's the same thing. It is an aerobic capacity event until everyone's maxed that out and then it returns back down to who can spike the best? Who is the most efficient fast? But I think the precursor is the capacity. Well now, is this training methodology or is it tech, right? Because that was the rub on some mid-distance before, right? It's like you put on those Adidas strong prime 2 Johns and you're not taking any of the damage that someone who might be a little bit more mechanically resilient or have the bigger capacity to like take on this bigger event. You can just kind of like do it now. That's true. All right. I have a list of questions I'm going to hold myself back. I want to. No, no. I want to go out of order and it's going to mess me up. Let's go. I don't have any written down. This is all just in my head. So we don't do that here. Are you a writer downer? Big time writer downer. That was always our thing. That was always a race brain thing. I'd be prepped, ready to roll, 90 minutes of prep. No, not 90 minutes. Sometimes. I haven't written down anything in years. BK shows up. He's like, wait, we got race brain in two minutes. Comes on, just fires off takes. Mouthful of pizza. Red lightning. Yeah. I tell myself to make myself feel better. That's what years of obsessive reading does. Yeah. Just like you have them ready. You think and process quickly. Have you ever taken an IQ test? No. Kirk? Yep. I've never taken one. I don't think anyone was curious about what my IQ was. We all want to know. No. Do you remember what your score was? Very high. I'm not surprised. No, they actually, when I was super sick back in the day, I went through this litany of tests at the Mayo Clinic. And this was like in my mold exposure days. And they took me and I actually had an administered by a psychiatrist. And it was like a three hour IQ test. And guess what? I finished in the 99.9 percentile. And they give you a number and they give you a letter and you have to say them in numerical and alphabetical order. So they may say 3Z and then you repeat 3Z. Then they may say 3 1 BZ and you have to be like 1 3 BZ. And then they continue to add all the way until you. 1 BZ. Oh, like Simon? Correct. And then it might be like 1 9 3 BZ X. And then you got to be like, and then you have a timer on it when you have to recall. And I broke the test. What? Yeah. I got all the way to the finish line. You're nice at Simon like that? It was like 12 letters and numbers or something. It was like 24 or something. And they're like, you're done. You're like all up high. You can just keep going. No, I don't know that. But I was impressed with myself at the time. But anyways, it was high. It was high. What's up? But let's move on. So what I'm. My test was inconclusive. Yeah. The one you took on the internet. It has six questions in it. That's it. Like smarter not. Yeah. You guys remember hotter not back in the day? Do you remember that? Were you on that? That sounds like a Kirk app. All of us in college. Like it was that stupid. It was a website. Anyway, so what I'm hoping to do is help people. There's this huge shift towards people either coming from just pure running, a strength background, an OCR background that are like, you can't get away from high rocks now. The sport has done it. And you've been a part of that upbringing, right? Because you've committed early and you're part of the crew that people got invested in following and successes and failures have been along for the ride. And I think you have a lot of buy-in and emotional investment from people who follow. Like they want to see you win. You're like one of the people's champs, right? There's a host of you. And I say you would be in that group. And so, yeah, well, you've earned it, right? And so what I'm getting at is there's a bunch of people that are trying to figure this out. And you know that. You have podcasts about it, right? On our mark. I think there's a whole sector of our listeners that don't listen to you guys. We'll cross over. Right. And so helping to understand the progression, for example, of where you started, the learnings along the way, and what it sort of took for you to, no matter what the background, what it took for you to zero in on how to get better at this sport, right? You have a lot of life and training lessons over the last year. Your first Hyrox was four years ago? 21. So, yes. Four years ago? Yeah. Because I don't need anything written down. You got it, dude. IQ. Four years ago. It's really complicated. So take me back to year one learnings from, let's call it a primary endurance background. I know you learned things in OCR. That's a slap in the face if you just come from. And I know you have a CrossFit background too. Like you did time in the gym. So you had the components-ish, right? What were that early. I speak for myself on that end. But the totality of this race was that the race was breaking people down much more. And now I think there's a lot more information available. So many people have done this race now that we can kind of understand how to get as prepared for it as we need to on that first go. And that it is really serious and it will take you down if you're not incredibly prepared for it. So I don't think people experience it as much now unless they're just underprepared. Throughout this time, you've been at kind of the forefront of thinking about how to train for a hybrid sport. And you have that background of a 4.14 high school miler, a D1 college runner. You have running chops. You understand the physiological cost nature, how to just go along about becoming a good endurance athlete. And then you had your CrossFit days of figuring out and learning that from a strength and a metabolic conditioning standpoint. And you got to this and you did OCR training plus CrossFit. And then you started a hybrid approach to it. And correct me if I'm wrong, but how I remember the progression going was I need to get my puns in. And then it turned into I need to get just more nasty work in to be able to handle what the first half of the race does to me. And then it was I need more volume. I just need more volume. And those two may have been switched. And then it was I need to just accumulate as much threshold time as possible. And then you kind of backed off on some things. And throughout this time, you had been like not boom or bust, but as you would talk, you'd always say like I have a good race and I have a bad race. And you've now strung together races. So you were going along the road of figuring out what works for this sport, but also through your own personal lens. So what were those steps? Early on, it was muscular fatigue. It was muscular endurance. It was muscular breakdown. What was next? So, yes, to address that. So after that race happened in 67 in Orlando, or back when I was down racing as well, and then 68 in that next race in Chicago. So I just had like a little bit of like I didn't I had poor grip. I just didn't race as well. I just made some mistakes, whatever. So from the six months from that 68 to the next race, I dropped to like a 60 low. I think it was like 60 10 or something like that. So I took like seven minutes off of this time by addressing the duration. Like I was like, okay, I need to set myself in this spot and kind of do like longer tempo efforts moving in and out of station work. So accumulating a lot more volume in the station work and accumulating a lot more volume just with output. So I would do one of those a week and then I would do I was actually doing incline running at the time because I had I was nursing an injury after that first season. Yeah, what was that injury? I remember that, but I'm forgetting what it was. It was like hip, like knee issues. Then I had something in my like sacrum, I think that actually that put me down for a minute. So I was doing a lot more incline running to bring it back. So I started doing incline intervals. And as I was doing these incline intervals, I was doing them longer than I would typically do on flat because just like the work rate is just like a little slower. So I was just like building more and more volume. So I think I got up to like four by 10 minutes of incline running, which at threshold in hindsight, I was doing longer threshold intervals where I thought I was just kind of like doing longer hill repeats. So the combination of those two pieces worked really well to sure up my ability to work well in the beginning without overdoing it and finishing strong. I actually and then I had a the time to kind of reflect on how to do the race. And strategically, I was able to kind of share some things up as well. It's like, okay, I need to take it easy here and take it easy here and to make sure that when I get through it, I can still put out a little bit more. So it's a lot more conservative upfront. And that took a ton of time off of my finishing high rocks with combination of that. So after that, that worked well, right? But then Bracken, as you said, I think shortly after there, we really started to get in on this like threshold, double threshold movements and like looking at it from what's happening broadly in endurance. It's like, okay, cool. Like let's try to accumulate as much work at anaerobic threshold, at threshold as possible. And that should translate well because that's kind of what these race demands are. So the thoughts with double threshold, so I started doing double threshold, right? Where it'd be like Tuesday and Friday, there'd be two different quality sessions, both at like that threshold area. One would be like run specific and one would be kind of mixed modality. And this, I don't felt like worked that well for me for a couple reasons. There, one, I think it's just too much for me. I mean, I'm 39. I'm older in the athletic cycle. And I think just having back-to-back quality sessions just like wrecked the rest of my week and hurt both quality sessions, right? Like I don't think I was ever really getting to where I needed to go. So I think overtraining really became a thing. And also for me, I need to accumulate time in anaerobic threshold, not in terms of frequency, but in terms of density. I need to have a big chunk of time where I'm just like sitting in it. And that's how I respond best. Whether it's like, if I can get like whatever, 100 minutes over the course of the week in four sessions, but like doing three or four minutes at a time, it's way less effective than if I was doing 30 or 40 minutes at a time, maybe getting 80 minutes throughout the course of the week. So can I pause you really quick? Sorry. Just to make sure that everybody's observing what you're saying. And again, this is Rich's stories. It may not be your story, athlete listening right now. But so the first big jump from like 67 to 60 flat, in hindsight, you were spending more time at output because you were stuck on the uphill treadmill. And so looking back, you were spending a little bit more time putting out, we will call it. And then you expanded just the overall, let's say time demands of your Metcon type high rock sessions, right? So both of those things maybe, and then some acumen on course as well, but it all combined, right? And then from there, you talk about... I want to pause you actually and just make one quick point. We'll pause. Those long tempo sessions that he talked about going in and out of running and stations, I believe build race acumen really well. Yeah. Because you get 20, 30, 40 minutes in and you get sluggish or a little dull and you start figuring out how do I get more efficient on transitions? Or I can't over grip this for 40 minutes. And I think that replaces some of that sim work or race work people did. Real quick, boys. I got a workout later. I'm going to take in some bicarb while we're talking. Oh, let's know. I want to see what's going on here. If you don't mind. I feel like I'm watching David Roach. Who's unpaused? Is it me or is it Kurt? Oh, no. Is this just a goop? Kurt paused you. I double stamped his pause myself. And now he's back to unpaused while you're still paused. I'm still paused. Okay. So that looks like hand sanitizer with little bubbles in it. Have you not tried this? No. I don't cheat. Doesn't like the Rebellion Pro. I will cheat. I'm just not fit enough to bother yet. Once I get closer to race specific work, then it's time. This is important. It's 1.30 our time, 12.30 your time. What time is your session? What time are you hoping to be training at? Like 2, 2.30. Okay. So I'm just wondering your time to... Hour and a half is pretty solid. Yeah. For the bicarb or for the conversation? Bicarb. Yes. Both. Conversation is limitless. All right, Kirk, unpause. I just want to talk about... Because I've watched Rich have some clerical errors on course in Orlando. Everybody does. Yeah. I had gloves to wear for the pole and I was like, man, I was warming up with Bracken and Megida. And I was like, I had these receiver gloves and we all know BK. He has his own line of them. I was like, should I wear these things? He was like, no downside. And then I get to Farmer's Carry. My hands are so sweaty. I can't even... I can't pick it up for one second. I take the gloves off. My hands are pouring sweat. I had like a four and a half minute Farmer's Carry. So some downside. Potential downside. If you're a hand sweater... I didn't know about this about... I didn't have all the information. I didn't have all the information. Anyway, the long tempos force you to get efficient at things because you're just tired. So unshun. Continue, Kirk. How many times have I been unpaused? It's been the same, but you just haven't started up. So I just keep talking. Well, I'm just being patient. Unpause. All right. Then we fast forward to double threshold five minutes of work, where it would just be like pretty just continuous, like 800 meter run, 37 to 50 meter sled push, 800 meter run, sled pull, 800 meter run, burpee broad jumps, just do that. Right. And just keep that in succession, build some volume. And like I would rotate that out. So sometimes it'd be lunges, sometimes it'd be the row, any like things that would give me like specific problems or anything that I wanted to feel like later in the race. What sort of intensity? Like starting at like seven out of 10, like marathon tempo type intensity and letting that kind of that fatigue build. This is when you were starting to improve before you popped that 60, we'll call it. That's what you found is like a good winning formula at that point. And I think that's incredibly effective. I think that works really well for beginners just to understand the pace of it all. Like what minute five is going to do to minute 40 is it's just like really helpful to have that. So you're talking if you had to put metrics like starting around aerobic threshold and letting the fatigue take you over by the end or were you sticking at high end aerobic the whole time? No, I was definitely going over at a point, right? Like the pace wasn't super fast, but the feeling and the fatigue from the muscular side, I think was just like, so like it would get harder, but I'd get like a little slower in those times. So yeah, I'd say probably finishing right under like anaerobic threshold feeling. Okay. For sure. Then like the double threshold years, it would be like morning would be, I don't know, 12 by 90 seconds on skier with 45 second rest, something like that, right? I like the shorter pieces on the machines just because like muscularly it will be taxing eventually. And then the afternoon could be something like straight up threshold run, could be whatever four to five by 1600 with a minute rest, or it could be something more high rocksy where it's like three by 10 minutes at like 600 meter run, burpees, lunges, rest two minutes type of thing. But usually the morning was either some sort of machine or some sort of mixed modality or some sort of like, I guess it's not mixed modality, but it would be like straight sets of like, I would do like six by 60 second ski, six by 60 second row, six by 60 second run, for example. So hitting all the modalities, but putting them, but having them be like isolated. And that was pretty, and then, you know, I would work some sort of longer, maybe one or two longer workouts or just like one longer workout per week, maybe, depending on where I was in terms of the competition season. And so now I've been playing around with a couple of different varieties of this. And one thing that I've taken out of these like tempo runs are like the repeated sleds, because I just think that if you're going to do the sleds, you should do them with intensity and with speed and with power. And then ultimately, if like we're doing it 40 minutes into a workout, we're just gonna be so exhausted that like we're not getting, we're like, we're getting some stimulus in terms of fatigue building from the sled, but it's not specific. And you're just like training yourself to work kind of slow on the sled. So I kind of use the sled for like speed work only now. So I don't really put it in like these type of pieces. So it would be something, I really like the echo bike for this type of thing, just to keep stimulus up. It'll be similar format, but just with like shorter chunks of station work. I have something written. I have one for my session this afternoon. I'll give you a little piece of it. Sure. A little piece of my session this afternoon. So you have like a quality session prescribed for yourself today? Yeah, man. If I was eating bicarbs like every day, just every session, zone two, bicarb. Hey, some probably do. I carb in alphas, easy run. No. Oh, making a post about it. So I've actually started to blend. So one thing I've gone away from is isolated like track sessions, like speed sessions that are just running. For the sake of getting the density of volume in one shot. So I used to be able to split that, right? I was like, okay, I got my run work here and get my station work here. Now I've just like combined that session. So today I'm going to do like a straight up threshold run session upfront. And then I'm going to finish with a 28 minute EMOM where it's going to be. So, okay. So it's three by two mile is what I'm doing today with, I'm just going to do one minute rest. And then two minute rest into a 28 minute EMOM where it's a zero to three minutes is 52 cows in the echo bike. Minute three to four is 20 meter burpee broad jump. Minute four to five is 20 wall balls. I'll probably go heavy. I'll probably do 25. And then minute five to seven is going to be 50 meters walking. So what this is going to do is get my heart rate at that anaerobic threshold, like quickly within that first interval of run. And so that 28 minute EMOM, I know that the duration and volume of each of one of these movements is going to be high enough that I'm able to keep my heart rate at that effort and not so high that it's going to burn me out. So you're running through that four times. How did you land on those specifically versus, I don't know, you didn't say ski or something. So I like the, for this one in particular, I like the echo bike so that it keeps me in the game. Like skierg and row are just kind of exhausting. They're just like a little bit too hard sometimes. So I've tried this and I get that and I'm exhausted trying to get into the other movement. So more is just like more hittable, honestly. And same with all the other pieces, right? Like I like burpee broad jumps and wall balls in particular because the heart rate response is favorable. Like you can stay in a good spot, like it will go up. Where other things like farmers or like walking or sometimes walking lunges even, like things can kind of dip down just because the work rate is so much slower. So I've just found these to be like doable at a higher effort. So you went down to Austin, Texas, hung out with Nick Bear. Sure did. And you met an athlete I've been working with for five years, Simon Diaz. That's my boy. Simon's the guy. Well, technically he's my boy. That's true. We'll have that conversation later. But I thought it was funny because I had prescribed him like a mile buy-in session with Hyrox finisher that day. I think he had, he might've had like a mile buy-in cash out or he had three by a mile and then his hybrid work. And you guys all went down and hit a session together. And he told me what you guys did. I'm like, yeah, do what they're doing. Are you kidding me? Don't worry about my stupid workout. Go hang out with the boys and like get it done. And what did you do? You did like a mile buy-in and it was like very similar to what I was like, I couldn't have worked out any better. Are you often doing, so anyway, so big fan of that philosophy point being. Do you believe, do you always like the run uninhibited in the beginning? Do you ever, are you ever interested in the cash out scenario or vice versa? Have you played around with that? I have thoughts on it myself, but I'm just curious what your learnings are. So when I will flip it, it will, with the intent, the finisher will be at like more like tempo, right? One steady state as opposed to interval based. And the intention will be at potentially Hyrox race pace or more like marathon pace. Like just the output is going to be much lower. Like intuitively I've tried to do it before where I'm like, all right, I'm going to rip 35 minutes on this echo bike. Then I'm gonna go do some threshold intervals. And it just like, I just exploded into pieces. So you get the same type of benefit on, but just at a lower output. So it depends on what my intent is for the workout. But yeah, I do like that. Okay. So you've gone 67 down to 54 using this process. Now along the way, it's always hard to tell if it's because of or despite. So if you took what you know now and you went back to day one, could you pick up with what you know now doing this? Or would there still be need for precursor work to get to the point where you don't need standalone run or erg sessions or as much anymore? How much of this is universal and how much of this is athlete training life and experience? Right. Like what steps could be skipped in this process? Yeah. What was not needed and what was absolutely necessary but not best practice for performance? So another thing I guess I didn't touch on here is I went through two different bulking cycles where I was like, I'm putting on weight so that I can put on muscle, right? And that step was very helpful. As Kirk asked in the beginning, it's like, how much muscle do you have on now compared to where you were? And I look much more muscular and I'm much stronger, but I went through this phase where I was carrying a little bit more body fat so I could get a little bit stronger. And then I'm at the point now where I can be leaner and still be as strong. No matter if you have a VO2 max of 85, if you're 220 and 5'10\", you're probably not running fast. Sorry. Even though you have the best engine on the planet, right? And so it's always like that balance, like is there really a formula there? People break the mold. You look at Dylan, of course, but then you look at the athlete on the opposite end. So I guess I don't have an answer for it either. I just find it intriguing that you told me that you roughly weigh the same as you did in your OCR days, but appearance-wise, I wouldn't have guessed that. And so I don't know, just something that I haven't pinpointed yet personally. Bracken, have you pinpointed that answer? No, no. It's because you have to be able to put out either way. Whether you can squat 500 or 155, you have to be able to work hard for an hour. And Dylan, it's every single movement is going to cost him a higher percentage of his max, which is going to cost him less than the guy next to him who it's costing him less percentage of his max, but cost him more every time he has to rep it. I think there's some minimal strength work needed to be able to structurally handle the work, but I just can't. We've tried numbers before. We've said numbers, but it's like saying what 5K do you need for OCR success? Right. That was the next question I was going to ask, actually, is if you were to take the top 10 high rocks athletes in the world, men and women, maybe you of course would probably know men a little bit better, but what do you think the slowest 5K and the fastest 5K, if you were to put you all on a start line, I'm not even asking for names, what do you think it would be? What do you think the slowest 5K top 10er and the fastest 5K top 10er would run right now? We actually did get a cool example of this last year because Ronkovich ran a 5K like the week after Worlds. And granted, he might not, he just won Worlds, right? So he's probably like, this race matters to me, zero. So maybe he could put out a little bit more. But he ran 16 flat on a track the week after. He was in spikes. He was like going for it. And the way he was talking about how fast he was going to run, 16 flat was a little disappointing. But looking at him, and if I didn't know what he was saying, I was at 16 flat, it's like pretty good. Really good. Where the slowest top 10. So he would be the fastest? I mean, what do you think? Well, he was the fastest high rocks athlete. I would smoke him. You could do that in your sleep. What would Palayo run in a 5K? Palayo would probably be like 15.30. What about you right now? Yeah, probably around there. Maybe a little bit faster. I'm not sure. It depends on sea level. What about like, what could, oh, I don't know. I mean, Boston's not top 10, but he's 15. If you say someone like, someone who leans on stations. Well, let's say Hunter. What do you think Hunter can run? Can he do 16 flat? He'll tell you. But can he? Yeah. Well, what can, let's say. John Wynn's holiday run. Yeah, Graham Holiday, John Wynn. Colin Stiefer. Colin Stiefer. Yeah, if those dudes ran 16.20, I would think that would be pretty good. Really good. Better question. Colin's really improved his running. Do you think asking, just looking at time domain, and we don't have these metrics readily available to us and they're much harder to test, but would you say like, what's your marathon? Would that be even less indicative or more indicative than a 5K or a half even? Less? Yeah, to me, I mean, for me, a marathon is just, I mean, it's like the pace that you're running is kind of, for me anyway, is pretty close to marathon pace. It's like what your marathon pace would, but over the course of two hours and change, like it's just like kind of a different thing. Don't you love when like an athlete's newer to this and you prescribe them something like, let's say you're 90 seconds on station work, 90, just something approachable, but whatever. And they're like, should I be running like 5K pace for this 90 seconds? And you're like, you tell them like, let's work, let's start a marathon pace and see, and they think it's so slow. Like it's only 90 seconds of running or I'm only running four minutes at a time. And they look at you like, are you sure about that? Like, at best, you're going to be running a marathon pace during this thing for your first couple of go rounds. It's like so hard for people to wrap their head around. I always get amused. That conversation happens almost with everybody. When they say 5K pace, like you don't really know what 5K pace feels like. You don't want to do that at 5K pace. It's not something you want. No athlete ever asked, can I do this at 5K pace if the option was slower? For sure. No track guy ever pushed for more 5K reps. I remember when you prescribed it. Rich might've had this prescribed back in our leaderboard days. You prescribed OCR 200s and the indicator was 10K pace and we were only running 200 meters. And I was like, this guy doesn't know what the heck he's talking about. It's 200 meters. I'm running 200 meters at six mile pace. This guy's an idiot. I got into that session. I understood. Yeah. Stuff gets real fast. The first 200 was a joke. And after that and the station work and now you're whatever, they were like 1200s in total. Compromised 10K pace is nasty. What happened to Burpee 10K? We still doing that? That was COVID. Bring it back. We were getting something to the people. Were you the champion or was Godette the champion? Godette beat me, sandbagged. He waited till I went. I got second and third in the beer mile. Freaking Bauer beat me in the beer mile. Unbelievable. That was his only beer of that decade. For sure. Shut up. He was wearing gloves. So with all this being said, you've identified pieces of why you're successful right now. But there's always like the binding pieces to that. Whether it's headspace, whether it's perspective, whether it's confidence, whether it is just getting race experience. Why are you so successful right now? This is your longest stretch of, in your words, good racing in a row. And it's the highest you've ever been ranked in the sport. I don't care which ranking system you subscribe to. And it's got to be, if there were Vegas odds, this will be the highest you've ever had to make the podium at Worlds. And you'd be on the list for odds at a win. You're at a place right now where you're as high as you've ever been and successful as you've ever been. And you're old for a running job. For an athlete. I would kill to be back at 39. Not old for a person. Old for an athlete. So why? What has all come together? With the whole process of figuring out what's working physically and all the nuance of the paces and the heart rate and needing to, like what effort needs to be there, what moves need to be there. None of it matters if I wasn't able to come and perform that day. So I started taking my recovery a lot more seriously. And I think that's just like, because I got to that point, it's like I've tried doing more. I've tried doing more these past two or three years and I can only do one other thing now and it's do less. So doing less has actually yielded just like such better results. And like, I feel happier. I feel like I'm recovering. I'm sleeping well. Like nutrition's no problem. Like body composition is great. Like I'm not like fighting against all these factors because I'm just like overworked and stressed, which I think has like, if this was 10 years ago, would I have gone the route of doing less? Like probably not, you know? So I think it's a little bit of the byproduct of the age and like being, having enough experience and maturity as an athlete to understand like, sometimes I'm going to want to do like something I don't necessarily feel like I should be doing to get better results. So like doing less has yielded better results. Specifically, what does taking recovery more serious look like to you? So one major shift I made was I started taking complete rest before my key quality session. Like no matter what, like I've taken a complete rest day where I'm just chilling. So I get to that quality session. I have two, I have one that's like the most important for me and I'm ready. Like I, by the end of my off day, I'm like excited for this workout where in previous cycles, I would just be like, okay, it's a workout. I'm going to be able to accomplish it. I'm gonna be able to do it, but I'm not like looking forward to it. And now I always look forward to this quality session. I'm always confident I'm going to hit it. So I get like this physical rest, which leads to like this mental recovery. So I can come into this event and just like know, come into like a workout and know it's going to go"
}