{
  "guid": "4d5ea56e-0493-35d8-a66b-22d90bb79bf0",
  "title": "Training Tuesday: The Best Trail & Mountain Workouts",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. It's Tuesday, folks, and you know what that means, Training Tuesday. We are going to take every rabbit hole, follow tangents, use useless metaphors, get lost in the weeds. This is Training Tuesday. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. Kirk. What? We rarely align on our training schedule. My life schedule and your life schedule are very, very different. However, we are both sitting here just having eaten our pre-workout meal, having our, what I assume you've got your fight milk there with you, and we have a session right after this that we're both trying to squeeze in before the weather rolls through. We are in sync today. To the point where we found out just before this, and I'm way more excited about this than I should be, we ate the exact same thing today. I mean, stars aligning. Kindred spirits, one would say. I told Kirk, I just, he said, you running right after this? I said, almost right after. I just ate two muffins. And he said, I just ate muffins. Well, technically banana bread, but it could have easily been in muffin form. And I had banana nut muffins, and you replied that just put pecans on the top of yours. So we ate the exact same thing at the exact same time without knowing it. And I wouldn't say that either of us would have in the past ever said that's our go-to pre-racer meal, but here we are. I've never done this meal before a hard session, so it's even that far left of center. And now, folks, Bracken and I have aligned on our recording schedule, such as, just know when we record this Training Tuesday episode that immediately after we say bye at the end, we put on our running shoes and we get out and we hit a quality session. So you're not alone out there today, folks, because right after this we hit it. That's going to be our normal weekly schedule now. Bracken came to me last week and he said, hey, Kirk, he said, I'm taking my training seriously. I'm taking it to the next level. He said, I got to get this lined up with my training sessions. So let's pick a time and let's do it every time on the same day, same week, same whatever. And here we are, lined right up. For a little peek behind the curtain for the ladies and gents listening, Thursdays are typically our long-form recording days where we do the weekend long run episode. And we generally start either at noon or noon 30. That's it. That's our window that we start at so that we can be done in time for Kirk to get to the gym and for me to pick up the kids from school. And Mondays or Tuesdays is a floating Training Tuesday recording depending on our schedules. And it usually goes along the line of one of us finally messages the other and says, what time works well for you today? And it's killing us. We know that's not how you should set up life, but it started because we had a time that wasn't working well and we'd constantly message the other and say, hey, can we switch today? I'm sorry to do this. Eventually we just made it a floating meeting, but now I said, listen, I'm struggling fitting things in. I need a little more structure in my life. I need to start prioritizing my workouts. And I said, heck yeah, I couldn't be happier you're asking. Let's do it that way. And you can't forget our issue with timing was that the mistress race brain was in the mix. And it was, we either had to cram it in before or cram it in after. And so we don't deal with that anymore. Yeah. I forgot about that. We don't deal with it as consistently anymore. I don't know what's going on there. We can move on from that. But I wanted to ask you, since you're doing a quality session right after this, and today is about quality sessions, folks. Oh gosh, you got a good one coming your way. What's your session on the docket today? See, for me, I actually need some help because I'm going to do one of two and I still haven't decided. They're going to accomplish the exact same thing. So I will ask you once you're done telling me about yours. Well, like everything I ever do on here, I have to preface this with a way too long explanation. I'm going to try to keep it short. Jack Bauer and I are heading over to Saudi Arabia in a little over, oh, in exactly two weeks. We are rabbiting with cameras a race that's happening over there and we are providing commentary for the race. Well, let me interject. So the last time we chatted about this, it wasn't a done deal and the listeners have no idea. So this went through. It went through. So we're doing this. There's a race that the people that put on the Alula Tough Mudder event are an event company and they are trying to branch out and do more things like that. And they are trying to come up with a very good product here that they can then pitch for future contracts. So Jack more than I, but Jack and I have been helping behind the scenes to try to give tips and advice on how you could set up an obstacle course race so that it's very viewable, still is a good race, but that it's very viewable that you can put on a race that you never lose sight of the leaders or the chase pack and set up the course in a way that it's compelling and has times where people are allowed to run but still brings the race back together at carries and obstacles and things like that. So we're trying to practice a little of what we preached on Race Brain when we complained to companies. We're trying to help this company do that and then in theory help ourselves too and maybe have it just be one of those nice little synergistic unions of people who know what they're talking about or claim to and people that are trying to actually put on the events themselves. So we are going to do that in two weeks, but it's a pretty high-level event. The who's who of OCR have all committed to it and Jack and I have to rabbit the men's and women's races back to back and they're both 10K. So we basically have to do 10K 400 to 800 on rest while we're just going to leapfrog each other at the front. We'll cover the front pack. So I'm just doing a two-week crash course of intervals so that I can definitely have my best chance of keeping up with the front of the race in the heat in the desert. Are there any Americans over there? North Americans? Do you know? Yeah, so Atkins is going for sure and I don't know how many other North Americans are going, but the who's who of the Europeans are going to be there. Yeah, well, we'll get to your workout, but trail viewing is tough. Anything on terrain has always been tough. That's been the hiccup across the board with OCR or just trail in general. And if you don't have rabbits, you have nothing. It's like the only style that works for viewership if you're a stationary viewer, which most at the venues are, is like the flower petal style, right? But you can only do so much with that as well, right? Like coming back in every time, so it's a tough thing. So what's your session you're going to do today then? I assume on terrain. Yeah, so today I'm getting on grassy. We just got a ton of rain all weekend. So I'm going to get on some thicker grass and run 400s. So 400s with 30 seconds rest every fourth buys me a minute. So it'll be 30 seconds rest, 30 seconds rest, 30 seconds rest, minute. And I'm just going to repeat that kind of as a by-feel workout until my legs are getting to the point where I should be done because I'm going to want to hit as many of these sessions as possible in the next 14 days. Yeah. I want to hit six of them in 14 days. If I can only get five, I get five. But I'd like to really do a cram session and be ready to spin the wheels a little bit because I'm behind. You'd like to really show up good and tired is what I'm hearing. Yeah. All right, well, that'll be fun to see play out. So how many reps are you going to do? I mean, I'm going to run them at slightly faster than 10K. So 8 to 10K worth of reps. So it's the classic 16 to 24 by 400 with short rest at cross-country race pace on terrain. And it's not pace. It's just going to be effort. There's a – in the city of Milwaukee One of the easiest ways to find a stretch to do intervals on off-road is to find a power line because there's often just a grass strip that is not really broken up very often. And so there's a power line stretch that's slightly uphill. So I'll go 400 up, 400 down, and then that'll set the bar for what the times are going to be. And then I'll just try to run those times until the legs need to be done. I love it. And what shoe are you going to wear? I'll probably go VJ. VJ Max. What are I on the two? Three? You're on the three, aren't they? Yeah. Might be the two. Either way, it doesn't matter. The newest Max is a good middle ground for me right now. You're doing like very tight cluster sets, giving yourself that extra 30 seconds rest every fourth rep. But I've been thinking about that because last week we did an episode about best bang for your buck quality sessions. And you asked speed and I brought up cluster sets like the four by four by 400 meters. And it got me thinking as I'm in this marathon build, I'll be eight weeks out this weekend. I'd like to do a little bit of that, especially in that three to four week out window. I want to get some overspeed training and I think I landed on one of the sessions I want to do. And I think I want to do a five by five by 400 meter, but I'd like to keep it to like 20 to 30 seconds rest between the quarters. And then I'll still give myself a two or three minute reprieve every fifth. I think I landed on that session, but real short rest on them. But so are you looking like 100 meter float rest every for each one and then 400 in between the fourth? I might actually do standing recovery on this one. Just short, short. And yeah, I don't I don't know. I'll think it's not going to be for a few weeks when I start doing that stuff. But anyways, got me thinking. So I'm not far off from what you're doing. So it's not that's not today's though. No, not what are you doing today? It's my first quality session since racing. So when you ease back into quality sessions, there's no easing back. You're just jumping back in. Yeah. Okay. Do you choose an easy win workout or do you just jump right back into what you need? And I don't care if I enjoy it or do well at it. Yeah, what I I always choose grindy for my first one back. I don't choose anything with any sort of sharp sharpness or speed. So today's a float session. It's a float style interval session just debating between two. I'm either thinking I'm going to open with the three to float, which is three minutes on and two minute float recovery, which I haven't done that session in quite a while. Like maybe even this year. I haven't touched that session yet or I have this perfect 1200 meter loop and we got pretty good kick and wind today. So this would keep the effort even because it's a loop just 1200 meters on 1200 meters float recovery and just keeping it real just sort of in a vacuum. They're one in the same. I bet you if you took the sessions, I'd average the same rough pacing, maybe a little slower in the 12 and 12 because my recovery my float would be longer. But so I'm debating between three to float or 1200 meter on 1200 meter float those. But what's the difference? Yeah, right. Yeah. Okay. What would you pick? We got a stiff southeast wind today and all of my roads that I run on run north and south. So that means if I want to go pick away, I'm either all the way into the wind for half or all the way with at my back for half and I got to pick which one I where I want it. Right. And I get a little like it just kind of drives me nuts. It can whip out here. And so I don't know if I feel like dealing with that today. Yeah, I would 99% of the time I go out with the wind. I mean out into the wind and then come back with it on my back. The 1% of the time would be when I know I'm staring down the barrel of a race that will get worse as I go. Oh, sure. And that's a marathon. So I might be tempted to go out with the breeze at my back feeling that this is easier than I thought much like the first 10k of a marathon is going to be and then turn around and be like, oh shoot. And now I got to work. I got an hour to think on it, but that's not fun. No, it is not. We'll be all right. I'm going to put on 90s pop radio. I got a real dial. It's really like 90s thug radio at this point because they keep thumbing up all the hip hop and the alternative that pops in there. So it'll be like I'll get some jamming like it'll be like Chevelle and Limp Bizkit and then I'll get like Rage Against the Machine and then I'll get like NSYNC like randomly. I'm like dang it. This is terrible timing for NSYNC, but it happens. I'm all right with that. Last night I cooked dinner to Spice Girls radio. So yeah, I could cook dinner to Spice Girls radio. What'd you make? Last night was burgers. Burgers on the grill. Lisa's request. I feel like you got to make salad to Spice Girls radio, but that's just my this is where my mind goes. No, I mean, it's not just listening to the Spice Girls. It's listening to 90s pop. Yeah, that's fair. There's a lot of boy and girl bands in there and that's what I grew up to. The lyrics of those songs are so stupid. If you really listen to them, that era was full of just the worst lyrics. Go ahead. And then we got to get to the point today. I think that I could say that about every era of music I've ever listened to. Correct. Other than like maybe like the 60s where they actually like we're trying to tell you something. There's a lot of political statements in the 60s and 70s in their songs. Yeah, they were gently raging against the machine. They weren't raging like Zach De La Rocha was. Politely raging. Yeah. Please and thank yous. All right, let's do this thing. Yes. All right. So today we are going to continue this mini series of talking about bang for your buck workouts. We started with the best bang for your buck quality sessions. In our opinion at this point in time, workouts that were big on the return on investment. Things that shouldn't destroy you too much but will give you good bang for your buck. And then we moved on to the worst best bang for your buck workouts or the best worst, which were they're super costly. But there is potential for very good movement from a fitness or a mindset standpoint. But they're going to be costly. You're going to be sore. You're going to need time afterwards. But today we go to the trails and the hills and the mountains. Our best favorite off-road workouts. Yeah. You know, I feel like we and I don't know why this is, but we've been paying more and more lip service and credence to the flat and fast or the easy identifiable metric based sessions, right? A lot of it comes because we came off a winter running and we were more stuck on the tread or on the roads. And it's racing season. I don't know about you, but athletes I'm working with, their schedules are full of terrain type racing with lots of vert or trails. Of course, roads mixed in there, but we don't often dedicate just the time to chat about trail specific work. I can't think of the last session we, I mean, podcast we did. I know we've done them, but it's been a while. So top of mind. And I got some trail races still coming up. You, what, in the fall are going to be on the trails for sure at latest. So it's, we got to chat this out and it becomes less clear and more subjective and not as clean. And that's what the trails are anyway. So it's worth a chat. So there's an easy answer and then there's a fun answer. Okay. The easy answer here is take any workout that's good anywhere else and just do it on the trails. We saw with Ryan Woods for years, two minutes on, two minutes off. You just run that workout and he won championships based off it. You can do any workout you want off road, but that's not really what we're here to talk about. We're here to talk about the specific workouts that we love and find good fitness results from off the roads that are not just saying, all right, let's do 16 to 24 by 400, but we're doing them off road today. That's not what this episode is about, even though you can very well just do that and be a great athlete doing that. Well, why don't we give that like two minutes then just to be like, this is an option, but not the option we're talking about specifically today. The more aggressive the terrain, the more I would encourage anybody to time translate traditional metric based sessions, right? Especially if you're training in the mountains and you might have a 2000 foot climb on your trail, you lucky people out in the Rockies or West Coast. So it's as simple as that. If you know stimulus works and you want to do quarter mile repeats because you think 90 seconds roughly is the sweet spot, you translate that to 90 seconds on whatever your rest period is off and you rinse and repeat. You could do that for anything from mile repeats to tempo work to anything. Just translate to the terrain you're going to race on, time translate And that's it. It's that simple. Would you add anything to that? No. And it's effective. It's a great way to do it. Yeah. And that's probably like half the workouts we do off-road. Say the science is the science. If working at three-minute intervals or 1,000-meter intervals for 10 rounds at lactate threshold or just under is really good, then doing it off-road is really good. But 1,000 meters might take me a minute longer off-road, so I'm just going to say if it would take me three and a half minutes on-road, I'm just doing 10 by three and a half minutes off-road. It's the same workout. It's going to be slightly different in terms of how your effort looks because it's going to blip up and down more because of terrain. But three minutes is three minutes. Threshold is threshold. VO2 max is VO2 max. You can simply take any workout on Earth, convert it to a time-based interval rather than distance, and execute it, and you would leave little to nothing on the table in theory if you were that disciplined. I think we summed it up in two minutes. Good. But it is not going to be a one-to-one translation stride-wise. You may get three minutes of roughly the same elevated heart rate, but you will have to choose where you do those three minutes. And that's where workouts need to be specifically made for a trail because if you just do 16 to 24 by 400 on a trail, some of these 400s are going to be flat. Some are going to be entirely uphill. Some will be entirely down, and some will be a mix of both. And anyone who's done an interval where you do the first 100 meters uphill and the last 300 meters downhill because that's the section of the trail you run knows that that's not a real rep. It's work, but you're not getting the same heart rate response in 100 meters up plus 300 meters down. You're changing your stride. Your arms work differently on the way up than down. And one side you can say that's how it works in a race, so get used to it. And on the other side you say, but is that an optimized workout for this trail? Or should you find the exact section you want to work on? So what I find is that I do more purpose-built workouts off-road than I do on-road. I think it's a really good starting point. And starting with the very beginning of any session you would choose to do on trail would be how do I pick the terrain type, right? Where do I start with that? Because not all are created equal, and you and I don't have the luxury. We choose to live here, so we're not complaining, but we don't have access to 45, 60-minute climbs like many of the people across the U.S. do. So we have to get a little more creative with how we stack stimulus, especially for training for vert races, which a lot of you listening are in that boat. But I think I could go out my back door and I could go run an 8-mile loop and get 400 feet of gain on the local trail, or I could go to the state park and get five times that. You have hard-packed gravel, technical rocky sections, or just that soddy, annoying grass that you're going to run on today that sucks the pop out of your stride, right? So I think the first question, which I'll just kick to you and then I'll play cleanup, is how do you pick the trail and the terrain? Yeah, what I do, and this is what I do with any athlete I work with, that's the same question, is what terrain most closely mimics your next race or your next important race? So I find terrain first, and then the second thing I look for is generally vert. Where is your biggest vert? And ideally they match up. But for us, our longest hills are going to be roads. Correct. But they will then also be our flattest hills, our least technical hills. And our most technical work and our steepest work available will also be shorter. So then we have to build the skill set you need on the race in two different columns and then try to find a place to tie it together prior to race day. Whereas when we were in Colorado, I would just choose the mountain I wanted to run that day. And I didn't have to think as much about how is this going to pair on race day. Well, this is race day. That's fine. It's going to work. So finding the terrain first and then building the workout around that terrain is, I think, the best practice for people that don't have tons of options. Yeah, and I may, because we've done this long enough, we're not kids anymore, I actually will probably pick the elevation profile over what my foot is actually hitting now just because I've had years of the skill work. Whereas if I were younger and more green to trails and not as confident in my ability, especially downhill, I would probably pick the more tricky stuff just because I need the work. But now, as a seasoned athlete, I would pick the vert profile, even if it's not similar to race terrain. And even if that meant a concrete hill versus a muddy technical hill, I might now choose the opposite way, but it wouldn't have always been like that. So that is something to consider. If I have a 50K trail race with 7,000 feet of gain, and the best way to get that gain and damage on descents is to pick the longer concrete hill for the majority of my session or the long non-technical, I may still pick that. So there's two ways to look at it. You understand what I'm getting at there. So these days I pick the elevation profile actually over the exact what's under my foot terrain. But I wouldn't say I'd recommend that for everybody. No, but I think that's the exact right way to do it. You're developing the engine you need because your skills are already in place. So I want to give an example of a workout that kind of exemplifies what we're talking about. One of the classic workouts that, I mean, I probably gave you this back in the leaderboard days, preseason workout or sharpening workout. One of my favorite and least favorite workouts still to date. Actually, I'm going in a different direction than what you think. No, you are not. I'll get to chutes and ladders. Damn you. Chutes and ladders is the next example. The first one is 30-30 because it's the simplest workout we give. And so I want to start with that one. Yeah. So the classic 30-30 done by Billet to work on increasing VO2 max is 30 seconds at VO2 max or faster and then 30 seconds easy. And you repeat that essentially until pace breaks or until set number of rounds have been hit. So then we would do that on the treadmill or the track and that's a great workout. But then you want to take it uphill. And I was doing this in Colorado. I would just pick my favorite climb and I would go 30 seconds running, 30 seconds hiking. And I would repeat that until I got to the top of the climb. Then I would rest and then I would flow to the bottom. And then if it was a less than a mile climb, I would do it again. And if it was like a three-mile climb or whatever, that might be the entire workout because it's a hard workout to the top. And it keeps the same premise of the workout. And you're always moving forward and you're not worrying about where you're going to because you're always working up and you're going to get a nice long descent finisher to the bottom, which can turn into ripping if you need to. If you're getting closer to race day and you got to take that damage. But now we come back to Wisconsin. And if within a, let's say, a 45-minute drive, if I drive 47 minutes, I can hit a hill that takes me three and a half minutes all out to the top. But around here, a 45-minute drive, the longest hill I can get is probably two and a half minutes. So if I want the terrain like you're talking about, if I wanted the opposite of you, if I wanted the terrain and the biggest vert, two and a half minutes. So instead of going 30 on, 30 off, get to the top in three reps. And now I have to take a mid-set break and get to the bottom. Now I go 30 seconds hard up, turn and easily, lightly descend back down 30 seconds. And then my watch beeps again and I turn and go hard again up 30. And so I'm leap forward, move back, two steps forward, one step back. And what it does is it kind of doubles the size of the hill. Now I can get seven, eight, nine reps to the top. Then at that point, I've worked long enough. I deserve a little bit of a break. I can either rest at the top or bomb down, or I can just casually flow to the bottom of the hill as my quote-unquote recovery and then do another round of that. So it's the same workout, but now it had to be a little bit more intentional about how do I maximize the time I can get moving uphill without big disruptions in the workout. And now I might do four rounds of 30 up, 30 down, leapfrogging to the top rather than one straight round up in Colorado. Yeah, and you got to know yourself as an athlete. where like I think there's a lot of power to just be like I'm gonna go uphill and I'm not turning around and giving myself a reprieve that way or like changing like systems not systems the way your structure is working I think it's more difficult like going down for 30 turning around re-engaging going down for 30 turning around re-engaging that one can be teachable in the sense where when you have a race that is up and down up and down up and down sure you're going down easy in that regard but like even if you were to walk down for that 30 seconds like the eccentric load is actually quite fatiguing not aerobically but structurally and so like I think that's a good cheater workout in a sense cheater is maybe not the right word but why do you like that early season well we used to do 30-30 early season just to build reps getting ready for longer intervals later I think that's I said early season just saying that that's probably when you did it at leaderboard 30-30 base version get 20 to 30 reps in and it's a it's a very approachable interval session that sets you up to do big work later but on the hills we use this as a sharpening session oftentimes by working hard on almost the whole thing hike hard run hard to the top basically you're working just under threshold or just over threshold the entire time but you identified that downhill part perfectly which is you're going to if you're not moving uphill like in Colorado the off was uphill very easy to keep your heart rate up when you turn and go down your heart rate is not going to do anything other than plummet so keeping your legs active and keeping your quads kind of full makes it so that the next rep starts kind of as a net neutral yeah your heart rate dropped a little more but your legs also worked a little bit more and now they're a little more damaged starting up so again playing around with the workout it's not a clean translation but you approximate the best kind of work you can get I like really don't enjoy that workout I'll tell you why well it's an effective workout because it's just gear changing constantly is what it really is right like which is good it's a very productive session it's just such a quick turnaround 30 seconds it's just bam bam you got to have first of all it's a preset watch workout you're not going to be looking at your watch and clicking the lap button if you can avoid it and then it's just it's like so you got to you're never really settling I think is the point which maybe is a purposeful especially for like sharp undulation type trail races but I never feel like I get in a groove and I generally actually feel like that session is harder in execution than it sounds on paper like you're like oh 30 30 no big deal just 30 seconds on off but what you don't think about in the 30 30 is that your heart rate barely comes back down it doesn't come down and then it's time to go again and so you look at your heart rate data from it you're like dang like I snuck a lot of work out of myself and this isn't an easy session at all I prescribe a 60 60 long run to most of my athletes will get it at some point they're like ah 60 60 I'm looking forward to it and I'm like don't because it's way more difficult than you realize it is especially if your recovery you know if you're purposely hiking up that hill for 30 seconds as your recovery that's a threshold workout in its finest really anyway so they're just they look like they trick you on paper like it's going to be approachable and it is but it sneaks so much work out of you yeah that's all I'm getting at and you see equal work to rest and we always know that means I have to work hard but I'm going to get good recovery well once you get under two minutes for sure under 90 seconds it doesn't matter how short the on was you can't fully recover on the off yeah we only worked for 30 seconds we get equal rest but you can't recover much in 30 seconds you can do more damage in 30 than you can recover from correct and by it only being 30 seconds and uphill it just encourages you to overwork slightly yeah going to overreach a little bit on those 30 seconds because you're working hard uphill and then that 30 seconds starts disappearing quickly within a few rounds of the recovery yeah I feel the same way about 30 30 and 60 60 as I do about any sort of traditional ladder session that gets shorter as you go for example let's say like four by a mile four by 800 four by 400 something like that and you look at it on paper and go okay I just got to get to these miles the halves are going to be easy the quarters are going to be easy and you get to it and you're like no it actually gets worse as it goes just because it's a shorter rep doesn't mean it's a gimme they always sneak a bunch of work out of me and I think it's approachable and then I get into it and I'm like no these 800 suck more than the miles did and the quarters now suck even more anyways I feel the same way about those two style of workouts I agree yeah I had one more addition to what you were bringing up and it's eluding me so I think I'll just go to my first that comes to mind all right what I find even myself still but newer athletes to the trail scene or not even you could be in years in is energy management based on terrain right you hit a flat section and you're rolling and you look down and your heart rate's in the let's say 170s this is just an arbitrary example but then suddenly you hit a 200 foot climb and now you're all of a sudden on borrowed time halfway up that climb you're like oh my god now I'm just like I felt like I was cruising on the flat ish section and now that hill just hit me over and now what happens next right and then you go down the hill but you see your heart rate's not coming down like you want it to or you're like just using the downhill to recover now instead of being able to really aggressively float it we'll call it and then pretty soon you're like I got 40 minutes left in this trail race and I have miscalculated now I'm surviving versus making decisions you understand what I'm outlining right yes it's very difficult to energy manage on trails especially if there's a lot of up down and undulation and so as non-sexy as this session is it is still my favorite trail session and it is it is the the tempo in quotes trail run and yes it's a cheater workout because we just talked about not time translating to the trails but picking a duration in the 30 to 60 minute range and in quotes tempoing it or threshold running it and just learning how to manage your effort working hard maybe a notch below race effort but just the ebb and flow and the feathering on and off the gas and saying I'm keeping an effort honest I'm gonna know what it's like to press the climb but then have to run flat on top for a couple minutes before descending again or how my body responds and the only way to learn that is to feel it and so I like the trail tempo and as simple as it is you gotta feel it so you know on race day not to under or overswing and most of us what overswing too early and then we pay the piper on the back half so yes feeling that out I think is astronomically important I agree with you and this is one of the rare times I'm going to make this statement this is the time to err on the side of working too hard in a tempo run in my opinion I like the take do you I do yeah okay on the roads I believe that nine out of ten people run their in quote tempo runs too fast I think threshold work of any sort gets run too hard because it's it's very easy to overwork it a little bit and you get running fast and then you see the times clicking and it's it's enticing to work faster I can work faster but it doesn't mean that you should the trail I believe is the opposite I believe that you should feel what it's like to work a little bit too hard and it's harder I'm always hesitant to complete this statement about anything but it's harder to hurt yourself on the trail from over exertion compared to the roads it's too easy to stack up too much stimulus on the road on the trail there's enough breaks throughout and the terrain soft enough that if you overwork it's going to self-regulate and I think you need to get to that point that you talked about where you're 15 20 minutes in and you start the next climb you're like oh I've made a mistake you have to feel that and I so I think it's like in between tempo effort and time trial effort yes like you can creep towards a nine out of ten effort and that's fine I wouldn't do it every single week but even every week for like two or three weeks I think it's okay this is the session that I encourage someone and I do this myself run it a little too hard Don't build into this one. Feel it, and then you'll know what to do next time, but you have to learn it. I agree with most of what you say, but I strongly agree with what you just said. Okay. Yeah. It's also a good option to pick a loop or a route, a Strava segment that you've created, one you can return to, right? Or one that has a lot of users. It's like a seven-mile trail loop or whatever it is. It doesn't really matter. It can be very subjective in distance and time, which I like about this too, but just going back and repeating that same segment, we'll call it. Yes. And this is what bit me in the butt when I started Spartan racing and running on terrain all the time is I constantly, especially when vert was involved, thought I was running within myself. Thought so, and then realized, unfortunately, mid-race, yeah, you still miscalculated and you were revving too hot too early. That's a classic trail mistake. Even veterans make it, right? It's hard to predict always, and so that just bit me in the butt. I'd think, okay, the first two or three miles is flat, and then we start climbing. Some of those courses, like a Monterey or like a San Jose depending, or some of them, they let you run flat for a little bit, and then you got to climb, and I'm like, I'm within myself, and then, whoop, I am not, especially that flat to uphill transition just bit me. And so it just teaches you to hold back, hold back, hold back. And I took that lesson, and I applied it to my trail race two weeks ago because I learned too many times. I let the guy go early because I knew the cost of that to me. In the past, I would have just stuck. I'm running up front, and guess what would have happened? It might not have been the same result. And so you got to feel it. It's just one of those things you can't logic out in your head to a certain extent. Well, it's hard to find a metric. It's hard to find a metric on the trail that's trustworthy. Heart rate would probably be the closest, but even that can't be trusted on a trail because you can gamify your heart rate, and you've seen it. We've talked about it. You can average a higher heart rate on a trail than you can on the road because you can dip and you can peak and valley it the whole way through. So on the road, as soon as a race starts, everyone's checking their pace, and they self-regulate themselves. Where on the trail, you kind of just run with the people around you because it's totally by feel. And so the theme that I think people will see in our workouts here that we're going to end up describing is that these workouts are designed as much to teach you how to feel a trail as they are designed to work on your engine because it's really, really hard even for a seasoned runner to pick the exact perfect pace and effort on a trail. And what you end up finding throughout these kind of workouts is that there is always more time to be gained in the second half than there is to be gained in the first half. That if you go out a little too slow, you can work way faster later. But if you go out a little too fast, you crumble and you cannot run uphill anymore. And the difference between running uphill and hiking uphill is minutes per mile. And so giving up a minute per mile early to get minutes per mile later is the name of the game. But finding out where your sweet spot is, that is what these workouts are designed to do. There's a saying in the road marathon world that I think translates beautifully to literally any trail race. And I'm going to say any trail race as in like literally a 20-minute trail race or a 20-hour trail race. And the saying is you can't bank time in the marathon. You can't bank time in the marathon. You can't go out faster and harder than where you're really at and think that you're going to get ahead of your goal pace and then somehow finish there. You can't bank time. It's not a winning strategy. And that is one of the few road things that translates to the trail. You can't bank time in a trail race. It bites you harder on the back half and you'll end up worse off for it by the time you cross the line and your finishing result. And it even applies to a shorter duration on the trails than in the road marathon, which is a much longer race for many. So, all right, you're up next. All right, so I'm going to take that and then take it another step further and now we'll talk chutes and ladders. So chutes and ladders is not a workout style I invented. This workout's my baby. There might not be people. There may be people out there that don't know why it's called chutes and ladders. Do you think there's people out there that don't even know the reference? Probably, yeah. Do you want to explain it? It's from the board game. You're always either going up or you're bombing back down the board. Okay. That's what this workout is. This was from back in leaderboard days when we had decided that as I'm making these workouts, we were going to give them a name. It just wasn't going to be 20 by 400. It was going to have a name to it. And so almost every name that I use these days started from leaderboard. Bigfoot, KDE, chutes and ladders, Mount Majestic, things that would give it a ring to it and it's entrenched in your brain. The grind. The grind, the Jeff. They don't have to make sense. They just have to stick in your brain. Yeah. So KDE makes sense. KDE makes sense. We won't go there. You have a backstory to half of these and the other half are just me saying, oh, this would be funny. Yeah. Okay, continue. So chutes and ladders is just a workout designed to work on the – it started as to work on the ability to descend as your climbing leaves you. And what it morphed into was a workout that works on the ability to climb when you are tired and beat up from descending and to descend when you are tired and beat up from climbing. So the first time I ever did this workout was out in Colorado. This was at the Gold Camp Reservoir and it was going up Chamberlain Trail up to – what would that be? Gold Camp Road. For the 10 people that listen to this that know that area, Jack Bauer, he knows exactly what I'm talking about. But the setup to this was that there was this – these two reservoirs that provided the drinking water for Colorado Springs. They were on this flat area and that started the foothills up to the mountain. And from there, you could run 49 straight miles to Crested Butte through the mountains if you wanted to. But this was the transition point. So it was 900 meters around the reservoir and then from the reservoir up to Gold Camp Road started at like 2% and it ramped up to 30% by the end. It was 1.15 miles if you took Chamberlain Trail up to the top. And so what the workout was is I would run hard to the top of Chamberlain and then I would flow the descent back down but like aggressively flow it. And what I mean by that is use the stride that the trail is kind of asking you to use. You're not breaking. No breaking but no reaching for speed. You're just flowing the descent. The most efficient but fastest stride you can bring down without trying to do anything that the hill is not asking for in that moment. Very much by feel. So I'd work hard to the top, flow it fast down to the reservoir. The gate entering it was my start stop. And I'd take my split at the top and the bottom and then I would slow jog 900 meters around which is a long recovery and I would do it again. And I would do this workout until I couldn't match round one's time. And what would happen is every rep I would get slower up the mountain. You're getting tired from the climb. This workout started at like 7,200 feet and it would go up from there. 1.15 miles is a long time to run hard uphill. And so as I'd lose time up, I'd have to make up the time on the descent. And so it would go from flowing the descent to working the descent to bombing the descent and eventually you'll get to the point where it's either not smart, like my legs are beat up, or I can't match round one's time anymore without exceeding like a 9 out of 10 effort. And I'm getting 900 meter slow jog recovery afterwards. So I'm working these reps, but half is downhill. And it was like a super fitness amplifier for me, but it was also an endurance workout because it was like a mile and a half, two miles to this spot on the trail. And so it's, call it four mile warmup cooldown and each rep is 2.3 miles. Add in the 900 meters in between. It's almost two and three quarters miles every single rep. So every rep you add on gets to, you really amplify the distance of the workout as well. And each week I'd be able to Add another rep, and eventually this was an 11, 12-mile workout. But it just gave me a really good benefit in racing. And then we got to Palmerton. And Palmerton was the first big mountain of the year. I was crushing this workout prior to Montana, had a great race in Montana. And we get to Palmerton, and I realize this climb is longer than 1.15 miles. And now I get to the bottom, and we have to do it again. And my legs were shot. Even though I had done so much work in this workout, I couldn't climb after descending because I was used to a 900-meter rest to get my life back together. So that's when the workout shifted to up, down, up, rest, down, up, down, rest. So you're always having to do one of the skills while very depleted. Yeah, I'm glad you took it there. I figured I was like, you're not going to leave out the go back up or go back down part, are you? No, but it was the progression of how I felt the workout work and then felt where it left me lacking and then how you have to then modify a trail workout. Because on the roads, you don't have to worry about this thing as much. On the trail, you have to worry about order of operations because your race may ask you to do something late that you didn't have to do late in a different race. Yeah, and just I'm sure this goes without saying, but it doesn't need to be a mile-plus long hill. It could literally be your 100-foot gain hill, that last 0.15 miles, right? It's just you had that available to you, and you may have to gamify it by doing more reps of it, but the point is to go up, down, and up, and down at effort, making yourself climb after you've gone down hard and making yourself go down hard after you've climbed hard, right? And so the point is to get your body and legs and system and mind used to working after it's taken a hit from either going down or up multiple times, right, in a sense? Yeah, why was it 1.15 miles? Because that's where the trail stopped and started. Right. It's not as an exact of a science. I think if you can replicate, hey, the climbs in my race are roughly 400 feet of gain, if you could find that and do that exactly, beautiful, but most of us can't, right? And the way that, and I don't know if it was prescribed this way, actually, before I get ahead of myself, when executing this session, it was one of my key sessions, even after I started self-coaching or whatever, that's one I took with me for sure. You realize how easy, this again goes to energy management, like with my first trail tempo explanation, is like you think you're going within yourself on the first rep, and then you get to rep two and three and you realize like, oh my God, like I'm having to work way harder to even hit the same pacing, and sometimes you start bleeding almost immediately being like, I know I managed effort well on rep one, and here I am struggling notably more on rep two, and by rep three, you feel like you're basically racing to hit the same split as you hit on rep one, and you're like, I swear I didn't miscalculate, but you did, because there's no such thing as too conservative, and I always found myself trapped in that workout, meaning like I'm taking my splits, I'm trying to stay even, and eventually I cut that workout, I'd be like, okay, you can only bleed 20 seconds total on this rep, and once you do, you're cutting it, because I don't know how many, I rarely negative split that session, rarely, and that just goes to show that I needed work on energy management because it's tricky when vert is involved. Yeah, and early on, we don't feel the downhills and the uphills well. Correct. We have an energy surplus, and so you're running uphill, but even though you think you're running relaxed, you're a little too bouncy, or you're a little too aggressive, and it doesn't feel it, but as soon as that energy surplus is gone, that was way too costly of a stride. You can run uphill at the same pace in different strides, and we generally start by feeling strong and confident and tall and peppy, and that's not a great thing to be uphill, and same thing downhill. Oh, this feels great. I'm not feeling any of the impact. It's like, no, not right now, but we don't descend the first descent. We descend the third descent during the first descent. That's how you have to think. You have to think about the subsequent descents, not the first one, because downhill damage shows up as a loss of uphill power. That's the statement right there. Downhill damage presents as a loss of uphill power, and once you get into that workout and you realize the damage that has been taken, suddenly your climbing isn't available to you like it was. It's just a slap in the face to me as I learned that session and how racing really, that story plays out every time you race on terrain. It's just like time and time again. I thought I was within myself climbing, and now suddenly it's gone because of the damage from the descent. So that is sitting on top of the terrain racing throne is that session for me. And you could have a quick 30-foot get climb hill if you're on these little rollers, or you could have a three-mile climb hill if you're big mountain racing. It doesn't even matter. You could translate that, scale it up or down. I've done this hill workout at Alpine Valley, which is a 0.3-mile ski hill. I've done this at Lapham Peak over by my house, which is 0.82 miles of a switch back to the top. I've done this on the backside of that trail where we get like a 1.1-mile technical rock garden descent. The skill changes each time. The fact is no matter what I'm doing, I can beat up my quads on a descent if I work hard enough to the point where then it affects my uphill. Now, Kirk, I want to use an athlete example. I'm going to leave her nameless because I think she would prefer it that way. But there's an athlete I'm working with towards her first big ultra, like real long ultra in the mountains, lives in the Midwest. And she's been doing a lot of leg builder work, building up the volume slowly to stay safe, hitting some long runs, just did a multi-hour event, and then this last weekend raced a shorter, in quotes, race, like more in the 20-ish K range. I'm leaving it a little vague so we don't identify the athlete. And what she found was she worked hard on the descents early and bled out in the second half. And her takeaway, which was natural, was how am I ever going to run 100 miles if I fell apart in a three-hour race? So what would your response to an athlete like that be, obviously in the confines of the chutes and ladders concept we're talking about? Well, I mean, doesn't it come back to the energy management, I mean, in a sense? Yeah. Mind your effort conversation to start because, yeah, she was racing for two hours, I'm assuming, versus a day. So, yeah, it's a great lesson to learn before going into an ultra as a shorter, stingier, oh, my God, I miscalculated trail race. So what was your advice? Well, it's that exactly. You weren't preparing for this intensity. Correct. And so when you bomb a downhill faster than you train it, the thing that happens is you can't climb that in a little bit. It goes away. So it's a false equivalency. If I fell apart during 20K, what's going to happen during 200K? They're not related. The damage you took here, if you take that damage in 100K, you're in trouble. But fading in a 20-ish K does not mean you don't have the endurance for a 100K. It'd be like fading in a 5K after going out too hard while prepping for a 50K. It doesn't mean you don't have the endurance for a 50K. It means you ran really hard and you weren't used to that. And once you tip over, there's no endurance base in the world that will carry you once your legs are shot. Yeah. Yeah, that's a good point. I think it's probably the – I guess you could have examples of this on the roads, but it's a learning workout. You just learn your body and management. I do just like to give a little more specifics with this one. A lot of you that don't live in the big mountains and have access to these long, big climbs, I know like I got a slew of people down in Florida. You're running bridges because it's what you have. Or like Bracken and I, we had these ski hills. The closest one to me is 145 feet of gain from top to bottom. That is what it is, right? And so the way I ended up extrapolating that is it doesn't really matter the length of your hill or the duration really, even if you're prepping for a big mountain race out west but you live in Florida, okay. Like you can climb in a vacuum in my opinion, meaning like hopefully you have an incline trainer and I can just go up for 45 minutes at 30% if I have to, and that will translate for me. It absolutely will translate to the race. I've felt But I've done it. But the downhill is just the part that you can't get any other way. You just can't. You can try to supplement in the gym, but you just can't. And so, exactly. And so what I like to do is no matter the length of the hill, it's important to run up and down hard. And so I don't care. It can be as subjective as there's a big hill, I'm going to run up, down, up hard. I don't even know how far it is or how much I'm gaining. And the way I like to do it is just take half rest or jog recovery. So it's up, down, up. Let's say that rep took me four and a half minutes. Then I am giving myself roughly 2.15 of jog recovery at the top or even walking or standing rest. I really don't care because you're going to find out what you need to find out either way. So the classic example is half recovery for me on those sessions. And that way I don't care how long it takes me. I'm just getting half rest. And so whatever it's bridges back and forth in Florida or it's your little dumb ski hill in Ohio, same rule applies. And I think I'm glad you brought up the rest. And that's how we used to prescribe it, right? It was half rest. So if it was a seven minute and I usually wanted people to get like six to seven minutes total of work, that might mean up, down, up, down or whatever it was. Then it was three and a half minutes of rest. But it really, like you said, it doesn't really matter. But the point is you have to embrace the longer rest in this workout. We often get confused as athletes of at the concept of this isn't what I'm asked to do in a race. So why am I practicing resting now? And oftentimes people will shorten rest or increase intensity because it's more race-like. But what we're trying to do in this workout is accrue damage. We're not trying to practice race recovery. And if you rest 30 or 60 seconds before doing the next up, down, up, you're going to run out of the endurance and the engine to accrue more damage. And you may only accrue 1,000 feet of hard descending. But if you take a long recovery, your cardiovascular system and your legs start to come around a little bit and you get more reps in. And since the point of this is to really beat your legs up and then climb, you're just getting more practice doing that. We're working way faster than we're going to work in an ultra anyway. So we don't have to worry about race specificity. We're trying to beat up our legs and get used to what does the give and take of how I climb versus how I descend, how does that work, how can I feather the gas, but how can I just beat up my legs so that I handle it better next time. So embracing the long rest is important on workouts like this. And I believe it's important in descending workouts because it buys you more reps. And that's the name of the game if you don't live in the mountains is how can you get big days to beat your legs up rather than every time I go out my door I get 2,000 feet. I don't have to worry about it. Yeah, and I guess you sparked a thought for me there, which is if you're running road or flat or track or whatever, we're really keeping an eye on heart rate a lot. And I'm trying to run in these zones or at this intensity. And the focus is aerobic stimulus, right, metabolic stimulus. The goal of this session is as much structural damage as it is anything else. Meaning the heart rate graph might be all over the place. You may get a lot of cardiac drift on the way up and then it's dropping on the way down. But the big rest and letting your heart rate come down, like we're actually trying to damage your body structurally, physically. The aerobic output sessions can be done in other places that are in a vacuum. But this is more about structural damage as much as it is about like aerobic output, like actually harming your muscles and joints and tendons and ligaments and taking that load. And that's what anybody who runs an extended trail race says like, yeah, eventually like I took so much damage. You'll watch their heart rate charts and you'll be like, yeah, the last third of the race I couldn't even get my heart rate up like I did the first third because I was gone. I was broken. And you weren't broken aerobically. You were broken structurally. And that's what happens in these races. Yes. This workout, Kirk, is the workout. Now I had a few races that did this for me, but this was the workout that finally convinced me to switch to less aggressive racing shoes for long races because I would do this workout in my race shoes because I wanted to practice the foot plant, which would then give me the damage and impact type that I was going to use in a race. And I talked about I built this up to like an 11 mile workout. And then one day I instead of wearing my workout shoes to the hill, I jogged in my Hoka Challenger ATRs at the time to the start of it, put on my race shoes, did three reps, started feeling my soleus and my quads more than I wanted and thought, whatever. I just want to get some more time on feet. I put the Challengers on and I got two more reps in. And the descents changed at the end. I wasn't slapping the ground as much and I realized, okay, all right, I get it. I'm like five seconds per mile slower getting up this hill and like 20 seconds per mile faster getting down and I'm taking less damage. Like, okay, fine, I'll stop banging my head against the wall. If I'm going out to do a three-hour race, I don't need to feel fast going uphill or on the flats for the first hour. I need to be able to work in the second half of this race. And if that means wearing the Hokas, then I'm going to try doing it. And I've really never looked back. I still try to wear the lightest shoe that gives me that protection for any given distance. But when in doubt, I choose the shoe that gives me the ability to do more now because you realize in these kind of workouts, the chunks of time you give away as soon as something leaves you. Firmly in the more is more camp when it comes to races that are probably an hour or longer on the trails. Just is. It's where I'm at now. Meaning shoes, by the way, more shoes probably is better. Yeah, you always say pick the shoe that you'll feel the best at the back half of the race, not the first half. And that one resonates with me. I want to touch on one point really quickly, and then we got to work towards wrapping this up. I want to make my last workout. Yeah, sure. First point, you live in a pancake flat area, aka Florida or South Texas or wherever the heck you are. Doesn't matter. And so you have a flat trail race. And so you just go run on the concrete or you run on the track because it's a flat trail race and it doesn't matter. Like it's flat. The terrain is the same. You're wrong. You need to understand how to run efficiently, effectively on the whatever the footing is that you're competing on. So even if you're a flat trail racer, which there's a lot of flat trail races out there, especially where we live, doesn't mean you can get by by doing your work on the roads. You need to do hard quality sessions on that terrain as well. So I don't want to not pay lip service to those people because there's a lot of people are listening like, yeah, I have like little rolling hills, but it's mostly flat trail races that I'm doing. Just know that then take your quarter mile repeats and hit them on the flat trail or do what we're talking about minutes based and hit them on the trail. But we want you on that terrain. It makes a big difference. You'll realize the energy return is so much less on that terrain and you got to get dialed in on what shoe actually feels best for you. And so I just don't want to leave that sector out. I know I'm only giving it one minute of my time, but it needs to be said. It does. Right. There's a guy I work with named Corey, awesome guy, and he has a trail section that he's had to find for this very thing. He lives in Illinois. It's not a steep area. It's not a technical area, but he found this technical area and he does his intervals on it or his tempo runs and he may only get a couple hundred meters and he's turning around back and forth, but he is staying 100% of his reps on that technical ground when on his schedule it says technical interval. And so I have a section of it's half dried creek bed. It's half little ravine running and it's a half mile down. And when prepping for big long stuff, I've gone up to two and a half hours on this back and forth on a point. I think it's like 0.52 miles, but it's two hours of technical work. I'm turning around every like four minutes on this terrain, but that's what has to be done so that I know I can trust my ankles. I can trust my shoes. I know how I'm going to move through this kind of terrain because what you find is that you can do it oftentimes right up until you can't. You fatigue really quickly on it and you don't know when that fatiguing point is unless you do your quality work on it. And you find a different sort of efficient type stride on that type of terrain versus like what you might feel in your super shoe on the sidewalk for me anyways. Yeah. Okay. Well, I'm glad we touched on Just because it's a mountain race doesn't mean they're not going to put you on three miles at the base of the ski hill before you go up or finish there, right? So all that matters. The other thing, and I know we're just beating this to death and I'm not sorry about it, is piggybacking on my comment about you can run uphill and get stimulus that's going to, like on the treadmill, and translate to your mountain race. For sure. I am telling you the treadmill is such a big tool, especially if you're not in the mountains, but even if you do, using it to just get that stimulus in without having to take the damage of a descent can also keep you available for training and it still should be a big tool in your toolbox, I believe. That said, as I'm thinking this through and we talk about chutes and ladders and me mentioning about it's about structural damage, not necessarily like metabolic damage, the more I think about it, the more that's what this trail stuff comes out to be for me. Like any of the sessions you pick, uphill trail repeats are great with easy descents. They serve a purpose, but for me, it's mostly about working through the ups and downs of what a trail race requires. And so whatever session you pick, like your example of five fingers where you go up five ski runs and go down them all at like a hard tempo sub race effort. For me, it's all about needing to run both up and down hard. And the sessions I pick literally might often be a trail, most of my sessions are like on a trail loop or a ski hill loop where I'm doing five minute intervals and I don't care where it starts or stops me, but I know because of the terrain or loop I picked, I'm going both up and down every time in that five minute interval. And so I am literally maybe running the same loop and I know that in that five minutes I have to do both. And I don't care what it looks like or where it is, but the minute based sessions, but with one step more purpose, meaning I'm purposely choosing to run hard up and down each time. It could be a two minute interval. It could be a 12 minute interval. I don't really care what it is, but when I pick the terrain, it's like I did my five, two trail repeats the week before Zumbro. It's one of my favorite sessions a week out. I picked a mile and a half loop. It forced me to climb hard and descend hard every single rep. And it didn't even matter where it fell. Sometimes I had to start my rep by climbing. Sometimes I had to start my rep by descending. And sometimes I had to start my rep on the flats, but it got it all in each rep. And that's where I think the priority lies. So I just wanted to like whatever session you need to design to do that. Yeah, I like that. So the final thing I want to talk about is finishing the terrain. I think if you're trying to cram more things in, I need flat fast work. I need whatever. That's fine. But if you're going to then try to prioritize anything, do the most race specific thing when you are the most tired, which means do it last. If you're going to do a treadmill 20 minute climb in your day, do it after your intervals. If you're going to say, I'm not going to go do two hours of trail running because I need to get my quarter miles in. Do them first and then do an hour of trail running. If you do the thing under the most duress, it's worth more. And so do the leg builder first and then go do a 60 minute aerobic threshold hill session. Do the quarter miles first and then do chutes and ladders. Get to the hill tired. I like that so much more than the reverse or than not getting to it at all. If I'm not going to climb on my treadmill for an hour, that's a non-starter for you. Go do your regular flat whatever run and get 20 minutes on the treadmill afterwards. But do it under duress. I think that's a very overlooked piece to this. Yeah, I remember one of the most productive sessions I had was actually a mile time trial on the track. This sounds silly. I ran hard, ran all out on it, made the 10 minute drive right after cool down to the base of the ski hill and went up and down it because I had mountain races that mattered too. And I wanted my cake and to eat it too. And I remember how wiped I was already at the ski hill, even from a mile time trial. And then I raced I think two or three weeks later and had one of my best mountain races I had ever had because it felt available to me after I had already wiped my system a handful of times in training before. So I felt that. And every single one of those steps happened when you weren't sharp. So now you had to force your feet to be precise. You had to cut through the mental fog on your descents. You had to tell yourself, get my arms involved on my power hiking as I'm heading up. Everything happened under duress. And so it was worth more because it was more specific to the second half of your race. And the longer your races go, the more important this is. Oftentimes you'll see people on the trails do a bunch of hills and be like, I need more time today, but I can't descend anymore. So I'm just going to finish the lap. I'm going to go do a 5K loop flat. And that's great. But I'd rather have you do the 5K loop first and then get the time beat up when you're most beat up because every one of those steps just is weightier for your skills. And I think one of the things you've talked about a lot today, and I agree with, is you can do your engine work however you want, but the skill work is what's needed in this workout. You need the damage and you need the skill. And both of those things stay, from a trail perspective, stay in your system better when you're fatigued. In a sport perspective, like basketball, baseball, you want to do skill work fresh. In trail running, you want to do skill work tired because then you're using race-specific motions. Yes, sir. We're on the same page. Remember we butted heads? Was it last podcast or whatever it was? Yeah. Hey, before I forget, we're closing this thing out. I don't know if you guys recall, but months back we gave away, what was it? It was three months of the running public training plan away to two contest winners. Is that correct? Yeah, it was paid forward by someone who had previously won a free month, I believe. Correct. And I am looking at this. So this same gentleman, to go unnamed, has paid in advance three more months for two more people. Okay? So we have three more months to give away to two lucky winners. And I am trying to find the message from one of our contest winners who said we awoke the beast inside of him. Do you recall this message? I'm not going to recall it, Kirk. Why not? It was a message, which means I probably didn't read it. Okay. You are our point of contact. Fair. You know what? Water under the bridge, but the contest winners decided to stay on board with the training plan because they found such great benefit with it, which is fantastic. So this gentleman paid us already, so we have his money, and we need to give away these three free months to two people. I would like to give these two people to somebody who needs some structure or guidance in their training, man or woman, doesn't matter. I don't care what your line of work is or not. But anybody who thinks they're deserving to send a message saying, hey, I'm kind of lost, I need some help. And I'm going to handpick, not at random, who I think, without sending me a novel. If you send me a novel, you're out. Give me a nice paragraph that tells us why you would think that the plan would benefit you, and we're going to give away to two people next week for free. Running public IG message. Send it that way. I just don't want to spend five minutes reading a sob story. I just want you to tell me how it is. Bullet point me why you deserve it. Yeah. Kirk's heartless. I'm emotionally dead inside. We don't care about your sob story. We want to know why it's going to be useful to you. Correct. Sounds bad. We don't care what you've gone through from this perspective. We care about you as a person. But from an athlete, you know Kirk doesn't care about excuses or motivation. He cares about discipline and getting it done. We want to know why you'll get it done with this. It could be like, hey, I got my first ultra in September, and I am scared and have no idea what I'm doing. Oh, great. That's beautiful. If I hear about your cat, you're out. So message us. I want the message. I want to help you, but two people are going to pick next week, and the plan is awesome. So there. That's how I want to end this thing. All right. Roll the music. If anything resonated with you on today's episode and you're curious about taking your training to the next level, check out therunningpublic.com, where we have a training plan to fit your needs."
}