{
  "guid": "21171cd5-a86e-3db9-ad50-8548d311d120",
  "title": "Episode 519: Darla O’Connor Pt 2",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. Whether you are a brand new runner or you already have a great mustache, we're here to help you increase your running knowledge and present it at a practical level. This is The Running Public. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. I feel like I shouldn't have to prompt the key holder to push the button. Well, I was getting through our preliminaries and announcing about the construction noises in the background and whatnot. So I feel called out now and attacked. Darla, hello. Hello, Kirk. Long time no see. Yeah, I saw you like five hours ago. Yeah, something like that. And you, Darla, every morning. So we're recording this on a Thursday and Darla and I work together in the gym in a small group from like seven to eight. But Darla's already at the door before the gym opens an hour and 15 minutes before that because Darla gets her cardio in on either the treadmill or something. So I like open the gym at like 5.50 and guess what car is always in the lot waiting for me to open the stupid door? Darla. Me. Yeah, and I have to drive from Woodbury to get there. That shocks me zero. The little I know about you, Darla. Yeah. Yeah. Darla, last time I chatted with you, did you look back and see when it was? No, but I know I was living at my old place. So it was probably over three years ago. I was on vacation. I think it might have been Ireland. Yeah, we're due for a chat because you've never chatted with Darla. So actually I'm leaving and Bracken, you can take this thing. I'm going to take a nap. Just kidding. I'm not going to do that. Yeah, Kirk is sick of me. I see you all the time. I see you all the time. She came all the way down to Zumbro to watch the race even though you couldn't run. I know. I have FOMO. Well, you were there. That's halfway better. Yeah, it was fun watching you the little bit I got to see you. Yeah, you guys didn't make it back on the course very well. No, we didn't. We didn't have that mapped out very well. I have an idea for her if she does it again next year. She should go, you know where the parking lot is and you know how when you come out and you make that turn and go down the straight but you're right by the parking lot. You know, like she should backtrack from there. I agree. The problem Jess had is she had two people on the IR dragging her down. I know. And I told her, I'm like, just go run. Don't let us drag you down. But she was like, no, I'm okay. Yeah, I know she didn't want to ditch us. So we're starting with bad news. You're actively injured right now? Actively. Well, I'm not injured anymore. I was very injured before, but I had a full knee replacement on December 23rd. So I'm in recovery mode. December 23rd, they go all the way right up to Christmas. Right up to Christmas. So Christmas Eve, I got released from the hospital on Christmas Eve. So I was kind of out of it on Christmas Day. My kids were having fun with it. I was a little drugged up. Did Santa still come? Hell yeah. Can I swear on here? Yes. Yes, you can. Santa did all the shopping in advance so that we were ready to go. The reason we're talking today really is you haven't done anything profound at all recently, which is exactly why I want to talk to you, first of all. Not since last October. It's been a bit. And second of all, I told you this this morning when I came up to you on the treadmill. But Jess and I were talking about who we should have on the podcast coming up, and her first suggestion was you. The first person she said was you. Like, why don't you talk to Darla again? She's got all this stuff going on. And I know you were top of mind because she had just seen you at the recent race. But then I got to thinking, and I was literally, this is how last minute this was, Darla. Like, I was like, that's a good idea. I'll think about that. And then I'm watching you over there on the treadmill this morning at 5.55 or whatever it is, hiking away because you can't run yet. And I'm like, I got to talk to her. But we should just talk to her now because you're in the midst of coming back from, like, a major, I mean, a knee replacement surgery is a death sentence for your running as far as traditional medicine is concerned. And I'm going to have you end up listing through the surgeries you've had throughout your entire life and the constant speed bumps you've had and then the conversation of mindset and how to get through this with a smile, which you do. And so that's how this came to be. And Bracken and you have a bit in common there, I feel like. Yeah, Bracken, you seem like you've had a lot of surgeries in recent years. Yeah, I think you have me beat with severity and maybe number as well. I'm sure number two, unfortunately. But I've got a lot more years on you, too. Yeah, but this is important. When Kirk said why he wanted to talk. I hope it doesn't catch up, by the way. Yeah, I hope not, too. Actually, I shouldn't put that on him. Yeah, don't challenge me. But when Kirk told me why he wanted to chat, I thought, good, because I used to have this thing I said where I was pretty convinced I would eventually tear an ACL or an Achilles or something because I played too much basketball and flag football and things. Everyone I know eventually tears one of those things if you're middle-aged and playing these things. And I always thought if I was late enough into my 30s, I would probably just let that be it. I would just switch to lifting and just live out my life. And then I had my first knee surgery at, what, like 32 or something. And obviously I didn't stop. But then I hear other people or people I work with, they're like, I've got this knee hanging on by a thread. And honestly, once it goes, I think I might just be done. It's telling me enough's enough. I don't want to go through a 13-month rehab at my age. It's probably not worth doing this thing anymore. And I've heard that sentiment several times. And so I think this is a very important message for those out there who are sharing that mentality that when it finally does happen to me, that'll just be the end of my athletic journey. Yeah, no. They've got to switch that thinking. Tell us more about why they have to switch that thinking, Darla. Well, you know, it depends on their lifestyle beforehand. But if they were an active athlete and to go and say, okay, I'm not going to do it anymore, that would, to me, be a death sentence. It would be like telling me to chop off a leg or something, you know? Like, that would kill me. And that's why I've been putting this. So kind of reeling back the clock, like in 2019, no, 18 is when I first started tearing stuff in my knee. I think the first thing was meniscus. So they went in and just cleaned it up. Then I started tearing cartilage. And I remember I was walking my dog one day. She's a big girl. And she pulled me hard, and I stepped wrong. And I just felt this shearing pain. So I gimped back home and go into TRIA and had an MRI. And I tore most of my cartilage. There was like a teeny tiny bit left on the lateral side, the outside of my leg. And the doctor then was like, yeah, your running days are over. And I was like, what? Are you kidding me? No, no, no, no, no. I know people that have kept running after they had cartilage torn. And he's like, okay, well, listen, I'll work with you here. We can do a tibial osteotomy, and that will help. And so what that entailed was they break or saw your tibia and angle it out laterally so that I'm lined up and putting all my weight bearing on the outside of my knee where I did have a little bit of remaining cartilage so that it would not be as painful bone on bone. So I'm like, let's do it. So I was supposed to be off running for a year after that, but I got back after nine months. He was like, okay, you're good. Let's go. But I was still, I mean, a lot of pain. It wasn't pain free, but I was able to keep going with a little bit of ibuprofen on board or a lot of bit of ibuprofen on board. It's disturbing itself, but nonetheless. Yeah. And then in 2020, I was doing, remember when Hunter McIntyre did that, I don't remember what it was called, but that competition online. OCR stars. There you go. OCR stars. So I did that. And one of them was to do a 10K. So I was running my 10K around the lakes and finished. I like didn't feel any pain the whole way. Finished. And I'm not kidding. I stopped. And then the first step I took, my leg, my left knee, just kind of like shooting pain. And it kind of gave out. I'm like, now what? You know? So I go back to get another MRI and I had torn my ACL. So now I have a torn ACL, torn meniscus is shredded. My meniscus is barely there. And just a tiny bit of cartilage left. So that was 2020. And so I didn't want to have a full knee replacement at that point. I'm like, I'm not ready. Let's do what we can to keep me going. So then they just, I would alternate. So I would go in for a cortisone injection. And then three months later, I'd go in for what's called a synvisc injection. Have you heard of that, Bracken? Where it's like a thicker material and they inject it into the knee joint and it gives a little bit of a cushioning. It's not a pain reliever, but it's supposed to cushion a little bit. So I would alternate. You can only do that one every six months for insurance purposes. So I would do cortisone, synvisc, cortisone, synvisc every three months. And I did that from 2020 until 2024. And then it just wasn't working. You didn't address your ACL. I kept running without an ACL. Okay. With a torn ACL. Yeah, I'm a little bit crazy, I guess. And then the worst part was when I would do like Big Bear or Tahoe, I couldn't bomb down the mountains. I was laughing at you. Just the concept of Big Bear or Black Diamond ski slopes with no ACL is humorous. Yeah, yeah. The fact that you didn't go in. I would still win. I know. I would crush going up the mountain, right? I'd be in first place. And then coming down, one or two people would just fly past me. Oh, that would make me so pissed off because I worked so hard. So then I'd have to catch them on the flats and going back up. And so, yeah, the bombing down was not happening because I had no support. So a question about where we are so far. You said that you were not ready for a full knee replacement, which I understand not wanting to do it. But why did you decide not to just get it over with, knowing that every passing second your body will regenerate slower? Yeah, I guess it was the narrative I was getting from surgeons and people saying, once you do it, you're done running. Once you do it, you're done running. And I was like, nope, not doing that. And then through a physical therapist guru kind of guy that I'm not going to mention his name, I got a referral to an orthopedic surgeon here that worked with high-end athletes and stuff. So I went to him and got a whole different answer. He's like, heck yeah, you can run when you're done. We can do this. We'll get you back. So then I'm like, let's do it. Because at that point, this was like November 2024, just this last fall, I could barely walk. Nothing was working to stop the pain at that point. So I had to. I really had to. Did you ask him why you got two completely different answers from two different orthopedic surgeons? Is he doing something different or does he just believe something different? I'm not sure if he does anything different. I do know that I've talked to people that have had knee replacement right around the same time I did, and they're nowhere near where I'm at in recovery. But I think, you know, what do I know? But I think it was just that he knew me and my backstory a little bit better. The other surgeons were more like general pop. You're not going to – most people just wouldn't put the training and the physical therapy, and it just was going to – that's their end road, right? But this guy knew I was motivated and said so. You know, I don't remember because it's been so long. I don't remember ever watching you run without a hitch in your giddy-up. Because in 2018 or 19, that first happened. Like the fact that she's accomplished, like you've accomplished what you have. Like if you'd watched Darla run those four years when she was getting the shots and gobbling ibuprofen, which put her in the ER and an ambulance ride, by the way, because of ibuprofen, the last five years I've never seen you run a clean gait. Like I could look at you and be like, something wrong with her. And she's still putting in time on that because you were in so much pain. And you should tell them the ibuprofen warning, I think, right off the top because you mentioned it. What happened with you and ibuprofen, Darla? Yeah, so the injections were helping, but it wasn't complete pain relief, right? So I was medicating with four ibuprofen in the morning, four at lunch, and four at dinner or before bed, right, with food, right? And then – This is not a big, large woman we're speaking with either. That would be like me taking six, just body comp compared to – Anyways, just weight to medicine ratio, continue. You're not a big person, yes. No. And then I had – in the midst of all this Bracken knee problems, I tore all three hamstring tendons off my – you know, proximally off my pelvic region. On the other side? On the same side. Same side? They ripped right off. And so I had to have reconstructive surgery to have those reattached, all three of them. She just forgot to mention that, which would be the biggest injury anybody's ever had in their life. So that was also just in the middle of this. It was in the middle of all this knee stuff. But my surgeon gave me a prescription for an oral anti-inflammatory, which I kept taking along with all that ibuprofen. And I didn't realize it was in the same class, same family. So that was even more like ibuprofen-type medication besides what I was – you know, the generic ibuprofen. And then one day I was – one night I was out with a bunch of friends, and I had one shot of – oh, shoot. I forgot what it was. Anyway, it doesn't matter. I had a shot. And I was sitting by my friend, and I'm like starting to feel a little woozy, and I'm like, wow, that was a good shot. But then it started hitting me even harder, and I laid my head on her shoulder, and I'm like, Jackie, I don't feel very good. And so she's got me up and took me to the bathroom, and thank God she's a nurse. And I started vomiting profusely and passed out, and I could remember other – I was out with a bunch of hockey moms and dads because right after my daughter's hockey game. And I remember all the other women coming in, and I vaguely remember one of them saying, this is more than just one shot of alcohol. And so they called the ambulance, and it's a good thing they did because my pancreas and my liver were shutting down from all the ibuprofen. And the doctor was like – comes in the room, and he's like, how much did you have to drink tonight? Like very accusatory. I'm like, I had one shot. And he's like, no, really, it's just you and me. Tell me how many drinks did you have and how much do you drink? He thought I was an alcoholic because of the status of my liver. It was so bad. And I'm like, really? And he goes, do you do steroids? I notice you're very fit. And I'm like, no. I remember I said, I take pre-workout. Like I was so out of it. That's what I said. And he's like, okay. And I go, but I do take a lot of ibuprofen. And then the light bulb went off for him, and he's like, okay, how much do you take? And then we realized what it was. But it was months, maybe a year before my liver fully recovered from that. So don't overdo ibuprofen, anybody that's listening. That's scary. Yeah, it was scary. And I could have died. I almost died, to be quite frank. I was very close. If they wouldn't have taken me to the hospital. That could have happened. Did runners abuse ibuprofen? Absolutely. It used to be like before I had dealt with chronic shin issues and it'd be nothing for me to take three, you know, an hour before my long run on the weekend or three before a quality session on a Tuesday. And after your story, I mean, I got to be on death's door in order to take it for anything now because I'm so gun shy of it based on what you had said. But you were, you know, you were taking 12 ibuprofen a day for years, right? I mean, that's a different story than taking it for short term use, but it was actually 12 ibuprofen for how long do you think? A day. For how long in reality? Well, let's see. 18, 19, 20. This probably happened around 21, maybe three years at least. And during this time, it's no coincidence. It was like you were having tummy troubles when you were running and you were like all these things like you can look back and be like, well, no wonder every time I ran, I had to go to the damn bathroom because my body was so out of whack. It's like so easy to see in hindsight, right? But in the time, you probably think nothing of it. I can buy ibuprofen over the counter. It can't possibly do this to me. Right. Right. Also, while I'm sure a year for your liver to return to healthy was a long time, it's also kind of astounding that it can do that. I know. As damaged as it was. I was so worried. And she's like, no, you'll be okay. But no more ibuprofen. And I didn't drink at all for that whole year because alcohol, you know, that scared me. Matter of fact, it took me a while to even take a drink because I was too scared to. Yeah, your liver enzymes were like, let's say, for example, you have your AST and ALT and they're supposed to be, one supposed to be around 30 or 40 and one should be at 70 or under. And yours were in the multi, multi hundreds each, right? Like you were a lifelong alcoholic of decades. Yeah. Not good. Yeah. Can you, okay, just because we're on this train, baby. Okay. So all of these things, can you, and I don't know the answer to this or the answers to this. I'm trying to set a stage for people, okay? Can you walk us through all of the surgeries and or notable injuries you have had since birth? Since birth? Yeah, since birth. Like you want all of them? I want to know. Yeah, I do. Like even non-injury? Let's keep it athletic specific. But for example, I know your first major surgery happened in college. No, high school. Oh, high school. Okay. So tell me. Okay, it started with knee issues in high school. Meniscus, I think it was just a cleanup, both knees. Just a cleanup of the meniscus at like 16, no big deal. Yeah, it was, yeah. So that was high. But then in high school, I started getting severe what I thought were shin splints, right? And I was just icing them and icing them. My coach, you know, just keep icing them. Oh, the pain. And then when I started running at St. Cloud State, we had indoor track too. So you know those little indoor tracks, that's a lot of pounding. And it got to the point where I couldn't stand up straight. My sciatic nerve was being pinched off. My toenails were turning black and falling off. I'm like, something's wrong. So I went to a doctor and it turned out I had pretty significant compartment syndrome. Do you know what that is, Brecken? Since birth? Yeah, since birth. You want all of them? I want to know. Yeah, I do. Like even non-injury? Let's keep it athletic specific. But for example, I know your first major surgery happened in college. No, high school. Oh, high school. Okay. So tell me. Okay, it started with knee issues in high school. Meniscus, I think it was just a cleanup, both knees. Just a cleanup of the meniscus at like 16, no big deal. Yeah, it was, yeah. So that was high. But then in high school, I started getting severe what I thought were shin splints, right? And I was just icing them and icing them. My coach, you know, just keep icing them. Oh, the pain. And then when I started running at St. Cloud State, we had indoor track too. So you know those little indoor tracks, that's a lot of pounding. And it got to the point where I couldn't stand up straight. My sciatic nerve was being pinched off. My toenails were turning black and falling off. I'm like, something's wrong. So I went to a doctor and it turned out I had pretty significant compartment syndrome. Do you know what that is, Brecken? Since birth? Yeah, since birth. You want all of them? I want to know. Yeah, I do. Like even non-injury? Let's keep it athletic specific. But for example, I know your first major surgery happened in college. No, high school. Oh, high school. Okay. So tell me. Okay, it started with knee issues in high school. Meniscus, I think it was just a cleanup, both knees. Just a cleanup of the meniscus at like 16, no big deal. Yeah, it was, yeah. So that was high. But then in high school, I started getting severe what I thought were shin splints, right? And I was just icing them and icing them. My coach, you know, just keep icing them. Oh, the pain. And then when I started running at St. Cloud State, we had indoor track too. So you know those little indoor tracks, that's a lot of pounding. And it got to the point where I couldn't stand up straight. My sciatic nerve was being pinched off. My toenails were turning black and falling off. I'm like, something's wrong. So I went to a doctor and it turned out I had pretty significant compartment syndrome. Do you know what that is, Brecken? Since birth? Yeah, since birth. You want all of them? I want to know. Yeah, I do. Like even non-injury? Let's keep it athletic specific. But for example, I know your first major surgery happened in college. No, high school. Oh, high school. Okay. So tell me. Okay, it started with knee issues in high school. Meniscus, I think it was just a cleanup, both knees. Just a cleanup of the meniscus at like 16, no big deal. Yeah, it was, yeah. So that was high. But then in high school, I started getting severe what I thought were shin splints, right? And I was just icing them and icing them. My coach, you know, just keep icing them. Oh, the pain. And then when I started running at St. Cloud State, we had indoor track too. So you know those little indoor tracks, that's a lot of pounding. And it got to the point where I couldn't stand up straight. My sciatic nerve was being pinched off. My toenails were turning black and falling off. I'm like, something's wrong. So I went to a doctor and it turned out I had pretty significant compartment syndrome. Do you know what that is, Brecken? Since birth? Yeah, since birth. You want all of them? I want to know. Yeah, I do. Like even non-injury? Let's keep it athletic specific. But for example, I know your first major surgery happened in college. No, high school. Oh, high school. Okay. So tell me. Okay, it started with knee issues in high school. Meniscus, I think it was just a cleanup, both knees. Just a cleanup of the meniscus at like 16, no big deal. Yeah, it was, yeah. So that was high. But then in high school, I started getting severe what I thought were shin splints, right? And I was just icing them and icing them. My coach, you know, just keep icing them. Oh, the pain. And then when I started running at St. Cloud State, we had indoor track too. So you know those little indoor tracks, that's a lot of pounding. And it got to the point where I couldn't stand up straight. My sciatic nerve was being pinched off. My toenails were turning black and falling off. I'm like, something's wrong. So I went to a doctor and it turned out I had pretty significant compartment syndrome. Do you know what that is, Brecken? Since birth? Yeah, since birth. You want all of them? I want to know. Yeah, I do. Like even non-injury? Let's keep it athletic specific. But for example, I know your first major surgery happened in college. No, high school. Oh, high school. Okay. So tell me. Okay, it started with knee issues in high school. Meniscus, I think it was just a cleanup, both knees. Just a cleanup of the meniscus at like 16, no big deal. Yeah, it was, yeah. So that was high. But then in high school, I started getting severe what I thought were shin splints, right? And I was just icing them and icing them. My coach, you know, just keep icing them. Oh, the pain. And then when I started running at St. Cloud State, we had indoor track too. So you know those little indoor tracks Spread them out a little bit longer. And by the time I finished physical therapy, I was doing pretty much, I'm doing everything back to normal, pretty much. And then I had my six week follow up with the surgeon. And at first his physician's assistant was talking to me and she said, okay, at six months you can start running about 20 miles a week. And I looked at her, I'm like, what? No, he told me I could get back to running full, like more than that. And she's like, nope, that's protocol, 20 miles a week. And I'm like, no, no, no, no, go ask him. I think I can do more than that. And so she went back and talked to him and came back in the room a few minutes later and she's like, okay. He said, you can run as much as you want. And he wants you to get on, start running on the Alter G treadmill. So if you don't know what that is, it's a regular treadmill, but you zip into this bag and it fills up with air and it calibrates your weight. And then you can adjust the percentage of your body weight that's actually hitting the treadmill. So I started that at two months and I'm going to be doing that through the end of May, which will be my six month thing. And I started at like 70% and then 75%. And I was telling Kirk on Tuesday, I was up to 80% body weight and it felt good. Where do you have access to that? I had my surgery through, it's called TCO here in the Twin Cities. And I just go to the one in Woodbury where I live. Yeah, just right there. Pardon me? And it's cheap. Like, don't you pay like, isn't it like 15 bucks or something? Like $12 a session. I bought a pack of 10. I'm like all day, every day. She's like, I don't know if you'll want to do this, but this is how much it is. I'm like, sign me up. I think reasonable. Oh yeah. I go once a week and I'm only supposed to be for a half hour session, but I was on there for like hour and 15 on Tuesday to get my whole workout in and they don't say a word to me. They just let me go. So I'm privileged enough to get to chat with Darla on a regular basis. So I know where I can take this conversation, Bracken. But hearing all of that, sometimes I like talking to athletes you work with because like it's like I'm green and so it's fun to like take control of the conversation, right? Do you have any desire to do that right now or can I steer the ship? I want you to steer it today, but I do have one last question with the total knee replacement. So what is the prognosis from an optimist standpoint? You can run, but what? What's the drawback? What's the long-term issue? But what for me or but what for the general population? For you. For me. Really no buts. He said do whatever you can do. Go for it. And so that's what I plan to do. Kirk has me now on a training plan. I want to do a Hyrox race. Never done one. So I'm going to do that. I might jump into a Spartan race depending on how my knee is feeling. You know, I'm not going to be dumb about it. If it's really hurting and swollen, I'm not going to push it. But I already am signed up for the Twin Cities 10-mile race that's during the marathon weekend in October. And then I'm signed up for a half marathon in the fall as well that's here in the Twin Cities. So those two for sure are on my goal list. Okay. And is there arthritis risk now or tendonitis? There's nothing left in there. It's all fake. You're good. Yeah, the only thing, the reason that they normally put a 20-mile limit on miles per week, I guess, is just the wear and tear on the hardware that's in there. Are you signed up for City of Lakes Half? Yeah. We have yet to discuss, I guess. Yeah. I don't have a race calendar for you put together yet, but I had an idea what you're thinking. And Hyrox. Yeah, you better sign up the day those races are announced. Otherwise, you're out of luck in case you're wondering. You'll have to work with me on that. I don't know. I got a lot more. I got to get stronger. Okay, so you more often hear, let's say, like you say there's two type of major joint replacements in the lower half, the hip replacement or the knee replacement. Believe it or not, the hip feels like a bigger deal, but it's a notably less big of a deal than the knee. The knee is far more complicated. But I don't know to what degree. Do you know what exactly this is? I'm sure I could watch a YouTube video on it, but I don't know. In a hip replacement, they lop off your ball joint. They replace the ball joint. Whatever they got to tighten up in there. Not that it's straightforward by any means, but I can understand. But now you've got your tibia and your femur connecting at your knee and all these other moving parts. What do they do exactly in there? Do you know this, Bracken? Do you know the answer to a knee replacement, like exactly what happens in there? Nope. Okay, good. I watched a little bit of video, and I did read about it, and I think it was ranked number one most painful surgery and hardest to recover from of all surgeries. And the nurse was telling me they call doctors, orthopedic doctors that do total knee replacements, they call them the carpenters of orthopedics because they literally are in there with a hammer, and they're hammering the pieces onto your bone, and they're not gentle about it. I watched the surgery. I'm like, whoa. So I guess I can't give you a really educated answer to that, Kirk, but I can tell you that they add everything that's in there, the joints and the ligaments. I didn't have to have a patella remade for me. Mine is still my original, but I had a bunch of bone spurs that they had to shave off, and I had some stress fractures in my femur and my tibia from all the pounding and bone bruises. So they had to shave off all that, and then they put the pieces over your femur and your tibia to act like makeshift cartilage and meniscus and everything in there. But to give you a really good educated answer, no, I can't. I didn't do enough research. Sorry. What do they replace? Do you know? They don't lop off the heads of your femur or your tibia, or do they shave it down? They shave them down. And then mold on a new material to give some sort of mobility and cushion, and then they somehow bind it all together with fake crap? Yeah. Okay. Yeah. I guess I should have done more investigating, but to be honest, I really didn't want to know because then I think I would have been more like, oh, that looks really painful. When I started watching the video and I saw them start to hammer, I'm like, okay, done. I don't need to know anymore. So they cracked your bones. You had fractures in your femur from the surgery itself that needed to heal as well. Oh, no, they didn't crack my bones. I cracked my femur and my tibia because before surgery I was bone on bone, and the pounding, the bones were hitting against each other so much. I had micro tears and stuff in there. So this recovery was really just all the things that you can do. You had an ACL recovery, and you had a stress fracture recovery, and you had micro fracture recovery, and all of that together, meniscus recovery. It was all the recoveries wrapped up into one. All of it wrapped up into one. And I can tell you, even though I'm still in, I wouldn't even say pain, but I have discomfort. It swells up. Way less pain than I had before surgery. Way less. No ibuprofen. I don't have to take, I don't even kill the need to. I'll rub on some CBD oil, something like that. If I said, Darla, go run a mile right now. Go run a mile hard. Do you think you could do it? Yes. And you think you could do it without changing your gait too much? I think I'd be better than I was for sure. Yeah. Because when I run on the Alter G, you watch your feet. There's a video, and then you can also watch, they calibrate your gait. And I'm pretty even left to right, like pounds of pressure. All right. So this leads me to a conversation. You just mentioned, like Bracken, you talked about, like if I'm finally on my second, you know, meniscus surgery, and I'm like, I think I'm going to throw in the towel. Somebody may say that, right? Like, you know what? It's enough running is clearly me and running are not, we're not in a relationship anymore, right? So it's easy to do that with one or many of the things that you've had over the years. And I use this phrase or analogy with athletes who are kind of on the injury front or they're sitting around moping or they're not being assertive with their recovery or goals. It's like the old man who starts building birdhouses. You probably wonder where I'm going with this. You're like, why does my grandpa, my grandpa did this. Why is this guy building birdhouses all of a sudden? And why is he doing, why does he all of a sudden have raspberry bushes in the backyard he spends hours a day playing with? And why is his lawn perfect now when it used to suck? And you know, those who die in the chair, sitting on the sofa with the remote watching Maury Povich, they're gone. They're out of here. Give them two to four years and they're out, right? They're not looking forward to the next thing or spending their time on anything productive. They die in the chair. And I think there's a mentality to that with injury and injury recovery as well. You telling your dogs to be quiet? No, I'm telling my son. He just walked in the door. I was like, because your dogs were barking. I'm like, your dogs respond to that. You just shush them. No, with the dogs, I just give them a look. And they're like, oof. So you're certainly not dying in the chair to Maury Povich, we will call it, right? No, no. So the question I'm walking you into is why? Why keep coming back? Why go through all this? Why spend, just I'll start there. Why? The why? Why? Why are you so stubborn? That's a really good question. And I do other things too. Like I golfed since I was eight years old. So everybody's like, just get back into golf. You were always so good at that, blah, blah, blah. And I'm like, yeah, I can golf more. Yeah, I'll do that too. But there's just, Kirk, and Bracken, both of you know, there's nothing like running, you know? Like just getting on that treadmill on Tuesday and sweating and getting my heart rate up to 160. That feeling, that elation, you know? And then I miss being out on the trails and just the beauty of nature and, you know, all of that. I just love it so much. That's, I guess, just the thought of not doing any of those things or having that feeling anymore. Because, you know, I've been just cross-training since my surgery, riding the stationary bike, walking on the treadmill at 15%, doing the rolling stairs. Oh, elliptical. I do the elliptical without arms. You know, I just like run on the elliptical. That gets my heart rate up probably. And the rolling stairs more than anything. But it's still not the same, you know? So... Well, I even do that stuff. Like... Why? Here's the thing. There's... I can name six athletes I know personally right now who aren't doing their part. They're coming back from injury or they're making excuse after excuse. They're not going above and beyond to get themselves either one in shape while they're injured so when they return to running they can or two. They're just not fighting for it, right? And there's a whole host of athletes who are that I'm working with. You would be the shining star leading example, you and a handful of others. But it's like you just went through a major surgery. You took two effing weeks off, was it, after it? And then you're already in the gym. You're on a six or seven day a week program for me. You're working out 10 sessions a week between strength and cross training. You don't like the elliptical. You don't like the stair mill. You don't like any of that BS crap you have to do. But you do it. It has as much to do with the fact that you're doing all the shit you don't want to do because the end goal and result is that important to you. And I just wish it would get through people's thick skulls. That's all. And you're doing it. Yeah. I guess it all comes down to personality too. I'm very type A, very driven. It's probably no surprise to you I have ADHD. I can't sit still for very long. I'm very energetic. It's gotten me in trouble most of my life. So I guess at that and then just, you know, I've always had a hard work ethic. And so maybe a lot of it's personality. It's just who I am. I always have been driven. One of the fears... I've been called tenacious a lot of times. One of the fears people have... And crazy. Sorry, Bracken. No, it's all right. One of the fears people have though is that I'll never get my fitness back, especially once I'm not 25 anymore. That if I go through these big things, it's not going to be waiting for me on the other side. And obviously we like to preach the engine's engine, cross training works, but nothing works like running for running. So in your experience, I feel like you have that perspective that a lot don't because you've managed to race throughout all of this and you keep coming back and you keep winning your age group every time you go out and being on the podium and everything. So what has been your experience with that fitness loss during rehab? Yeah. I have to toot Kirk's horn here a little bit. He has a lot to do with it. He gives me my workouts. And again, being the type A person, what he tells me to do, I do. And so if I have a plan in front of me, that's what I have to do that day. And having that accountability and having him telling me what to do, helping me, supporting me, that keeps me motivated too. And just seeing the results after the injuries I've had since working with him, cross training through them, I know that if I keep my fitness level as high as it can be on these other modalities that on the other side, I'm not going to be at my highest running capacity, but I'm not going to be where I would be if I hadn't been working the whole time. I won't have to dig myself out of a huge hole. You know, that's a good point. It's as simple as like people often when they're injured will go off, they have a plan when they're running or a loose plan or hopefully a diligent training plan, and then they get injured and suddenly it's like the spring break of training. Like nothing, there's no rules. There's no, it's just like I do this when I feel like it or I try to do this. And then suddenly they're not attaining the appropriate stimulus and much less stimulus as well, usually on top of it. And so the simple point of you just saying as dumb as it is for me to just hear it out of your mouth and for it to be a light bulb moment, it's like it's as simple as making and having a plan and then sticking to it. We suddenly lose sight of that when we're forced to cross train if running is our love. But that's the thing you've done is you've had a plan and then you just stick to it. And is a 45 minute tempo, which I know I've prescribed you, a cross training, does that sound awesome? No, it's not. 45 minutes, a grind on anything. You're doing run duration sessions on cross training that is far less stimulating. No, not very exciting. But yeah, it's just the plan. I think it's that whether you make it yourself or you rip one offline or you hire a coach, that's what it is, is just having a plan when you're not able to run. Yeah, and then knowing the why because I want to get back to racing. Again, that's my passion. Like I want to be out there racing until my feet fall off. You know what I mean? Like or until it's impossible. So I don't see they might, given your track record, you might get there. She'd be running on nubs. Kirk was already, like we were using, I think it was your analogy, Bracken, like a bike with, you know, two flat tires. And Kirk one day said to me, I was like a unicycle on the rim or whatever. There was something like that. Something like that. I'm like, yeah, that's about right. But yeah, so just being, you know, competitive. I need that competition and that goal to get back at that. Did you ever, have you ever actually thrown a pity party, hands in the air, like, you know what this actually is it? Have you ever given yourself the opportunity to be like, it's over? Well, so when I had the three torn hamstrings, so I had that surgery in like October 2019. No, no, no, no, 18, 2018. And then I had my tibial osteotomy just four months later. So I was on crutches, non-weight bearing from, for like almost eight months. And for like four months recovery for each and non-weight bearing, like only on one leg. That's why my right quad, Kirk to this day is still so much larger than my left one. And I have a lot of catching up to do. I remember when day. Like I had to sit on a chair in the shower because I couldn't put weight on my left leg. And I just started crying. That was my low point. I was like, what am I doing? This sucks. And I just sat in there and cried. And then I got out of the shower, looked at myself in the mirror, and I'm like, suck it up. Get out of this pity party. And I just had a hard talk with myself. And that was it. I'm like, okay, I'm done. I'm not going to dwell on it. It is what it is. It's going to be over. And now looking back at it, as horrible as that time was, it was not fun. Now it's like a blink of the eye. It's like, wow, I hardly even remember that happening. But it was a dark time there for a little bit. Yeah, it's amazing how quickly time passes in both sides. Like if you let it go, suddenly it's race day in a blink of an eye and you've not prepared. Like 10 weeks to race day disappears in the blink of an eye. But so does 10 weeks of rehab. Now, one of them passes slower in the moment. But once you're over it, they're both gone and it's barely even there anymore. And that's the big piece I had struggled with in the past and that people struggle with is the thought of what 10 weeks or 10 months is going to be is too daunting. And then suddenly it slips away and you've done nothing rather than just getting through it. And now it's over, but you've done something about it. Either way, you're going to be on the other side looking back and saying, where did the time go? So you might as well be waiting with something in hand. But it's not a simple task. And I'm the first one to admit I've struggled with that entire concept. And it seems like you, your pity party is less shorter than most people. You gave yourself your pep talk right in that same time period, minutes later. Some people it's weeks, some people it's months. Yeah. Yeah. And I would get down here and there, but even with this, six months of no running, I didn't realize it was going to be that long until after surgery. He probably, I'm sure he told me before surgery, but I think I might've blocked it out. And then after surgery when I'm like, when can I start running? And he's like, six months. That was another hard reality for me. But I've just been plugging away and now I'm at four and a half months. I've only got a month and a half left. I've just been going at it week by week. Okay. I got another week down, another week down. Getting there, getting there. And what's harder for me, you guys, you still talk even Kirk, he's like, I'm a master. What are you now, Kirk? 42? And you're like, get 41. Getting up there in age or whatever. I'm older than both of you guys. And so I don't have the grace of time on my hand. If all of this knee stuff would have happened when I was in my 20s, I would have gotten it taken care of. I would have had an ACL repair. I would have done whatever. But that's why I put it off so long is because I don't have that quality of race time left that I did in my young years and that you guys still do. What are you, 50 what? I hate to make you say it, but I know you don't like saying it, but it's inspiring. I'll just say I'm in my mid 50s. You know what though, thinking about just if I can zoom out a bit and think about your training the last at least five years, but really since 2018, you haven't been able to train and execute 100% in seven years. You may be as, you know, where's the blessings here? Even those hamstring attachments bother you from still, right? No, to be quite honest, that knock on wood, I'm great. But I tore two more in my right side. They're torn at this time. Yeah. Of course. What I'm getting at, okay, so you've mentioned your hamstrings hurting. So okay, it's the other side. It's so hard to keep track of you. The point being is a lot of these other things that also were overshadowed by your knee are also having time to heal a bit as well, which is maybe a blessing in disguise. And so not like I need to put on these super rose tinted glasses or a three quarters full glass, but there is a chance barring your return to running goes semi well that you're actually able to train at a level that you haven't been able to for quite a while, barring how this goes. So there's a chance that not your best days are behind you. I mean, you PR'd in the marathon at what age? 47? 46. 46. And you ran how many marathons before that? Still PR'd? I probably ran like five or six before that. And then PR'd 46, yeah. So there's possibility here. Oh yeah. And just outline, okay, you mentioned this time period when you're feeling bad for yourself in the shower and your stupid boots sitting on your stupid bench in the stupid shower, right? Yeah. What were you doing then for training? Did you just throw your hands in the air and be like, well, now I really can't do anything. Like I got a boot for six months. What were you doing then? It was a leg brace. Kirk, you remember? I was coming into you and I was doing individual training sessions with you. And I have a video of me like doing pull-ups and then one-legged burpees. And you had me doing one-legged rowing. Like, yeah, everything was one-legged. Right. I know what you did. I'm trying to help you outline that even during that time, what did we do? We went all in on strength. We went all in on strength. You were doing upper body, like this is my chance. And you got jacked. I mean, you were like the thickest I've ever seen you as far as like muscle bulk. You were like, well, if I can't do these things, I'm going to work on these other things. And it's like finding what fruit you can still grab and hold on to, right? And it was like there was no stagnancy. It wasn't, so what if I can't run, I'll crawl. And if I can't crawl, I'll do one-legged stupid burpees, right? It was like we did everything. You just did everything you could to the brink of allowance is what you did. And even then, it'd be very easy to be like, oh, screw it. I have one leg right now. But no. Didn't we have you on like a five-day-a-week split routine for upper body and core? And you were just like, it was like now you're a gym rat until you could use your other leg again. Yeah, I got kind of bulky, which I loved. For you, bulky, right. But you got strong. So point being is there's always, and Bracken knows this because, Bracken, you've taken this approach with your strength, haven't you, a little bit post-surgery at times? Yeah. Yeah, I tried it all. Yeah. And the one-arm assault bike and single-leg work and whatever you can do, German volume training. But it doesn't change the fact that you still have to do it. Right. So true. Like those six months are going to flash by. Yeah. You just have to do it either way. You'd rather hold fitness than regret. Oh, and you know what else? Those six months go faster if you do something about it versus sit on your thumbs and be like, I'll just wait for it to heal and I'm going to do it. That's the longest six months of your life. You want to make it go quick? Set your alarm for four in the morning like you do or whatever you do. Go to the gym. Stay in your routine. That's how it goes in a blink of an eye. It'll be the longest six months of your life if you just sat there on the couch. I'm sure you've taken the time to like dwell into other things that I don't always take the time to do that I love. Like I play guitar. So I've been playing guitar a little bit more. You play guitar? Yeah, you don't know. I used to play a lot of instruments. Music was my first passion. So I've been, you know, I use my time a little bit and I've been doing a little more of that and, you know, just doing other things to also enrich my life that sometimes I get too absorbed with my training and my running. So, yeah. Just like you and your hunting, Kirk, and your fishing. Takes time away, but it also is a very, very good use of my time in my opinion. Bracken, you want to say something? Well, just a reminder that returning to sport after an extended time away is either sequential or it's guesswork. It's almost like there's an airplane sitting on the runway and you either put a pilot in there or you put an everyday person. If the everyday person is going to get in there and they're not going to know exactly what the throttle stick is going to feel like and they're not sure when they need to pull up, like when got enough speed to take off. They're probably going to skip it or hop it or wait too long. The pilot is the person who's been cross-training the whole time. They know what's underneath them. They know what it feels like. They know when they can trust the plane to take off and go. There's no guesswork like, will I gain altitude or will I come back down? Because they've practiced this thing. They know it. And that's the difference. I've done both approaches. I've sat after surgery and just waited until I was healthy. I've been going on and on about my woes. How have you gotten through your surgeries? The first two I did sequentially. One I worked too much too soon. And you said the surgeon did a great job. I think one of my knees he did a great job and the other was either a mess or he didn't do as good of a job. But that one took three times as long as the other one and they were supposed to be the same surgery. But those two were scripted. They were sequential. And then my third surgery I was like, you know what? Everything's bothering me. I'm just going to wait until I'm right and then I'm going to get going. And then I got behind the wheel and I didn't know what the plane was going to do. Like I don't know what I can handle right now. Because it's not like I've been building up my hours of training and now I'm just removing one stimulus and adding another. Now I'm just starting out and I don't know if I can bear the weight. I don't know if I can take these hours. I instantly regretted all those weeks of waiting until it's right. Like yeah, wait until it's right to damage it, to push it. But all the other systems should be worked and can be worked. And if you don't, you just don't know what's waiting. And I will never do a non-sequential rehab ever again. That whole wait until I'm healthy to go, it's comforting in theory. But all you do is like you sit in your own head and wonder. Or at least like Kurt said, if you're getting up every day to do it, you know exactly what you're doing and then you start to see progress and feel progress and you gain momentum. And by the time you're correct or healthy or you're right again, you already have the ball rolling. So I've screwed it up and I've done it well and I've done it medium. Doing it well is the only one that's satisfying. Yeah. I would like to just interject because I'm thinking of two people in particular right now who, if they're listening, are probably feeling either a little bad about themselves or inspired or something, but they know they're not doing what we're talking about. Okay. And I want to talk to those people in particular who are limping through their injuries or their recovery. And one is, the first thing is don't let Darla's mindset get in the way of your recovery, meaning the first priority is to heal and there are injuries in which sometimes you have to listen to, right? Like you had a boot on your foot and your leg and you could not do things that wouldn't set you back. So you went and did biceps, which pay off zero in running, for example, but it's what got you through, right? So like the caveat being I can think of one person in particular sitting there with a boot on right now and like can't really do anything. And like that is still the right answer sometimes for some people. It's not like nose to the grindstone no matter what. So like there are exceptions to these rules where, yeah, rest is mandatory. You would take weeks off, right? So just so you know, like you don't suck if like you're literally in a boot, but you could be doing gym stuff or you could be doing something. So just like one, like this rule should apply to most of you, but like there's periods of time where I've said this before on the podcast, I had five months off with two stress fractures in my foot, my last major injury. And was it 2000? I think 2000. So I'm going almost on five years this fall of being knock on wood, relatively injury free. There's no question why I'm successful recently because I've been healthy. But point being is I should have been done with this at maximum 10 weeks and my cross training set my recovery back. I was so diligent that it took me another two and a half months before I could run. And if I went back and looked at it and was like, Kirk, you idiot. There's like a give and take is what I'm getting. So not Darla's mindset at the expense of your ability to return to running. There's caveats. So I just wanted to like say that. And also every situation is different. Listen to your doctor, number one. Like don't do anything you shouldn't be doing. To a point, like to a point. Like he said, no running. Okay, I'm going to work the hell out of my upper body. You don't know me, son. You don't know me. Right? And that's what I said to his physician assistant. And she's like, no, you can't do that. Go talk to him. You don't know me. He knows me. Yeah. I think I had another point there, but I forget it. I said what I wanted to say. Well, I'll jump in because this is one of those times where I think there's two examples here where the perfect is the enemy of the good. And I've talked about this on here before, but like the perfect rehab plan is sometimes what's going to stop you from doing it. Like you, Kirk, had a perfect rehab plan. You were going to maximize your engine, but it also set you back. I never have even come close to having the Strava relative effort score for a week since being injured. I doubled down that hard. My output was higher than it's ever been in my life. Look where it got me. If you would have just done a good job, you would have healed quicker. But then on the other hand, Darla is kind of the example of the perfect, right? It's never a question. I can't sit still. I will not accept this. And people might look at that and be like, I could never do it like that. So I'm taking the weighted out route. It's like, no, don't let that perfect option prevent you from doing a good option. So you're not going to be on the Alter G for 75 minutes, but maybe you'll be on the elliptical for 20. Don't let that perfect example keep you from doing a good example. Either side of this, that phrase just hits home more and more to me over the years. Like don't avoid doing something okay just because you can't do it perfect. Be the okayest rehabber for a while. And that's going to lead to some good rehab. And that's going to lead to great. And maybe you get to perfect eventually. But if not, you come back with okay fitness rather than no fitness. You made a, something that you said actually sticks with me, Bracken. This is something you've outlined on the podcast. I don't remember. You were new with the baby scene and the kids and time was at a premium or you were managing your schedule well or whatever it was. And you had this thing where like, I'm at least a mile, right? The greasing the groove theory. And you would sneak out at 8.30 at night and go pound a mile at six minutes for no reason cold and then come back home. And I remember you've mentioned, and this is true. I mean, was that perfect? No. Was it good? It wasn't even good. Was it okay? Not even okay. It was like scoff worthy at best. But you did that in your times of pinch and strung together big workouts at times. And what happened? You came on the other side of that and you're like, I'm actually kind of fit still or I'm kind of in good shape, right? And I was used to the act of running well. Right. Could I go run a great marathon? No. But could I start training for a marathon? Yeah, I could. Just I think of that sometimes. Like who cares if it's 20 minutes when you're supposed to do 70? I'll take 20. Whether it's due to pain or time or whatever. So all right. You have questions, Bracken? No, I'm just I feel alternately impassioned by this and called out by this because I'm as everyone probably has caught on over the five years of this podcast. I am dialed when I'm dialed and I miss a fair amount of training. Ever since we left Colorado and I stopped trying to do this as a quote unquote profession, I just can't consistently keep my nose to the grindstone anymore. And so I listen to Darla and I'm like, yeah, I get impassioned. I speak about it like you just have to do it. And then I sit back and I think, and you're a hypocrite. And that's true. Everyone listening is on one side or the other. You're either crushing it or you can do better. But either way, I think like this is perfect. I can do better here. And I'm also like crushing it sometimes. And every single person listening to this is in one of those two boats. So I'm just excited by this episode and embarrassed. This isn't a comparative. It's an example episode. Yeah, exactly. I mean, you know, people look at me and think you're kind of crazy. My kids are like, mom, just give it up. You got to stop. My son told me, I'm not going to take care of you for another knee replacement. Like when he sees me going to work out again, he's like, you just need to relax a little. It comes at a cost, right? It's easy to paint this like tough Again, example-wise, and then I want to ask you about your hopes and dreams, Dyla, moving forward. But when all this started, single mother of three kids, one was in middle school and high school when we first started working together and you were going through all this. You haven't had a hand. You had to work hard to buy your first freaking house as a single woman, like worked your ass off to be in this house you're talking to us in. Your alarm goes off at what time every morning? Well, when I work out with you, 4.15. The other day is 4.45. Oh, sleeping in. Those, right? You are a person who maintains an active social life, meaning like you make it a point to like connect with your friends and whatever else is going on. You work your 40 plus hours a week. That's not, you've worked hard to progress in your business and company. It's not like there's people who are busier, of course. There's always somebody busier, but like you check all the boxes that could be like, if I wanted to make an excuse, I've got them, right? And you haven't. And so there's going to be people at home saying, well, yeah, but she probably has some posh life or some bougie husband who pays for all her crap or this like, no, like you've earned everything you have and your alarm still goes off. Like there's no, I couldn't point one thing to be like, yeah, this is a gimme for Diallo. Like this one thing is a gimme. Like, can you think of anything? I can't. That's a gimme? You just talked about paying for your daughter's college, you know, for many years and things that you're still giving to others that like when you're already just, you know, making work for yourself. So like there's just a lot going on here, I feel like. Yeah, yeah. But yeah, when I got my divorce, I had nothing. I didn't have a bank account. I didn't have a savings account. I had zero dollars of my own. No job. I had been a stay-at-home mom for 14 years. And then I had to, luckily I had a couple college degrees behind my belt and that helped me get a job, a good job at a good company. And then I had to work my butt off to work my way up the ladder. But I had three little kids at home depending on me. So motivation right there, right? Yeah, another almost all. Aren't they all out of the house? Well, my son still lives with me and he goes to school. He's actually graduates in a couple weeks here from college. And then he has his student teaching and then he's going to Japan to teach in Japan. So yeah, so he'll be leaving and then I'll be all alone. My other one's at the U of M. She lives off campus with friends. And then my oldest daughter, or she's my middle child, but my oldest daughter is in Florida, works down there. In the fitness world. In the fitness world. So, okay, I think I've said enough. I've pumped you up enough. People are sick and probably hearing me do that. So what is your plan now? If you were to say, okay, now we've talked about working through injury. Now what? Like, okay, I'm on the cusp. You're going to be able to get the green light to run in like four weeks or something, right? Yeah. Let's take me out of the equation. But I'll be writing your stuff. What is your plan now? You've had to reintroduce running so many times. What have you learned from that process? From like the can't run to reintroducing running. What have you learned? And what would be your plan? I've learned in the past that to keep my expectations in check. I'm not going to come right back and be peak fitness. So it's going to hurt for a few weeks. I'm going to have to build my fitness back up. Even though I've been staying fit, like you said, but not race fit, right? So I got to build that back up. So my goal is just to, you know what I would love to do, Kirk? I would love to come back on your podcast in a year and not talk about injuries. Talk about my successes or talk about other things. I don't want to be the poster child for injuries like I have been, you know? That, ugh, I'm over it. So over it. I just want to get out there and have fun and not be thinking about being hurt. But anyway, yeah. So I'd like to try a high rocks race, like I kind of mentioned at the beginning. I want to get stronger, like muscle-wise. And so you got me on a plan to start doing that, heavier, less reps. And then once I can start running, start running as much as I can that can be tolerated by my knee so that I can do the half marathon and the 10 miler in the fall. Jump into the Spartan race. Yeah, I think that adjusting expectations when you return, like you could be training 10 hours a week aerobically, cross-training. You could be cross-training more time than you were spending running before you got, you know, injured or out. And it is the return to impact and how that demands the body. And as Bracken likes to talk about a lot, like the mechanical efficiency of running. She gone. She gone. And your ability to take impact of the running variety as much as strength training helps, and it helps a ton, it doesn't replace the running. And so even you, for example, running quarter-mile repeats at like six flat pace on the Alter G. Weren't you somewhere around six flat pace for your quarter miles at 80%? Yeah. Well, suddenly those are seven-minute pace at full percent out on real terrain, and it's easy to get super beat up. And I remember every time you've come back, you're like, my metrics are so bad and they're so slow. And then about four to six weeks in, suddenly you start popping and clicking, but it doesn't happen. It's not like you just hit the ground where you left off. Your cross-training diligence isn't immediately rewarded. When it's rewarded is once you return to your resiliency to impact. There's fitness in there that you can't access because your structure is giving out first once you return to running. And so once you turn the corner, you turn the corner and gain fitness fast, but it doesn't change the fact that your first four to six weeks are tough. That's been my personal experience anyways, Bracken, I think probably for you too. Yeah. Yeah, I agree. Yeah, you're inefficient. Yeah. And you have to get that back. But if the engine's waiting, it's mostly skill work and impact work. And that catches up much quicker than building engine at the same time. But there's that tipping point. One day you realize, oh, this isn't awkward or cumbersome anymore. Suddenly my heart rate's down and my pace is up, and then you're just back. And there's no better feeling, I don't think, from a training standpoint than suddenly not thinking about the thing you used to think about. Whether it was gasping, whether it was pain. Pain is a big one, but as soon as the negative piece is gone and you realize that it's gone, there's this magical window where you notice it's gone every single time. And then eventually it just becomes normal. But until that normalcy wears off, it is the greatest feeling. You mentioned that with something. You're coming back from your meniscus surgery. What was it you were talking about? You realized you weren't thinking about it because it's so easy to think about it every step when you're coming back from something. Yeah, at one point I just realized I wasn't thinking about how I need to lower my leg so it doesn't hurt. At some point I was just taking a normal stride and I realized it, and then it was so joyful to take a normal stride. But then eventually it's just normal. But for a little while there, you're in that sweet spot of it's so exciting to just do the thing you wanted to do. I can't wait to feel that. I know, I want that for you. A question, I guess, just because you talked about you want to be on this podcast, and then I think we can wrap this thing up, is asking you about what to look forward to in the future, and then you said, I hope I can come on here in a year and not talk about injury, which I sure want that for you as well. Have you done any reflection on what you could do differently moving forward? Is there any personal responsibility conversation going on in your head about, okay, what could I change to prevent anything? Like, okay, a lot of this feels like it's dumb luck to have these injuries, but have you thought about that? Like, is it just crossing your fingers and saying, I hope I'm not injured this time next year? Do you know if there's anything you could do to prevent or any thoughts you have on that? I mean, maybe when I was younger I could have done things to prevent, you know, been smarter, like when I started feeling something, maybe backing off a little bit or, you know, what have you. But at this point in my age and the wear and tear of years on my joints and my muscles, I think at this point it's just a hope and a prayer. Like, let's just hope things keep working. Like, he already told me my right knee is on the verge of, like, I'm missing cartilage there too. He goes, you're going to be back for another knee replacement. So I told him, keep that on hold. We're going to wait on that. But, yeah, no, I don't know, Kirk. I said with this knee, if it starts swelling up too bad, I'm going to have to back off. I'm just going to use my head and be smart about it. Did he give you a timeline on your other knee? We haven't discussed this. Did he say at this rate or anything? Well, he said, you know, year or two. Oh, gosh. So I say that's probably more like five. I don't know. Well, you have a year or two to build up as much fitness as possible. Yeah, there you go. Yeah. And it has been good. I do have tears in my right hamstrings. Two of them are torn. But I did that last fall. And this time off, I mean, I can still feel a little bit, but it has been good. And I've been working on my rehab, you know, doing strength training to try and rehab those tears as well. So it's been good to have this downtime for that reason as well. Just have to stay positive. That's all I keep telling myself. Just stay positive. Yeah. I just wonder, it's not always the case, but you see a runner maybe, let's say, in their 60s or something that's still running well and they're racing and they are a runner in the classical sense. But when they used to run 70 miles a week, now they run 30 and they do this mobility program twice a week they spend their time on. And now they're going and doing yoga for range of motion stuff and they still are running well, but they found another formula, right, where they're like still available, but they're not, you know, like are we all going to run the same mileage at peak that we did in our 20s and 30s? Most likely not into perpetuity. And so there's always, I feel like there's like a formula for everybody where it's like I can be happy with the amount of running I'm doing and the performances it gives me in conjunction with my own version of what this needs to look like now, right? And I think you're going to have to find that, right? I'm already a five-day-a-week runner, not a six-day-a-week runner, and I'm spending like I know I could run six days, but at what expense eventually, right? And so there's probably a version we got to figure out with you. So maybe your knee replacement is in five years instead of two, right, like coming up with like a plan that way, which is what I like about hybrid for a lot of people because you have so many things to focus on that aren't running that sometimes it can be a nice melting pot of stimulus. Yeah, and there's no way to predict the future. I'm just going to have to, you know, when I start running, take it day by day. How much can I do today? How much is my knee going to let me run today? Or do I need to take a day off and hit the bike? You know, that's just going to have to play itself out. I can't really predict the future, unfortunately. Well, I know I'll be showing up and your alarm will be going off. That's all I need to know. Yeah, and you'll still have to put up with me in class. Yes, I will. I think I'm satisfied, I think, with – I scratched the itches I was wanting to scratch. Well, I have a final question. Hit me. We always hear a version of this question anytime we talk cross-training or in Q&As, and it's what are the best exercises for maintaining running fitness? And we have an expert here. So in all of your rehabs and all your time away from running, what have you found yourself going back to for A, enjoyment, B, fitness building? So I think what helps me mimic running the most is Kirk gives me like workouts that are like running-based, but I'm converting them to a different machine. Being on the elliptical machine and not using my arms and just doing the running motion and putting the resistance up high enough that it's work, you know. I can get my heart rate up pretty good, and I feel like I can do my interval workouts and kind of apples to apples, but running, it's the most comparative for me. The rolling stairs, that can kick your butt too if you like no arms, right, and just work at a higher speed. I can get super high heart rate on there. Well, not super, but I can get my heart rate up there. Some people find it on a bike. I mean, I can get a good workout in, but it's more like Mondays and Wednesdays are kind of my recovery day, Kirk calls them, like an hour of easy, steady training is what he always says. That I do on the bike. That's pretty easy, steady training for me. And then after one injury, Kirk, I don't remember which one it was, but I had both legs. You had me doing rowing workouts. But I did those with you there, standing there, yelling at me what to do. If you have rowing, if done right, I got good workouts done on there too. But for me, sorry, answer your question short, the elliptical machine for me. Okay. No arms. Which is a lot of work, by the way, folks. Like your legs burn like something else, I bet. So you must brace the non-moving handles. So you're holding on to non-moving handles or you're using your arms in the run motion? Using my arms in the run motion, no holding on. And then I'll do my interval hard, you know, and then you'll say like, let's, for example, three minutes hard, a minute easy, three minutes hard. So I do the three minutes hard, no hands, and then for the minute easy, I grab on and use the arms. But when I'm supposed to be doing quality work, I'm pushing it, no arms. Yeah. You happy with that one, Bracken? I'm happy. Do they not have an assault bike at the gym you use? Oh, yeah, that too. And I should be doing that more because I know that could really kick my ass. But I'm intimidated by it. I don't know why. I've done it before. It's hard. So, you know, maybe you could work with me on giving me how to do it correctly and really get a good workout on there. I didn't know you had access to one. Oh, yeah. No, that's bad that you just informed me. The assault bike does not reward the slight of frame. Like the assault bike rewards body weight, like just mass, right? Which you don't have a lot of. No. I'm on the petite side, I guess you could say. But you put like a small person on the assault bike and it's like it's a death sentence. They can't put out wattage like somebody who's less fit but much larger, right? It's the rich get richer, poor get poorer on that thing for sure. All right. Yeah. Well, thank you, Darla. If people want to check out what you're doing, I think you've done a good job of kind of keeping people in your following up to date with your recovery process. Where can they do that? I kind of tried to do like a little bit of a series right after my full knee replacement because I had a lot of people asking me to do so. They're like, let me know how it goes. And I was like, okay, I will. But I didn't know if anybody would be paying attention. But you wouldn't believe the number of people that like reach out to me and after I post something and say, I have to have a knee replacement or blah, blah, blah. I really gotten a lot of feedback from it. So the little bit I did do. But yeah, I'm on Instagram. It's D-E O'Connor 7. Easy enough? Yeah. Did we do the thing today, folks? I don't know. Bracken, I feel bad. I feel like I did all the talking and I didn't get to hear much from you. That's how it's supposed to be. The less our audiophile shows up on these, the more the guest does, the better the interview was. Well, I'm a talker, so I probably have a lot of me. They get a lot of us on Tuesdays. Yeah. But I really appreciate you guys having me on. It's fun. Always fun to talk with you guys. I'm glad I was here for it this time. Yeah, me too, Bracken. Maybe I'll see you out at Afton this summer when you have your bro weekend. Kirk and I were just talking that we have to get one on the docket. Yeah. I think that's the last place. Well, maybe it was Highland. Either or. I've seen you out there. Yeah, we got to recognize we got to coordinate that, but maybe it'll be out this way. And Darla, I appreciate you playing hooky to record this. Hopefully nobody from work listens. No, I've been getting it. My phone's been dinging. I've been getting emails. Time to get back. All right. Thanks, lady. See you guys. Thank you. Bye, guys. If anything resonated with you on today's episode and you're curious about taking your training to the next level, check out therunningpublic.com where we have a training plan to fit your needs."
}