{
  "guid": "fa150d02-b3d9-3e0c-92ea-4280db9cefcf",
  "title": "Training Tuesday: The Best Long Runs (for most people)",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. It's Tuesday, folks, and you know what that means, Training Tuesday. We are going to take every rabbit hole, follow tangents, use useless metaphors, get lost in the weeds. This is Training Tuesday. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. Let me start with a sip here, Kirk. You have talked about how one of your great pleasures in life is having a coffee with me during our early morning or just morning recording. So today, I took a page out of your book. I filled mine up and didn't touch it until we got out here. It's a beautiful thing to share coffee or, in your case, fight milk with a wonderful friend on a beautiful morning. And when that caffeine hits you just as the conversation is getting going and you bring your best self to the table, it doesn't get any better than that. No, it doesn't. So I've decided... Hey, cheers. Put it up. Cheers. Cheers. What is that? It looks like urine. I mean, that is the color of a pretty hydrated fella. I have been using Celsius sticks, the little powder packs. I am just all about value proposition. They work for you. You get something like 15 for 10 bucks. That's like half off a Celsius at the gas station. Very much so. And peach. Peach vibe is currently my go-to. And this is a peach... I saved my favorite flavor for this morning, Kirk. You know what? You Celsius drinkers are the worst. You want to know why? Why? Because I run on county roads and people tend to throw crap out their car windows on county roads. And do you want to know what I see on the side of county roads? I see shot liquor bottles, just the little one and a half ounces or whatever they are. And I see Celsius cans. Those are overwhelmingly the two things that I see people tossing out their windows next to these county roads. So you guys, you shot drinking Celsius drinking fools, you're the worst. Well, when you see a little stick packet, then you'll know I've been in your neighborhood. I always, for years, I had a banana on my way to work. I don't anymore. I changed my routine, but I would have the banana. This is in the dark in the morning on the way in. And I purposely threw the peel out my window at the exact same spot every day because I just... Yeah, and it wasn't in somebody's yard. It wasn't like... It was just like one day I thought, maybe I'm going to go back here and I'm going to see all this banana that peels here. And it just amused me to attempt to throw them in the same place. I wonder if anybody ever came across that. Probably. Knowing how regimented you are, it probably landed within like three square feet every day. It's just funny to me to think there's like 300 banana peels like in one small area. Yeah. I like... Sometimes I put a little game with myself. I hear a phrase that I find interesting and I think, I think that would be my debut album title. And Banana in the Dark is now in the running for that. Banana in the Dark. Yeah. Huh. I like that. And you could be any... I guess you'd have... Any genre. Nah. More like ska alternative. Could be. I mean, take it as you will. You could take that many different ways, but Banana in the Dark. An adult film. So two things that that brought to mind. Not Banana in the Dark. First is that I haven't run country roads since we moved away from Lake Geneva, but you are absolutely right. But the drinks of choice out there were always some sort of wine bottle were thrown in the ditches. And the other was Fireball little shot... Those little minis that you get from a gas station. Endless. There's one road that connects from a hill I run to a trail I run. It's probably a mile long. And you could not run more than five seconds without a Fireball shot container on the side. Just a little mini. And I think it's because all winter people toss them out as they're going by. And then it melts in spring and it's just like a graveyard for Fireball. We're like overlooking the fact that people are like pounding these things and throwing them out their window. I think they're discarding evidence or something. It's just unbelievable. The amount, the frequency in which that happens. And that's just what you see. The ones that made it further into the long grass, into the ditch. It's kind of unbelievable. This has a high embankment on the side that leads up into some trees. So I think that they all accumulate at the bottom. But it also had me thinking that it's kind of like your banana situation where it might just be one person every day all winter. You know what? Somebody's going to get mad at me about this, I think. And I want that person to know that I even take the sticker off and throw it in the garbage before I leave the house. It's all biodegradable, folks. Yeah. Just got to know that. All right. So then final thing about this is I joked about leaving my trash for you, my little Celsius stick. But someone's going to take that seriously as well. But I have had it drilled into me never to litter because Lisa is such a save the earth person. When we were dating in college, this was back when CDs were still pretty much a thing. And we had one that started skipping because it was scratched. And just in the heat of passion and anger at it, I pulled it out and frisbeed it out the window into like a farm field. And I thought it was funny. She slammed on the brakes and said, go get it. I said, what? I don't know where that went. She stomped off into the field for like 15 minutes until she found it. You better have joined her. And then I just sat there like a sad puppy for the rest of the drive because I realized I had crossed a line with her. You had to feel real foolish there. Real foolish. Uh-huh. I tossed a Subway sandwich out the window once. Whole sandwich. With the wrapper? No, just the sandwich. Oh. I was really angry. Okay, we got to get to the topic. You were angry so you threw a Subway sandwich? Yes, I was so mad. Yeah. Okay. So I get angry at Subway and I don't go there often, but I get very mad when they make a sloppy sandwich. Like stuff's falling out everywhere. It's like I only get it in the car when I'm on the go. Yeah. And it was such a mess all over. I opened it up and I was just so angry at the kid who clearly didn't give a shit making it for me. And he had the attitude and I could just, he was all over. His fingers were in the mayo and then touching the outside of the bread and it was a disaster. And I was telling, I was like so mad and I opened it up and I tried to like drive with my mayo fingers and I was like, and I just took that thing and chucked it. I swore and swore and swore. And then I had to go get a second option for lunch. Wow. Yeah, it was one of my lowest moments in my life. That's disappointing though. Because you don't go there unless you're either desperate for food or you really want Subway. Yeah, it was probably the former. But anyways, there's my confession. Whole sandwich. Wow. It's okay that we're taking a meandering route into this because today is the long run episode. It's not our weekend long run episode, but it's going to get a little long it feels like, but it's about the best bang for your buck long runs. Didn't you have something you wanted to open with? I think we're past it. Are we? I guess I don't know how long. No, we're only seven and a half minutes in. I can tell you. The last time we talked on training Tuesday, I was headed out the door to do 10K paced, you know, just slightly faster than threshold paced 400s with short rest. And it was a disaster, Kirk. Oh. So I told you I was on this power line trail, slightly uphill, slightly downhill, pretty good footing, but it's grass or dirt and dirt's not that smooth. So it's just different enough that you can't, I currently can't fully tell my pace, but I feel like I'm pretty dialed in with my effort on off-road work. So I thought, and so I did an abbreviated warmup because I was running out of time. So I decided I was going to do four extra reps as my warmup and they were going to start at like 6.20, 6.10, 6 flat, 5.50. So it was going to be a warmup rep round. to build into the workout. Is that? Yeah, you're ramping up into it. Structure to your warmup and count it as part of the workout. And I've been very impressed with my Coros watch. So I have been using the Kirk Dewint approach and looking at your pace on the watch and trusting it a little bit more. But I also, this is my first quality workout in a while. I was coming off a little bit too long of a break from running at all. And so I knew it was going to cost me more than it should and that I'd be a little off. Anyway, I'm running thinking this is about 6.20. I look down and it is eight minutes. Like, oh boy. There's no way that was, you're not, you would never be that far off. I didn't think so, but I also wasn't fully warmed up. So I thought, all right, I'm going to get to the end of this rep. I'm going to do some high knees, do some butt kicks, do like half of a stride, then I'll come back down. I'm like, all right, so this definitely feels a little closer to 6.20 pace. It was like 7.30. Oh my goodness. Maybe it's the terrain, whatever. I don't know. Maybe I'm just, but my chest was starting to feel like I'm working harder than I should. So then the next one, I thought I'm going to try to run six flat. It was like 6.55. And so the rep was like 1.27 for this 400 meter. And it's like, well, I started out by jogging slowly the distance and watching my GPS. And it was pretty close to a 400. Like I stopped when it clicked over to 400 meters and this should be good. So 1.27 pace lines up with what my watch is saying. This isn't good. And so I do that next one. I'm like, I have to run under six, whatever it takes. And I ran 5.55 pace and had like actual chest discomfort. Like, well, it's humid for the first time in a while. I'm running outdoor for the first interval session in a while, but I am not recovering off 45 seconds rest. And so I forced the next one. And then I had to take a break. And I was hurting so bad at this point that I thought there has to be something wrong with my watch. So I decided to take a long break and I slow walked by start point to my finish point. And it was 0.27, not 0.24, 0.249, whatever I thought it was. But in that time, my watch beeped again. And at first it said GPS unreliable or something like that. And then it re-beeped and said GPS ready. And what I think was happening is I'm running under all these power lines and transformers. It was like kind of a hub for it. I think it was messing with the watch. I've been getting this report of foliage spoiling at GPS accuracy now that the trees are growing back in parts of the country. And I've just heard this from a couple of people, but this is an extreme case, the transformer distraction. Right. So my conversion was, then I got down to 1.22 on the last one where my chest hurt. But that was for 0.27 miles, not 0.25. So far ahead of where you thought you were. So I was running sub five by that point. And my watch was saying 5.55, which on 45 seconds of recovery, 4.55, 4.50 pace should hurt my chest. You had to know in your gut that that was inaccurate. I did, but I had been, I had had like a sinus thing going that weekend. And I just thought maybe like I am really restricted in my lungs right now because I've never had this issue with this watch. But that's why I walked. Eventually I just walked that thing and tested it. But it took me five reps before I finally just said, I don't believe that I could not be this, that I could be this far off of in tune of what this pace feels like. And then I was really embarrassed. Like I should know better. I should know that this was not even close to correct. But yeah, my watch was an entire minute off per mile. It's too bad because I've heard great things from everybody in their Coros. Everybody says, I like my new Coros more than my old Garmin. I'm a Coros person now. And I am. And I'm not blaming this on the watch. I think that I took the initial GPS. I was right under one of the big towers of wires. And I think it was just throwing it off. I never thought about that distracting from signal, but that would make sense, I guess, in some way that I don't understand. Well, I'm happy to hear that it was faster than you thought and you're not a giant POS and all is right in the world, even if it was frustrating in the moment. But as a result, I overcooked too much and I did not get as many reps as I would have liked. And then I spent all day like, you idiot. You should have, after rep one, you should have calibrated that thing. And it will be to your benefit eventually. So you can't complain too much. So anyway, today is a revisit to a similar workout. Maybe you need to go somewhere else. Yeah, okay, good. Well, now I'm just going to not even care about GPS there. I'm just going to time the reps because I know my start and end point now at exactly a quarter mile. Yeah, I don't know if I could return to that stupid place if I didn't trust my GPS. I'd be like, I have to beat it. I have my own map spot now. Take a big snippers, climb that pole, cut down a few wires, make sure you're clear. These are like the big triangular ones that come together with all the... Can you imagine on like your boy Scott Jurek or no context, like man dies, like you go up there because you're so frustrated with your watch and that's the way you go. You're just burnt to a crisp up there. Yeah, there probably are runners that would consider it. My approach would be like I'd take a firearm and I would shoot it right at the connection point to get rid of it that way. All right, should we jump in? We got only about an hour today. So at this point, we got about 45 minutes to hash out the topic of the day, shall we? Yeah, bang for your buck longer. Actually, I have one last question for you. Okay. It's a quick one. Look at me right now. Soak it in. You soaking it in? Yeah. Do you feel like I look like a coach? Right now, I could see that, yeah. In this moment. If you didn't know me, would you say I look like a coach? No. No. No? No, what's missing? A whistle? I don't know, but if I tune into this podcast knowing there's coaches, I'd say you were the coach on it. So when I wear this blue hat and our hoodie, Jess always tells me that I look like a coach. She's like, you got your coach outfit on today. She tells me how much of a coach I look like. So I was trying to embrace that today and I wanted to know if you agreed. Yeah, I can agree with that. Okay, that's a by the way. Let's get into the topic. Well, you've been living this. You're marathon training. You've been living the long run and marathon training or any ultra training, big mountain stuff is all about balancing best bang for your buck long runs and worst bang for your buck. Gotta have some that are really costly to build up your durability, but you also want to get a lot of mileage in and a lot of good work in for the least amount of damage some days so you can string together bigger mileage since the marathon requires that. So I think you're in a good place to speak to this and I have some definite feelings on what type of long runs people should and shouldn't be doing generally. Yeah, and we both work with umpteen athletes who are pursuing long events. And when I say long, it can be anything 60 minutes plus. The long run is a very, very top of the priority list. Even if you're a rough 5K-er, right? So nonetheless, we're living the long run. Every single week we propagate long run workouts and it's probably, in fact, the place in which I have to use the most creativity, even more so than a Tuesday quality session, is the long run, in particular, the quality long run. I would agree and I would say that it is the least defined run in terms of what physiologically needs to be hit because most often, not most often, but oftentimes there's not a biomarker that strictly determines the run. And when you're adding in more miles in the middle, it muddies the water on what's best practice for recovery. Like threshold reps, you know, you keep the rest short. Running VO2 max reps, you know your work to rest ratio. And long run gets very cloudy on what is best practice for any one individual person. There's way more variance that can occur in any given long run than in any given interval session. So we did a long run episode, probably a couple of them, where we literally talked about the theory, what our overarching thoughts were, the duration you should shoot for, the whens and whys and hows. We're not doing that today. We're giving you workouts, by the way, right? So let's just, because I could see my initial reaction was to like justify the long run and what we're looking to do Well, yeah, we're talking workouts today. We kept our quality session bang for your buck workouts and our trail quality sessions to purely the workouts. So we got to remind ourselves of that today. Yes. And I do think we defined what we thought long run was in the last one. But for this best bang for your buck, bang for your bung, bang for your bung, bang for your butt long runs, very best. I think that there this kind of starts blurring the line between a midweek long run and a long run once you start talking quality. Sure. For myself in my peak fitness, if I go out for a 10 mile run, that is a medium long run to slightly under. It's what? 70, 60 to 70 minutes. It's not long, but it's not short. So I would put that in the medium long run. But if I run that hard, that could be less than an hour. That's not a long run anymore. So the best bang for your buck long runs still do need to be long runs. We're not talking long workouts that aren't also long runs. Do we agree on that? 10 miles of work would be a lot, but it's not a long run. They could be one in the same, unfortunately. Right. You could take mile repeats and give yourself a quarter mile jog recovery and call it a Tuesday. Or you could do two more reps, give yourself a quarter mile jog recovery, tack a couple miles on the front end and back end compared to your Tuesday session. And suddenly it's a blown up long run. So the nuances are confusing. I agree with what you're saying, but it's the micro tweaks that would make the difference. And so with that all being said, this isn't the episode to learn about how we feel about long runs and when they start and when they are no longer useful. We're just talking best bang for your buck long runs, in our opinion, right now on April 29th, 2025. We're not trying to teach you theory. We're talking about what we think is really, really good to do on certain long runs to get better at running, erasing. You reminded me to switch my wood calendar. I had the eight showing. It's April 29th today. I got this as a gift and I feel obligated to change it every day now. Do you want me to kick it off? Please do. Well, I'm going to start with the least exciting and sexy one here. And the reason is because this will be a staple. And I bet you if I had to ask you to predict it, I just want you to predict it. What do you think I'm going to say? It's the least sexy. I think it's probably one of the most effective and it should be a staple in your long run program. Oh, I don't know. You do. When I say, you'd be like, oh, duh. Well, as soon as you said least sexy, then I can't choose 3-2 or 15-12-10-5, whatever version of that you do. That's fair. Progression long run. Progression. There you go. Yeah. And this is one where if you are waffling over what to do for your long run, or you're not sure how you're going to feel going into it, maybe it's been a big training week, or you just don't want to. It's a way to trick yourself into a good amount of work and running harder and faster as you have more time on legs, which is very purposeful for any longer race. And so I turn on the lap setting on my watch. I don't look at the current pace setting. I turn on the lap setting, meaning I can see my projected mile for that mile, right? All watches have that face, I believe, or display. And I get going. I start at recovery effort pacing. And this could be your long run might be eight miles, six miles. It could be 22 miles. It doesn't even matter. And all you do is gradually tighten the screws and tighten the screws. And if you're feeling good and feeling yourself, you end roughly somewhere around marathon pace if you're feeling it. And what happens in that progression long run is the first few miles, you just get your wheels under you. You start to tick down maybe five seconds a mile or so. And let's say it's a long run of 18 to 20 miles. By the time that thing is done and you continue to progress, you've spent how many minutes in threshold? How many sub-threshold? And maybe even breaching it at the end for the sake of VO2 max. And heaven forbid you progress too fast and trap yourself. Then you rein back and finish out your long run at recovery pacing or whatever it is. And there's no wrong way to do it. And you end up, if you look at the heart rate graph and you look at your zones and you talk about time on feet, it's a great bang for your buck workout. And you can pull the plug at any time based on how much you're feeling it and how well the progression goes. And so you look at your heart rate graph or you look at your pace graph and it makes this nice pretty little graph. And it's a wonderful, wonderful thing. So the progression long run, I think if I could only have one, it would still have to be that one. Yeah. Yeah. For me, it's that or it's just an actual second blank fast. Second half, last third, last quarter fast. It's one of those two. And you explained that one well, so I'm just going to choose the other one. I talked about it on a previous one for mountain work, but go out 10 easy, come back six fast. Do a trail loop. I talked about it on the one I did after the AT&T Stadium race one year. The next morning I went out and did a nine mile loop easy and then a nine mile loop moderate. Running faster on the back half of a long run, I think is like double benefits. When you add in the pace to what you're working at, you get those chemical changes in your body. That's great. But when you do it on a fatigued body and your legs are tired and you have to actively engage yourself mentally and physically to keep your stride appropriate and you're already 40, 60 minutes into a run, that's like the golden hour of running where you're getting double benefit. It's not just physiological. It's not just structural. It's not just chemical. It's all of them married into one. And I believe that that is maybe the single biggest bang for your buck long run is maybe a little shorter than a real long run, but the last however percent of the run done fast. And fast can mean anything faster than easy pace. You could prescribe it. You cut down to it. I'm just going to one point and then I'm starting to run faster after that. But I think that is just like the best thing the average person can do on a long run. Yeah. And I think for those who get really caught up in the data, especially heart rate, like I need to spend, I need to get here. I shouldn't go here. I need to be easier or harder to get this benefit. Like it's one of those things where like, I don't even look at my heart rate. Like just let it be what it will be. Don't get too caught up in it, at least for me anyways. Like I make note, but I don't let it dictate how hard or fast I'm running because I already know the majority of my session has been done within myself. And I'm not cooking too hot too early. And so I can't really, you can't really overdo that session in a sense where like it's not going to be one of those that takes you weeks to like get yourself back to center from because the majority of the work was done like sub threshold, we'll call it. Yeah. And it's a self-limiting workout. In the example I said, let's say I'm going 10 easy, six quicker. You start the six quicker when you've already done 10. And if you put a cap on it, like I'm not exceeding an eight out of 10 effort, then like what are you going to be able to do to really damage yourself? You're so tired at that point that you're not going to try to run 5K pace. But if it's available to you that day, then great, you take it, but you're probably not going to. And this leads me to my key point to this that I believe strongly in and will have some people that believe the opposite. But I think unless you have a specific reason that you need this extra part here, I believe that most people would benefit from the long run ends when the fast session ends. I don't believe you need to get to the end and then tack on an extra two or three at easy pace. I believe that the cost of that greatly outweighs the benefit for like 95% of people. Now, if you are an ultra runner, if you are a marathon runner, if you have a race coming up that demands you be able to just hang on and keep running a decent okay stride or slow stride once you've been very depleted, then those workouts will need to be in there. But for most people, that's just extra stress at a bad stride that you generally allow your stride to just kind of crumble and you don't care and you're just slogging your way through it, which is not bang for your buck. It's the opposite of bang for your buck. So If I do a cut down and I start to overcook, I back off a little bit and then I'm done. But I'm not backing back down easy. No, just to hit miles, I'm doing three or four more. I actually don't believe that most people need or even should do that if we're talking best bang for your buck. Yeah, the only, at least this is the trap I found myself in, is you pick a route and you're still like three miles from home and you realize like, okay, like it's not always perfect. We're not just going back and forth in front of like our driveway for these things. So it's like sometimes if you miscalculate, like you're kind of stuck with that low grade time on feet afterwards, like I have been. It's like, shoot, I trapped myself. Now I got two and a half miles to get home. I guess that's where I'm at. You know what I mean? Yeah. I had a day where I got to 13 when we were back out in Lake Geneva. I'd done a similar style workout where I was doing hill reps, but I was running them aerobic for the first like eight-ish miles. And then I was going to do two more reps hard. And the reps were three K reps. So I got done. I'm at like 12, 13-ish miles and I just stopped and I walked the last mile and a half home. It was such a long foolish walk, but I thought I'm not holding my stride together anymore. I'm just calling it. And I'm not saying everyone should do that. But had I run that, I think the recovery cost, and it was a hot day. I think the recovery cost would have been much higher than what you'd expect a mile and a half to be. So I don't recommend everyone pull the plug and walk home. But it's very common to see something like 10 miles easy, five at marathon pace, five easy. I think most people should just go like 12 easy, run your five at marathon pace and call it. It's a lot of less mileage, but you're actually kicking the beehive more than you know by saying that. Because if you look at what we're being fed right now and what a lot of the pros are doing, especially like the marathon stuff, the ultra stuff gets thrown at us. We don't see as much. I mean, there's all track access and some flow track stuff out there that outlines like the 5K and 1500 guys. But like as like a gen pop, we're seeing David Roche go out and hit his runs and then run a bunch of mileage steady after the work is done. He's training for ultras. You see Mance and Clayton Young go out and do their five mile tempo 15 miles into their long run and then finish out with easy mileage. They're training for a marathon on the roads. And so you're arguing a different point saying like most of us listening aren't running marathons. Most of us listening are doing something sub marathon. So where's the return on investment, right? But I'm just saying this, you're actually saying contradicts what a lot of people are getting fed on their social channels right now. Right. If you're trying to maximize an ultra, a hundred miler, a 50K, even a marathon, you need this in your training. But that's the damaging point. That's just layers in more damage, which you need to build resilience to. But to what cost is it going to set you back for the next week's training? You're arguing all of those points, the availability argument, right? So I'm just like just saying like people probably are hearing you say that and be like, that's not what I'm seeing. Yeah. And you're correct. You're not seeing that. But the other thing is that if you are training to run your best 100 miler or marathon and you're to the point where you need this, you're also probably pretty good at the act of running. And that matters when you're already 16 miles in and now you're tacking on an easy run. Your form is still waiting for you. You're going to self-regulate pretty well. The average person, once they finish their faster portion, their stride's done. They are just getting through for the sake of getting through, at which point I'd rather have you incline hike or jump on the bike or jump on the rower because if you want that extended time of cardiovascularly, get it. But I don't want someone who's moderately good at running running less than moderately good. I don't want someone who's good at running running poorly. Early on in your career or until you've mastered running, you're most susceptible to issues when you're most fatigued. And that's not a revelation to say, but if you can barely run, you're going to run poorly. And at the end of a hard workout, you can barely run. So I don't want people using a slow cadence, sloppy stride, hips are sagging inside to side. You're not controlling your foot action very well. You're practicing bad reps. You've already got a long run in. There's nothing magical about these last 20 minutes. Let it go. I think when you get to the point where you can tell your ground contact time is just forever, like your foot hits the ground and there's no spring left, you are literally dragging your butt through the finish. Anytime you feel like you're just slogging and you don't have any bit of like pop off the ground anymore and it's just your foot hits the ground, it's just like slow-mo plop, plop, plop. You can hear your shoes slapping the ground, right? You're super like you're just taking a lot of mechanical inefficient damage at that point. So I think there's a testament to what you're saying there. Do you remember when we talked with the gentleman from Alethea Run? We had several people on and like some of the tech team. Anyway, one of the reasons I'm excited personally with this product is I think it could revolutionize the long run because once they get the point where they can pair that device with a watch screen that shows you your biometrics in the moment or your biomechanical metrics in the moment, you're going to have it like a heart rate where you can set a zone and once you vary more than let's say like 5% on your left-right split or your cadence or your ground contact time, it's going to beep at you and you're going to know I'm getting sloppy. And that type of thing will be really useful for the long run, for marathoners, for ultra runners where I'm tacking on my extra until I can't run well anymore and now you don't have to guess if you're running well anymore. And since we don't have that and since most people can't self-identify, I think you just avoid the extended cool down, so to speak. It's funny because I'm like plugging that type of thing into my plan right now. But I feel like I can run well still fatigued at this point. But okay, so moving on from that then. So we talked about the progression long run or the finish hard long run with a set like, hey, I'm going to run easy for 10 and then finish six miles at goal marathon pace or something and call it good. That's basically what we're outlining, right? I'm going to say one that I don't think you would predict that I would say. Okay. But every time I do this session, and I think this is a great session for a 5K or a marathoner or an ultra marathoner, I think it covers the gamut. And that's why I love this session. And it's so simple and I've done it probably dozens of times over my career. But the quarter mile on, quarter mile off or float long run. Okay. It's very simple. It is a quarter mile at let's say a hard, you could be as subjective as that, and a quarter mile easier float as subjective as that. Meaning in its simplest form, you run hard for a quarter mile, let it be what it be. You run roughly recovery pacing or effort for a quarter mile and you go back and forth as many times as your heart desires. You advance that session further. The way I typically do it is you run some sort of prescribed or goal pacing for the on and you run some sort of float or off prescribed pacing for the off or a float. And it's a weave over under workout, just like most of these float style sessions are. For example, for this one, I may end up running my quarters on around 10K pace and then my quarters off somewhere slower than marathon pace, like notably slower, like, you know, probably a minute or more per mile slower than what I just ran my hard effort on. So let's say I go back and forth between 5.10 and 6.10, 5.10 and 6.10 or something, which is a huge session, by the way, that would be on the top end. And the other end might be I might run 4.55 and seven minute pace back and forth, depending on how important it is to rip and what I'm trying to get out of the session. Do I want to weave in and out of threshold the whole time or do I want to spike the heart rate and then drop it, spike the heart rate and drop it? And the point being, if you're getting ready for a 5K or 10K, you could go rip the quarter and then back off a quarter. If you're going to get ready for a marathon, you may hit that quarter hard and then just back off for the quarter easy, easy in quotes. And so there's actually a lot of nuance within it. But what I find is one, the session goes by super quick because you're constantly on and off. Suddenly you're like, oh my God, I covered 10 miles and it felt like a blink of an eye. But it's very flexible. As simple as quarter mile on off is, you can treat it very differently. I've done this session where I've only had  That session is beautiful. To me, it's a perfect session. It's engaging. It can cover a gamut of races and it generally goes by quickly. So those are the reasons I like that session. Well, without talking to each other, we picked the same type of thing again for this round. Mine's a little more vague and on the slower end, but anything over under or in and out, I think makes for a great long run. My go-to in the off season is two on, two off minutes or five on, five off. That is my, just my, I don't know what to do. I'm just doing that for this long run. And when I really don't know what to do, then I just do a song run. One song faster, one song slower. And I lean on the slower end for the long run. You're talking ripping 400s. I'm talking cruising for two to five minutes and then easy for two to five. So my spread between mine is closer. It's tighter. If an easy run for me is seven minute pace, this might be 6.30, 7.30. It might be as fast as like 6.10, eight minutes. Like that's a bigger spread, but it's more just over under, in and out, back and forth, all by feel. I like to do it all by feel. And I think it teaches you pacing really well. It teaches you the cost of pacing and missing by a little bit because early on you're like, this is fast, but sustainable. And then after 20 minutes, you're thinking, I need to reassess what I thought was fast and sustainable. But it also, like you said, it makes the long run fly by. Suddenly you're at 10 miles, 12 miles, 14 miles, and then the work starts. But just like the cut down or the progression run, it makes sure that when you get fatigued, you're still running with purpose. Because like I said, most people's stride breaks down when they get tired. I think it's important to be trying to run a certain effort or pace when you get tired, if you want bang for your buck. So as the workout goes on, even if you're settling back to an easy stride, you're not doing it for super long and you're anticipating a hard session coming up on the next interval. And so you kind of try to run well and not take damage at that pace. And then when you run harder, you generally run cleaner anyway. So I like these type of things that as the workout goes on, it forces you to run well and then it stops before you don't run well. And I think the in and out over under is perfect for that sort of stride practice. Yeah, I think the over under is probably like the best way to describe it as a whole. You're running slower than intended race pace, whatever's coming up or easier than intended race pace and then faster than intended race pace, generally speaking. You're just over under, over under controlling your effort and pacing and going faster, slower, faster, slower. I like to compare it to my intended race pace I have coming up like for whatever I'm or effort if you're on the trails. But over under, gosh, you could take that and make it so many different things. But we had to distill it down to a specific workout. So if you have to distill it down, give me the one. I'm saying quarter mile on, quarter mile off. You got to give me one. Then I'm going to go, I'm just going to say five, five on, five off, five minutes on, five minutes off, because that equates decently well to songs. And I'm actually setting my line at aerobic threshold. Faster than aerobic threshold, slower than aerobic threshold. And I'm either riding the line just like a few breaths on either side, or it can be 30 seconds either way. But that's the line I generally do it at so that I can get more volume in and not have it be so brutal. I like it. It's funny. I was considering using the mile on, mile float long run. For most people, it's going to be much longer than five minutes, but like that sort of covers that same, you could say seven, seven or whatever it is. But like, I'm not going to, I wasn't going to use it, but yours would be pretty close to covering something like that for somebody. Yep. Yeah. And I've talked about this, but I set up playlists for this. You're like Coldplay, Rick Ross, Jack Johnson, Eminem, like back and forth between something I want to float to and something I want to rip to. Enya, Rick Astley. There you go. Dido, Journey. All right. I like that one. Anything else you want to elaborate on the over under style? No, no, I think that's a good solid one. And like you said, it just makes the time clip by. All right. This is the last one I really want to make sure I say. Okay. I can just start spewing off like a long run I did this last weekend might be my new favorite long run. I have to experiment with it more. However, I'm not going to, maybe I'll hint it after this, but the three by anything long run. Yes. Okay. Do you know where I'm going to probably go with this? Well, because you're copying my blueprint here. If I could restart this episode when you said, should I kick it off? I would have said, no, I'd like to go first. But now I just sound like a hoser here. Just copying whatever you're doing. Well, I guess we align. We've butted heads on one or two things in the recent months. So this is good. Be back in sync, cuddling on the couch with my co-host. We've never done that, I don't think. We've been on the same couch. That's true. My legs may have touched. They may have. Three by anything. What do I mean by that? Think if you're out running or driving, like what do I mean three by anything? What does that mean? This is another flexible session. I am going to use, let's say two examples, but it could be anything your heart desires based on your goal race or distance. The session that comes to mind would be like three by three miles or three by 20 minutes or three by 15 minutes or three by two miles or whatever it is. But it is infused in your long run in general to get in touch with your upcoming race pace and spending time at it, right? Roughly. And so classic marathon example would be, it could even be three by four miles, three by three miles. But the point is we're basically getting to pace. We're sitting in it. It may be three miles on a mile off by three. Okay. That's a big session. That's 12 total miles within. Tack on a warm up and cool down and suddenly you're at 16 plus for the day. And it's a beautiful, beautiful session. It guarantees that you're spending probably a good amount of time within threshold. You're also feeling out upcoming race pace and it's a wonderfully productive session. If you're training for a five or 10K, it may be three by a mile within your long run. Or it could be three by four miles if you're a tenured marathoner, right? The point is get to race pace roughly, feel it out, allow yourself reprieve, do it again. Allow yourself reprieve, do it again. So I'm going to say three by three miles or three by 20 minutes or three by 15 minutes depending on who you are with roughly a third recovery. And it just draws out the duration and it helps you get familiar with what your body feels like and what it should feel like on race day, especially the last interval or two on that. Three by anything. Beautiful. I agree with it. And I think the three is important. You can do two by 15, but I think I'd rather do three by 10 and build up to three by 15. I don't want to go two by 15 and then two by 15 and one by five, two by 15, one by 10. I like having that third rep in there because the third rep teaches you everything you need to know. Now you can learn it in two by anyway, but it's just kind of a big chunk to ask. And I cap mine at three by 20 for most people. I don't see much of a reason. I'll call it three by 5K if your 5K is not going to be 20 minutes or faster. But generally it's time for most people who aren't marathoners. But yeah, three by two mile, three by 3K, three by 10 minutes, two weeks later, three by 12, three by 14. Sometimes I go 10, 15, 20. Sometimes it's three by nine, three by 15, three by 18, whatever it's going to be. But yeah, three by something with 90 seconds to three minutes in between is generally what I do if I'm running anywhere near threshold for this work. So you could keep the recovery shorter in between. Relatively, but if you're going to run it a little bit, like if you're going to float your recovery, then take a full mile. Great. That's exactly where I was going to go with this. Just like the over under the quarter mile on off long run. Like if you were training for a half marathon distance or duration or longer, exactly what Bracken said, I may run my miles at marathon pace, let's just say, or my three miles at marathon pace, maybe even a titch quicker to be honest, if I'm really looking burn it on this one. But then I may run my mile recovery only backing off 45 seconds a mile where I'm never really fully recovering and hitting the next rep compromise. Correct. Then I wouldn't jog an entire mile in between three mile reps, for example, I would make sure that if I'm going to jog it, I'd give myself a half mile at most. But otherwise, I would prefer a float recovery on that style if it's going to be the three to one ratio that I'm talking about. Yeah, for me, it really comes down to how much volume do I want from the session? Great. Oftentimes, I'll just say two minute walk rest. Let's get this thing done. And if that might be for a three by 20 minute session. But if we want to hit 20 miles on the day, it's going to be a mile float in between. If you're walking at any point, I mean, there's a purpose for many people to walk during a long run. So I'm not saying that's not the point. But if you're walking, does it count as a long run if you have quality in it? Or does that just turn itself into like a Tuesday quality now? Like, does it get blurry if you're walking during a long run? For sure. Yeah. Okay. I'm just going to think that out. Like, what does that count as then? Although, if you take a look at the average population, they're walking during their two hour long run. So yeah. Well, I just think like I stand rest, walk rest all the time on a Tuesday quality and I have no problems with that. That's what my purpose is for the day. But if I were to do that in a long run by design, well, now it's not a long run in my eyes only because I have this weird association with walking. Walking is totally cool on a quality session in a vacuum. Of course, it's prescribed all the time. But then if I walk during my long run, I don't know why that would bother me. Well, it's like me two weeks ago with my EMOM issues. I can't start intervals on the blank. I know you can. I know it's fine. It just makes my skin crawl. I don't want to do that. Yeah. Okay. Well, so you're outlining, we're outlining similar type sessions there. So if you had to pick one, I'm going to go just to concrete. I'm going to say three by three miles with one mile float recovery, maybe roughly 45 seconds to a minute slower on that recovery than your hard, whatever effort that is. And then you can tack on a warm up and cool down or whatever duration you need to achieve your mileage for the day. What would be your session? Three by 15 or three by 20 minutes. I think three by 15 probably because it is probably better for more people. But I mean, I do that with hills. I do it with treadmill. The triple challenge is three by the treadmill challenge, which is 15 minutes at 15% incline. That's still this workout. I like that. I mean, I probably most often do three by 10 to 12, but the best for a long run is probably 15 to 20 minutes, I believe. So if you're taking 5k, I'm taking 15 to 20 minutes. So we're doing the same thing depending on how fast you are. Yeah. If you're a 30 minute 5k or something, then I would time translate. Yep. For sure. If you're a 20 minute or faster, I probably would distance it. Yep. Just for perspective. All right. The only problem with your workout, Kirk, is that it really makes it hard to have clean GPS results. Your miles aren't going to line up because you're going to be a 10th of a mile over every time your 5k ends. And then your recovery mile is going to include a 10th of a mile. I said three by three miles. I didn't say three by 5k. Oh, you did. Okay. Then I stand corrected. You are damn right. You're corrected. I heard what I wanted to hear. You did. Which is typically the way I live. So do you have another one that comes? I've been sort of shooting my shot first. Do you have another one that comes to mind? Well, I believe we do just have to talk about the standard easy long run. Yeah. Time on feet. And I have beliefs on this. And that is that for the, again, assuming you don't have a race specific purpose, if you're going to dawdle, it should be on trails. I don't like the idea of the average runner going out and running two hours on pavement without any purpose. What's the average runner? What do you envision? Just out of curiosity. 20 to 30 minute 5k runner. Okay. I don't, let's just say for men, 20 minutes or slower. And for women, 22, 30 or 23 minutes or slower. Okay. So just an average runner or slower. I don't love the idea of dawdling on pavement. It's unforgiving. Easy long runs. If that is your 5k pace is going to be slow enough that there's a chance you're not running really great and you have long ground contact time. So unless you have a marathon on the roads or you have a purpose where you need to be doing that thing, my philosophy is if you're going slow, do it on the trail. Reduce the impact. Work on getting your feet up off the ground because there's things you don't want to trip on. Just make it easier on your body entirely. And it's probably going to be more enjoyable and it's probably more sustainable. I do the same thing with tacking on easy work at the, like I said at the beginning, I'm taking the easy three miles off the end of my cut down. But if they're going to be there, try to hop over onto the trail for it. It's not realistic for everyone, but that's my belief. If I'm running with purpose or pace, hit the road, sure. If you're doing it to get the time on feet, go find a trail. Prioritize enjoyment and sort of aerobic output versus structural damage is kind of what I'm hearing. Yes. For the gen pop. Yeah, I agree with that. I think the concrete has structural damage written all over it, whether you go hard and run a quality long run or slow and run an easy long run. Your legs may still feel the same that next Tuesday regardless. Yeah. Right? Whereas if you want to stay available and maybe enjoy yourself hitting some sort of softer undulating terrain, I think would be beneficial. I agree with that, especially as far as staying available for the following week. Yeah. Okay. And I do want to squeeze one last one in here. We kind of talked about it for the trail ultra mountain conversation we had last week, but I think off-road only, one of the best bang for your buck workouts, but still being sustainable is the long run where it's no uphill or no downhill left behind. Two hours on the trail, but every uphill I'm going to work with purpose or three hours on the trail, but every downhill I'm going to work with purpose. I'm going to run it intentionally. Everything else is really easy. So you get the skill component done. You get some engine work done. You get some impact done, but you don't take the full damage of what a quality long run would be, even though it can very quickly become a quality long run. You just have so much time spent not doing the quality section, but you also get to really feel without consequences what happens if you over or underwork any given climb or descent. You go back to running easy and think, wow, this is way easier than I thought, or this is not nearly as easy as I thought now that we're an hour in. You get to find out little things about pacing without blowing up a workout. Do you apply that session to the roads ever? Never. Always trails. I have never. I'm not saying never do that, but no, I've never prescribed that for the road because the only people I would worry about hills for on the road are people with races coming up and we're going to be ripping intervals on that terrain anyway. Yeah. I just prescribed my first no uphill left behind road run. Really? I wrote it yesterday. I've never done it before. Somebody who has access to that in the mountains, but I'm just curious how it plays out, but that's always been trail dominant until just this week. So I didn't know. I normally don't prescribe concrete session like that either, but yeah. I'm going to describe one last one. It's top of mind because I did it this weekend and it felt as or more productive than any session I've ever done. I mean that like not just because it's new and top of mind, but I love what it did for me. You could look at this. I'll just describe the session I did and then you could apply how to like make it your own. But this weekend I went for 18 miles and it was a, I labeled it a six, six, six long run. It was a six mile ramp up, six mile tempo, six mile ramp down. But the key here is Bracken and I are both fans of the split tempo quality session or the broken tempo where it's intervals, tempo, intervals, or it's tempo, intervals, tempo, like on the track even. It could be quarter mile repeats, mile repeats, quarter mile, or it could be anything like that where you're sort of making a sandwich session. Just drawing it out for the long run. And my goodness, did it feel productive and I'm going to be experimenting more with this style. But really what the point is, is to turn over, open things up, sit in it in the middle portion, and then after some duress, force yourself to open up again in the ramp down. So the session I did this weekend was the first quarter mile of every new mile I ran hard. Starting when? Right away after the mile one ticked, which is pretty early. In hindsight, I could have pushed it back a mile. I could have started after I had two miles in me, and I should have. But anyways, I'm running close to 5K pace for these things. I'm running pretty hard. So I did five by a quarter mile in the ramp up, running the first quarter mile of every new mile hard. That opened up the stride. It felt clunky at first, but it forced me to open up, turn over, get mechanically efficient. And then by the time the six mile tempo in the middle came, that felt very comfortable compared to the quarter miles that I had ripped. And so I did five by a quarter. Again, every new mile I started running hard and then kind of ran steady for the remaining three quarters. Went and do a six mile tempo. And then on the ramp down, I did the exact same thing. Forced myself to run that first quarter of every new mile hard again. And that's where the money was made. The back half of that tempo and then forcing myself to run 5K pace again on legs that did a lot of work already. It was a very damaging session, by the way. That last quarter or two, I was toast. I could feel it. When you finished your six mile tempo and it clicked a new mile. No, I ran an entire mile. Yes. Great question. That would have been brutal. I took that first full mile off. Yeah, I didn't kick home in a quarter. And what I'm getting at with this session is, so it was five by a quarter, six mile tempo, five by a quarter. So in total, that was eight and a half miles worth of quality within a long run. And I never just ran slow and easy for a long time, right? Like you talk about not just plodding along. I was forcing efficient running, well fatigued on the back end. It helped open up my stride in the beginning, open pathways for work, got the bulk of the work done in the six mile tempo, then forced me to turn over on tired legs. You could do any combination of this, but it felt so productive. You could do minute surges in your ramp up for three or four miles, run it, but the tempo portion stays the same. For time or duration in the middle, that must happen. And then shorter intervals on each end of it. I don't care if you're training for a 5K and this is a 10 mile long run with abbreviated versions of it all, or for my case, the marathon, but the quick spice tempo, spice to finish out, it just felt so productive, especially the way it finished. I did not want to run hard after that six mile tempo and I forced myself to maintain composure and I think it was astronomically productive. So I really enjoyed this long run. I've never done it. I've done the quality sessions, you know, in a vacuum on the track or something on a Tuesday. It was awesome. So I'm going to put a plug for that type in here as well. Where did you get this workout? I made it up. I've never heard of this. Me neither. I feel it's rare. If I hear of a workout that I've never heard of before, like in any way, shape or form, it's usually dumb. Like some wild combination of things, but this is a logical, slightly complicated, but not bad. It's not when you're executing. It's very simple. Just like describing it. Yeah. It takes a bit to wrap your mind around what's actually happening. And then once you get it, it's not anymore, but it's very novel to me, but I like it. Yeah, I don't know. I just thought it sounded good in the sense where I wanted to turn over, get some fatigue in my legs, run a tempo slightly fatigued. And I thought the intervals to start would help open things up and make the tempo feel more available. And it did when I went into tempo pacing, which was starting at roughly half marathon. I was running roughly marathon pace to start. It felt so easy because I had run much quicker in the tempo, in the intervals leading up. So it just made sense in my brain. So I'm going to be playing around with more of that. I like it. And I like that the back end, you're dosing the speed just long enough for it to be actually taxing, but short enough that it's not unapproachable. And then you have to just get it back together for 1200 and run increasingly fatigued well. Yeah, that's exactly it. And I may extrapolate this out. We'll see. But I'm starting to think in my head, like I could see myself doing two by a mile, five mile tempo, two by a mile or like a two mile, mile off, six mile, mile off, two mile, where like the two miles are very difficult, faster than half pace, going into marathon pace in the middle. Like I may really like draw these out, but all I know is that I know what I felt and I felt very productive in that. So that's my current revelation. I like it. And this kind of highlights something that we haven't really discussed a lot. We've talked about the concept of this, but not what it means. But I think one of the truest signs of good fitness is when you have the confidence to consider adding something hard before the productive part of your workout you want to focus on, thinking this might make it feel like better. Yeah, I think that's also age. Yeah, I don't know. By my senior year of college, I'd run a hard 300 meters before an 800 or a mile. I'd do it like 10 minutes prior. Hard enough that I'm gasping at the end and I have a bit of lactate in my legs. Before a race. Before a race, like 10 minutes out, I would do a 250 to 300 meter interval. Yeah. Knowing that I get that first sting of lactate out, I get that first hamstring tightness and burning and that heavy feeling done. Everything's been primed. I'm not going to produce quite as much the second time I go to do this, but my fitness is so good that that's not going to affect me for my race. And you're at that point now where you can do something like 5x400 at 5K pace to loosen up my tempo. And it does, it works. It primes you for it. It makes you more efficient. But if you're not in shape, that doesn't loosen up your tempo, it just tires you out. So it's a really cool spot that you're in right now where you can start playing around with how do I pre-fatigue myself as a performance enhancing rather than just pre-fatigue. Yeah, and just in that ramp up for anybody who ends up experimenting with this, like those quarters didn't feel good, right? They're rarely jarring to the system. But it opened me up for, I think, a more comfortable pacing. It's not like these quarters magically feel good. You just described your 250 or 300 feeling like, oh, I'm burning. This is work. It's hard. It's uncomfortable. They don't come to you easily. The point isn't like just go jog these quarter miles hard. It's like I'm actually working and I'm pressing the comfortable envelope. It didn't feel good, but what it did was open the door and the pathways for what was coming later. That's the point, exactly your point before your races. And so if someone wasn't in as good shape as you, maybe it's 200 meters. Yeah. Whatever that distance is to do what you're trying to get out of it, but not then get to the tempo portion and be like, well, I already shot my shot. Yeah, now I have to do a mile less because I can't anymore. Yeah. The intro, the buy-in always feels disconcerting, but when you're in shape, by the time you go to work again, you're fine. When you're not in shape, you're not fine. That's fair. Yeah, the buy-in is always, I feel like, disconcerting a little bit no matter what. Yeah. All right, we're kind of at time here. I didn't mean to cannibalize the last, or monopolize the last, cannibalize, monopolize the last bit of this episode, but are we good? Yeah. Kirk, this is the only part of our life we're in 100% control of. What? This podcast. That's fair. On Training Tuesday, as much as we love a lot of other people in our life, they have no say over what happens here. We are free to do whatever we want. And if we can't exercise that right, then why have it? That's a good point. We have a giveaway to give away. We're not going to be giving it away today. We're going to give it away either in our Friday episode or next Tuesday, by the way. We have to chat through. I have some emails that we need to compare notes. Honestly, I made a grave mistake because I opened it up for people to make their argument as to why they deserve the free plan, and there are many, many, many deserving people, and now I'm going to feel like a huge dick when we only give it to a select few because, shoot, man. So I got to think on this. That's why I'm putting it off. Yeah. And if I got this many messages, I can only assume how many you got. Yeah, shoot"
}