{
  "guid": "78f2f18d-e460-370e-9884-59d1e2c05ad1",
  "title": "Episode 521: Rich Ryan",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. Whether you are a brand new runner or you already have a great mustache, we're here to help you increase your running knowledge and present it at a practical level. This is The Running Public. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. So I'm the only one without any control over this environment. Yeah. Just with what you say. The only control of your words, BK and I are operating everything else. I logged in today and he removed me from the session immediately, just as a power play. The same joke to Kirk too. Yeah, you moved me all around and got rid of me. It's not cool, guys. When's the last time that you guys recorded a podcast together? I don't know. It's been some time. We did a random race brain. We just stopped doing race brain for like a month. Then we came back and we're like, all right, let's just kind of have that and just talk about what we're going to do. And they're like, yeah, we might do race brain from moving forward. And we just haven't. That was probably three months ago? It was February, I remember. Yeah, it was creeping on it. Oh. I saw him yesterday, but not for a podcast. We speak frequently, but we don't record them as often. So I've pried Bracken a few times during episodes. Now I've asked you a couple of times, haven't I, Bracken? Or was this off record when I've asked you about like, what's going on with race brain? One time on air you asked me and I gave like a really fuzzy answer. Is it going to keep it that way? No, we got him here, grill him. Well, the floor is yours. I know nothing. Kirk, you're still in the logo. With a man bun, which was like four years ago. That was COVID. Is that coming back? No. That was it? Have you ever grown out your hair, Rich? And Bracken, I know the answer to that. I wish. Yeah, I grew my hair out. Back in high school, it would go out big, kind of fro style. But no, I'm not growing the hair out now is not what anybody wants. But you're still in the logo. I actually went on the YouTube today and saw you on there. We're all on there. And I was like, all right, we got to get rid of this. So we're on the last stages of the old race brain. So now race brain as a podcast, how it started, right? We were wanting to touch on the sport of OCR mostly, right? So most of the conversations that we're having were based around what was happening within the inner workings of the sport, how the national series was going, what the matchups are going to be, what the narrative and everything was, what everything means. Just kind of giving more context for the fandom of the sport. OCR as a sport doesn't exist the way that it once had. So my fandom in particular definitely started to dwindle. And just like the conversations started to shift a little bit more into High Rocks Hybrid. And then we saw that there was this opportunity to really double down on the High Rocks side of things. But how race brain existed where most of our audience were OCR fans. And we weren't talking about OCR enough really to feel like we were serving them. We weren't talking about High Rocks enough to feel like we were able to grow and serve that audience. So we were kind of in this weird gray spot that we needed to then either pivot or just find something else to do that would be a little bit more productive. So we chose the latter. Race brain exists now. And actually we just launched something that was cool yesterday. So race brain is going to exist more like as a media platform now where there's going to be multiple verticals of content that is mostly going to cover hybrid with the option to do still OCR. But we have a High Rocks show. We have a YouTube show that kind of gives the news. We just launched our website yesterday to give like blog articles. We do like newsletter and just like do some reviews. A lot like just being a lot more broad as opposed to being just like one podcast about OCR. So there's YouTube stuff out there right now. YouTube stuff's out there. All right. That makes sense. One of our final episodes prior to it, Rich, Jack, and I talked. And we all kind of agreed that A, we were forcing it. We were trying to do drafts and half the people had never made a podium in their life. Three quarters of the people had never made a podium. Not that they are unimportant. They do now. It's not compelling like conversation when we don't know anything about them. And we also were just getting so overwhelmingly negative. It was starting to become like a bad mood thing where we would just complain. It used to be we would complain, offer suggestions, and balance it out with like love of the sport. And now our love of the sport was coming out sideways. And it was getting negative and we didn't like it. And we were dedicating time each week to being negative. And that was kind of like for me, that was my selling point. I'm obviously less in the high rocks world than like Rich is entrenched in it. Jack and I are less so. But it was an opportunity to be excited about a sport rather than be depressed by it. Yeah. There has to be a positive, alive passion for what you are going to show up and talk about every week or twice a week in our case. If it's not a positive and it's not a passion and it's slowly dying, a.k.a. OCR. Rich, when's the last OCR you ran? Exactly. Yeah, it's tough to string it out. And pretty soon when the listeners can feel it, it's probably time. I think they tolerate negativity when it is a small percentage that's balanced out and kind of justified by all the other things you do well or positive. And we had less and less and less of that to even balance it out. And we just kind of felt we just got on and complained to the wall every week. Yeah, there's a point where and I think where we kind of justified it a lot is like, okay, we're being critical to provide like a different lens to look this through to try to help improve things. And then we realized that we were being critical because we were just unhappy and dissatisfied with it. And it's like, why do we need to be, we don't need to share this. We don't need to record this and broadcast this out. So there's still space for what we were doing in terms of like what we started as like a brand and like a voice that I still believe in. But just like how we're going to deliver that and making it a little bit more, like much more broad and a little bit more systematic in terms of like an actual media entity is kind of now where the pivot's gone. Like we talked about being like, oh, maybe we'll just do like a roundtable show, make it a little bit more like YouTube centric. But we all wanted to do things that we were like passionate with instead of like trying to just like hang on to something because we had done it for so long. Like what is it? The sunk cost fallacy, right? We had like sunk time fallacy on that where it's just like, this is, we did this and it's over. There's nothing that the past can really give us now. So we have to figure out where to go now. I would like to think I just had a year foresight on you guys, but that's not the case whatsoever. I'm out of here. No, there was no writing on the wall. But the ironic thing about what you both are saying is that Bracken, Rich, Jack, all inherently positive, glass half full, super pleasant, level-headed people. And it's funny that even something that you see that you love and have a passion for and are unhappy with then can feel like it's displayed. I don't know, the other side of your potential personality. I don't look at you that way at all. None of you guys. That's just interesting to me. That's so nice of you. Thank you. Well, it's true. Well, there's truth to the fact that like nothing can withdraw true hatred like love. You know, like if you feel something so strongly, the opposite side comes out when that gets betrayed. And that's how we all felt. Like we felt betrayed, but we can save him. We can fix him. And eventually we just realized they don't want to be saved. It's part of growing up. Can't save everybody. Can't save everyone. Well, Rich, you're our guest on this podcast today. And people might be confused who listen to the circle of this and RMR and such. They're like, what feed is this on? Maybe it's on both. But I told Bracken last week, I said, I want to chat with Rich. Did I not, Bracken? Was it last week? I'm hazy on time, but you did say that. And then he put it together. I've been wanting to chat with you in like an actual podcast, non-BS style for like a while now since you've had successes, ups and downs, and we haven't chatted with you since when? It's been some time. I've been on the show a bunch. Am I still a record holder? It's been like six. If you're six, you've got it. If you're four, you've got it. Hunter's had four. It's been so many episodes. I think I still have it. But it's been years. Great to be back. It has been some time for sure. Maybe it was the coaching series. There was one after that for sure when you and I did a threshold conversation when Kirk was in Vietnam, I think. That's it. Oh, and we did one on cross-training stuff too. Yes, we did. Which was fun. Yeah, yeah. So Kirk, it's been a long time. BK and I have chopped it up. But Kirk, since I've been on with you, it's probably been a couple years, probably since I've been in Colorado, honestly, three, four years. Where are you at right now? Are you at your house? I'm at my house. I live right outside of Denver, a town called Arvada. That's a new background. Well, yeah. Do you have track spikes hanging? Is that your shoulder right, track spikes? I know those are not your favorite track spikes, but those are the best ones in my opinion. Are those the milers? Miler. I hated that spike. That's my spike, man. Do you remember that? You remember that I hated the milers? Yeah, because it's like a personality flaw that I had to note and remember. I hated the milers. About me? Yeah, both of you not liking the milers. Well, I mean, I think it was the first pair, like real tech spike that I had before that. I was just running in whatever. I think you're part responsible for half of High Rocks running in the worst shoe ever invented, which is the Mizuno Wave Rebellion Pro. It is the worst shoe that's ever been designed, and now you got all these idiots out there running in them as well. You didn't like the Rebellion Pro? Didn't like doesn't even begin to describe it. Look at that. That's of them. Those shoes above Bracken's shoulder, I bought for $300, and I was going to burn them, but he said, no, send them to me. So I sent them to him as a gift. Some things can still be saved. The threes. I've not tried the threes yet, but I'm guessing they're pretty. BK told me they're not that much different than the two. I mean, our run stride, Kirk, you and I, is pretty different. And I've heard from BK enlightening me on this that even he feels like he's a little bit further back in the Mizuno. Kent feels the same way. You and Kent have a bit of a more similar stride, and he doesn't really like the Rebellion Pros either. But for me, greatest shoe ever designed. I am as far back of a stride in terms of foot plant as you can get away with and love this shoe. Yeah, and I would not describe you as someone who's back on your foot. I'm fairly mid. I was a heel striker bad in high school. Bow-legged and heel striking, and I've worked on it over time, but I'm firmly midfoot. Yeah, and I'm more mid to forefoot. You prance. Yeah. Hurt stabs. I stab. Little knife jabs to the earth with my forefoot. So you have the milers back there, and you have looks like some Nike. What is the shoe in the middle there? BK, you got this? We got Alpha 1s, and we got RC Elite 1s, and then Endorphin Pro 3s. It's my wall of fame. That's the GOAT wall there. But what I was commenting on is he had skull wallpaper, and now to my eyes, this is like a muted lavender. Yeah, I would say lavender is fair. I would just go purple not to make people feel alienated. When? This has been like this since we've done podcasts, Bracken, like many. I haven't had the whole wallpaper for like a year. I just look at my own shoes when we talk. That's why you like the wide camera. I haven't made eye contact with a guest since I put this wall up. Those Adidas Prime X Strong are looking fly today. I was trying to intro this thing, and then somehow we just went left out of the gates. I think it was my fault. I was asking you where you were at, and then I saw your shoes. So you're in Colorado. I want to, with you today, Rich, I want to start at like 30,000 feet and then zoom way the frick in like under a microscope, but I want to start like way back. Is this classic TRP? No, no, no, no, no. No, not in time way back necessarily, but like, you know, I could start with a simple question. Rich, at your OCR pursuits versus now, how much more muscle do you have on your body? How much more muscle? In terms of body weight, I am probably not that different, but percentage of body fat, I'm probably like 2% less in body fat than what I was in OCR. So whatever that, I don't have like an exact number of pounds of musculature, but I wouldn't say it's like a lot. I wouldn't say it's like remarkably more. Strictly running, how many miles per week were you running five years ago? And I know mile, it's subjective. We're not talking machine work. How many miles per week were you running five or six years ago versus today? So five years ago, we're thick into COVID, right? So that was all I had. I remember in the summer of that year, I was doing 100-mile weeks. And before that, I was doing OCR, preparing for like these longer events. I was 70, 80s pretty consistently. You're talking recently or talking about? Before, like pre-COVID when there still was OCR. Like I was still running a decent volume. Now I'm like touching 40, maybe. Okay. And if you were to line up against yourself in a half marathon five years ago or tomorrow, what would be the spread? I was pretty fit after those 100-mile weeks. I can't lie. Well, that's fine. That's great. I can't lie. But you ran like 51 and change, right, for a 10-miler then? Or was that like 52, 17? Yeah, it was 51 low, but like the first, I don't know. It was all GPS. It was a McGinnis special. It was a McGinnis special. The first three miles were like down, so it was feeling like nothing was happening. But yeah, I ran under five minutes for six miles. I was like 455s for six miles at my absolute peak top fitness. So whatever that, BK, what's that equate to then? Like a 31 flat. What does that equate to a half marathon? This is your specialty. I mean, I'm going to call it 67. 67? Yeah, that would be a stretch. I think that that has potential just when the distance gets long. Let's find out what Jack Daniel says. You guys keep chatting. I'm going to work out. Do you want me to? No, keep going. You're the guest. Thank you. So a workout that I just did recently, again, the variables are not the same, right? So it's hard for me to say. I'm at altitude now, and I do a lot of my running on an assault treadmill. But I did 2x5K at what I would consider my threshold pace with two minutes rest in between, and I ran like 16.10 and 16.14. So I'm probably not as fast as I was at peak, but that worked. What does that equate to then? Like a 31 flat. What does that equate to a half marathon? This is your specialty. I mean, I'm going to call it 67. 67? Yeah, that would be a stretch. I think that that has potential just when the distance gets long. Let's find out what Jack Daniel says. You guys keep chatting. I'm going to work out. Do you want me to? No, keep going. You're the guest. Thank you. So a workout that I just did recently, again, the variables are not the same, right? So it's hard for me to say. I'm at altitude now, and I do a lot of my running on an assault treadmill. But I did 2x5K at what I would consider my threshold pace with two minutes rest in between, and I ran like 16.10 and 16.14. So I'm probably not as fast as I was at peak, but that worked. What does that equate to then? Like a 31 flat. What does that equate to a half marathon? This is your specialty. I mean, I'm going to call it 67. 67? Yeah, that would be a stretch. I think that that has potential just when the distance gets long. Let's find out what Jack Daniel says. You guys keep chatting. I'm going to work out. Do you want me to? No, keep going. You're the guest. Thank you. So a workout that I just did recently, again, the variables are not the same, right? So it's hard for me to say. I'm at altitude now, and I do a lot of my running on an assault treadmill. But I did 2x5K at what I would consider my threshold pace with two minutes rest in between, and I ran like 16.10 and 16 OCR does, where it's like every single step is like taxing. You have to look around and see. That type of skill I've never really developed fully, and I like it. I don't love it to the point where I wanted it to excel. So mostly I'm not that good on the trails, if you can boil it down. It's interesting because I've always looked at you as an athletic runner in terms of runners. Going back to high school, you ran what, 4.11 in the mile? 4.14. 4.14 in the mile. That is nationally fast at that time. Nationally then, yeah. 4.14, got scholarship offers to go run a mile at universities. That's nationally fast. What year was that? 2004? 2004, 4.14 is very fast. 4.14 is fast, but in high school, 4.14 in 2004 was very fast. And you were also a good athlete. Played hoops. I locked you up. And I always found it interesting that you and I, our skills manifest completely opposite. We're both milers. You were better than I was. We were both athletes, but yours comes out in ability to put out work in a ton of different modalities. And mine comes out in retaining a high percentage of anything in anywhere. So like mud, dirt, scree, swamp. I can keep a high percentage, but I just can't put out in a vacuum. And I've always felt like you lost a high percentage, but get in a vacuum and you can just put out no matter what implement is near you or anything. And I've always found it, because you were with Leaderboard and you gave us your profile and your stats and your testing and stuff. And I looked at it and thought like, this is a player comp and we perform exact opposite in every single type of competition. That's interesting. Yeah. I guess when you put it like that, like how the skills do kind of show up differently on the course. Yeah, I agree. And I think this is what Kirk's talking about. So why does that translate well to Hyrox? Why are you a vacuum power output guy? Not in a vacuum because everything's compromised in Hyrox. But why is it like straight line power versus... I think I have an answer for that. Yeah? For him. I think there is a very certain... And I think it's the way... I think I err more towards Rich's side than you as well, Bracken, with just the output in a vacuum. And I think there's a sector of endurance athletes, and a lot of them have a background on the track and the roads and controlled environments in which just riding the line underneath it is like a very special and happy and sustainable place. But you start just crossing it on occasion and there's a type of athlete who can handle those hits well and keep on it. And I don't know if I'm necessarily one of those. And I don't know if you can determine what type of athlete you would be. But I know pegging it and holding it works. And tipping and trying to go back to it, suddenly I've lost 10%. And I think there is a special sector. We lose to... I mean, you have a guy that wins a national series race that runs 16 teens in the 5K and then he goes and kicks your ass in an hour and a half race on terrain and you go, this is infuriating. Rich, you ran sub 15 and we're getting beat by 16 and change guys. And I was faster than the guys winning in a vacuum. So I just think there has to be some sort of metabolic something that I don't understand that has to do with riding a line or being able to breach and come back. Bracken, breach and come back all day, for example. I wonder if that has... I'm terrible at riding a line. Yeah, like I guess... So like in terms of like if you're looking at it physiologically, like in that respect, like if you spike, right, BK, like say you're spiking, we'll talk about lactate here, right? If your lactate levels rise, do you think it's like tolerance that you have more than like ability to flush? Like where Kirk and I, we sit there and just flush out over and over? Or do you think it's like the opposite? Like you can flush very quickly or as opposed... And maybe we are mechanically and aerobically fit enough that we're not like... We can go fast enough without like producing that type of byproduct. I've always thought I was bad at tolerance of lactate, but I thought I didn't produce it disproportionately in any other form of locomotion. Like I wasn't a great cyclist, but I could cycle as well as I could run. And I'm not a great rower, but I can row like a 15, 45K runner without... Like my fitness translates to other things. I'm not a... I don't run a lot of technical trails or descents because we don't have that around here a ton, but I can do that as well as I can flat run or maybe a little better. But if I have to do it for an hour straight, I can't hold that line. I think I'm just good at pivoting from thing to thing and it doesn't spike when I pivot. Where other people, I think they are super efficient at handling it in a movement and then another movement, they're not as efficient at. I think across the board, I'm moderately okay at it. But in a sport that shifts you from thing to thing a lot, it looks better. So do you think it could be more of a literal mechanical efficiency thing in certain planes of movements and when that is other movement is required, it's as simple as that? Or is it actually lactate or whatever we want to talk about that's flowing through our blood? I wonder. It's just an interesting thing because you'd think it would translate, but why is an Olympic swimmer a 21K, 5K runner? 21-minute 5K runner, which exists, by the way. I'm sure. Like Rich, what are you better at your entire life? Were you better at long runs and tempos or interval sets? Interval sets. I'm mid-distance, baby. Okay, and that was me. Like my interval sets, I could interval set without overextending against people significantly better than me at running. But I would run my threshold runs or long runs and get stomped by people that I was way better than at mid-distance. Like I can't hold a steady effort. Well, we would think that would be aerobic fitness or some sort of mechanical breakdown in terms of like just fatigue. Well, I think that's the key. I believe the strongest aerobic capacity people do great at higher rocks. I think engine matters more than being able to spike it. I think that that might – I think speed, this is now a shift that I have made this season because I was there too. It's like who can do the most? Like where's the volume? Like what's the capacity to handle all of these different elements and being able to spread it across all these modalities so that like you can build this massive floor, raise the floor like crazy. But now like this event where it's like dipping into like low 50s, right? It's like we're kind of shifting faster and faster. So I think the speed now and the efficiency, the movement piece I think is really important and one that is like going to be a separator because now we're at that point where everyone's kind of as fit as each other, right? But now it's like where can we see the margins in terms of explosive power and just like movement quality and who can run well, who can run well without taking – like without it costing them. And yet if you look at the marathon, that's the same story now, right? Like the three top finishers at London this past weekend for the women where the marathon world record fell had 800-meter PRs of in order first, second, third, 159, 156, 2 flat or 201. Like these are now – it's the same thing. It is an aerobic capacity event until everyone's maxed that out and then it returns back down to who can spike the best, who is the most efficient fast. But I think the precursor is the capacity. Well, now is this training methodology or is it tech, right? Because that was the rub on some mid-distance before, right? It's like you put on those Adidas Strong Prime 2 Johns and you're not taking any of the damage that someone who might be a little bit more mechanically resilient or have the bigger capacity to like take on this bigger event. You can just kind of like do it now. That's true. All right. I have a list of questions I'm going to hold myself back. Start doing them. No. No, I want to go out of order and it's going to mess me up. Let's go. I don't have anything written down. This is all just in my head. So we don't do that here. Are you a writer-downer? Big time writer-downer. That was always our thing. That was always a race brain thing. I'd be prepped, ready to roll, 90 minutes of prep. No, not 90 minutes. Sometimes. I haven't written down anything in years. BK shows up. He's like, wait, we got race brain in two minutes? comes on just fires off takes. Mouthful of pizza. Red lightning. Yeah. I tell myself to make myself feel better. That's what years of obsessive reading does. Yeah. Just like you have them ready. You think and process quickly. Have you ever taken an IQ test? No. Kirk? Yep. I've never taken one. I don't think anyone was curious about what my IQ was. We all want to know. No. Do you remember what your score was? Very high. I'm not surprised. No. They actually, when I was super sick back in the day, I went through this litany of tests at the Mayo Clinic. And this is like in my mold exposure days. And they took me and I actually had an administered by a psychiatrist. And it was like a three hour IQ test. And I guess what I finished in the 99.9 percentile. And they give you a number and they give you a letter and you have to say them in numerical and alphabetical order. So they may say 3Z and then you repeat 3Z. Then they may say 3 1 BZ and you have to be like 1 3 BZ. And then they continue to add all the way until you. 1 BZ. Oh, like Simon? Correct. And then it might be like 1 9 3 BZ X. And then you got to be like, and you have a timer on it when you have to recall. And I broke the test. What? Yeah. I got all the way to the finish line. You're nice at Simon like that. It was like 12 letters and numbers or something. It was like 24 or something. And they're like, you're done. You're like all up high. You can just keep going. No, I don't know that. But I was impressed with myself at the time. But anyways, it was high. It was high. What's up? But let's move on. So what I'm trying to do is help people. There's this huge shift towards people either coming from just pure running, a strength background, an OCR background that are like, you can't get away from high rocks now. The sport has done it. And you've been a part of that upbringing, right? Because you've committed early and you're part of the crew that people got invested in following and successes and failures have been along for the ride. And I think you have a lot of buy-in and emotional investment from people who follow, like they want to see you win. You're like one of the people's champs, right? There's a host of you. And I say you would be in that group. And so, yeah, well, you've earned it, right? And so what I'm getting at is there's a bunch of people that are trying to figure this out. And you know that. You have podcasts about it, right? On our mark. I think there's a whole sector of our listeners that don't listen to you guys. We'll cross over. Right. And so helping to understand the progression, for example, of where you started, the learnings along the way, and what it sort of took for you to, no matter what the background, what it took for you to zero in on how to get better at this sport, right? You have a lot of life and training lessons over the last year. Your first Hyrox was four years ago? 21. So yes. Four years ago? Yeah. See, I don't need anything written down. You got it, dude. IQ. Whatever you get is like AF. Four years ago. It's really complicated. So take me back to year one learnings from, let's call it a primary endurance background. I know you learned things in OCR. That's a slap in the face if you just come from. And I know you have a CrossFit background too. Like you did time in the gym. So you had the components-ish, right? What were the early learnings when you tried Hyrox, gave your first real crack at it? Yeah, that's an awesome question. So up front, we all kind of looked at this and Bracken was certainly on an early adopter. And I think we all had a similar mindset of like, we've been doing this. We're going to crush this, right? We thought this was something that because we had the ability to do mixed modality training, could do some running, could take on some damage, could keep going. We looked at this like, okay, we could just, we can make this happen. So it started definitely with like arrogance up front of like, okay, I don't need to change anything. And you assumed like a boss that everybody simmed just so fast. Everybody simmed, breaking the record. BK, what was your sim time? Like 54? I think I was like 56 and change. My first one was like 57.30. Then I went 56 low and I was like, it's not if the world record gets broken, it's how many of us break it. Are you using water jugs for my farmer's carry? I was using rubber bands hanging from my basketball hoop because I didn't have a ski erg. And I was just saying 345 sounds right, 355. So funny. Like you said, arrogance. There's no other word for it. I love it. Other than ignorance. Yes. So I didn't get into that first event. I just was, we were still, I was very OCR at the time. It just like didn't work out the schedule. And then COVID did happen. But going into that first event, I remember my main concern was really like the understanding of the demands of what these stations were going to feel like, because I did get to see the arrogant squad, like the carnage that came from the people that I feel as my peer group in terms of fitness. I saw what happened. So I was like, okay, something's going on here. And this is not going to be as easy as we potentially thought when we first saw the event. So I was very concerned about how to do the skill of everything. Like Bracken was saying, like, I don't think I had been on a ski erg much, if at all, before preparing for this. It's like trying to figure that out, trying to understand what the sleds are going to feel like, and just really trying to patch all the pieces together was the first real piece of this. I just wanted to know if I could do all of the movements in this type of time domain. So I remember that being like a major focal point up front. Can I stop you real quick? Of course. First, I want to ask Bracken. So you simmed in 54 minutes or 56. What was your first high rocks then, just for comparison to know how different it was? 117. So 20 minutes, let's call it. Okay, so the sim was an inaccurate test. There's the classic photo. Do you have that one still? Bracken's eyes. He saw God out there laying on the ground. Oh, I remember that photo. That was right when TRP started, right? Was it? Yeah, I think so. What was your first? Is that I was doing reps of one for wall balls at the end. And Faye Stenning was just like, hey, it's okay. Just try to finish. It's okay. I've never heard someone talk to a racer like a wounded animal. Like you're just talking it, knowing it's going to die in a few seconds. You're just making it happy for this last few seconds of life. Like no intensity of whatever she was going to tell you is going to help you do more than one wall ball at a time. So she just gave you the ultimate pity clap. Yeah, she's like, I see there's nothing behind those eyes anymore. That's the look. 20 minutes different, sim to race. Okay. And you learn about rock zone and you learn the sleds are not nearly what you've been practicing at home because they're way worse and yada yada. Okay, we don't need to go down that rabbit hole. But when you say you needed to work the skill component, right? Like learn the skill component. Was your first approach like I am going to learn this in a vacuum or was it David Megida, I'm going to sim every week approach? Yeah, I'm not an incredible believer in sims or benchmarks for training. It's just not something that I like to do. I don't like to prescribe it very often. I feel like I can get caught up in the weight of an outcome in a workout and kind of get pulled out of just like the task of completing the effort, right? So I've never been a big simulation type person or benchmark type person. So I was kind of cutting the pieces together, kind of doing and because I do have a CrossFit background, I was kind of organizing things probably a little bit more on what you would get like traditional Metcon style. Like I would do some bigger pieces, but I wasn't not enough in hindsight to string together a large chunk of time at like anaerobic threshold, let's say. But I was doing like the skills. I'd be like three rounds of 250 meter to 500 meter ski, some sled push and some burpees or something like that, right? And then I was also running the way that we know of running training, right? So it'd be like, here's my interval threshold workout. Here are my like high rock skill workouts. And that was kind of how I was organizing it up front. Okay. And what did you learn through that process that how it translated to performance in your first handful of races? Volume of intensity that I was building was not nearly enough to sustain throughout an entire high rocks. The volume of intensity, including the skill components of the actual race demands. Your Metcons may have lasted 20 minutes when they needed to last 60 or something, for example. Exactly. And that's where the race would fall apart on me halfway through. In that first year in particular, I'd get to like burpee broad jumps and it would just be survival mode. Old school OCR survival mode. I was like, I've been here before. I'm here again. So that is where things really kind of ran short. Turns out I could do the sleds okay. It took a lot out of me, but I could still do them. I was worried about not even being able to accomplish them. And like the ski, I'm sure I was bleeding from efficiency standpoint, but I was just running out of gas. I just like didn't have enough to put out for the entire duration of the race. And what was your debut pro time? 67 something. 67 mid. Was that 25 meter or 12 and a half meter carpets? 12 and a half. That shifted during COVID because they did that championship on the assault treadmills. That was like a real confined area. So I never had that 25 meter sled pull. That just seemed. Do you know I've still never done an individual on the 12 and a half? I don't think I knew that, but I don't think I would have like had that in your bio. You got to get out there. Yeah. So can you just. 67. That's a respectable debut. Which was okay. Yeah. I was okay. And like it was enough to qualify. They didn't really have qualifiers like they have now. It was like, okay, like you're good enough to be in this like heat for the North American championships or whatever they were calling it. Talk about the feeling during the race. You get to BBJs and you talk about this old school, like here we're at OCR days where I'm just hanging on now. Like, can you just so people, I think a lot of people are hard on themselves in the hybrid space. And I mean, I have never raced a high rocks yet. Half of my roster is racing them. Right. I think I understand from a third party perspective very well, but from a first person, I'm gathering data, right. Just by asking questions. Right. And so a lot of people are hard on themselves because when the piano lands on their back, it is awful. Right. And it's so easy to be so hard on yourself, but it is the growing pains of the process of the sport. And so for somebody like you to describe that feeling, I think would be helpful for people. What are we talking about? Yeah. So thinking about fatigue, where it's going to come from, right. Kind of the conversation we're having earlier, like there's like an aerobic fatigue. Potentially there's like a lactic takeover where you just like are forced to kind of slow down. Maybe there's like there's a heat component where you just feel so hot. You can't keep it moving. And then there's like this muscular endurance component that it where it's like I just cannot keep going. Like I if I wanted to go faster, muscularly, it will not allow it. So it's much more on that end and maybe probably combined with maybe a little bit of like that heat fatigue of just overwhelmed, like kind of cloud over top of you. But for me, it was a lot more muscular. It really did feel like early OCR like beast type days where I'd be at a point and I'm like, I just hope I finish. I'm not sure if I can keep going. And there was definitely some like muscular cramping, which was an issue early, especially in the last third of the race. So it definitely got to the point of muscular fatigue where there was not like the firing of the muscles just wasn't operating the way that it should. The Lindsay Webster Big Bear spear throw type feeling. Yes. You're right, though, about that OCR beast feeling. High Rocks has an ability to one station does to what like a double sandbag would have done back in the day where you're partway through realizing I can't work any better. I can only work worse. And then you finally get done with it and nothing's left available to do all the other things. And you learn almost nothing that day other than this one thing was such a punch to the face that I never recovered. In High Rocks where I find it to be a little bit different and maybe I just never matured as an athlete. Yeah, for sure. And maybe I just never matured as an athlete enough to string together a race that I truly thought I could in OCR. But in hybrid, it's like self-inflicted. It's like pacing issues, right? Like you just go too hard for what you're capable of doing for a variety of reasons. Where OCR, you're right. It's like, okay, you're doing a double bog diamond with these double sandbags today. It's like, well, never done this before. Yeah, I don't know if I can do this. Like they did it to you. Where here it's mostly self-inflicted. Like you know what's coming and you just kind of screwed up the pacing of it. That makes sense. Like I literally, I had this experience. I've had this experience many times, but I described when I went hypothermic one year in Seattle. In fact, I think you beat me in Seattle that year. I was going to, but I missed the rig. I got some burpee penalty. We were trying to get over the hardest obstacle. Irish table. Did you land flat on your back there? Yeah, I almost broke my neck. It was like a four foot ledge. We jumped up. Feet swung under. Flat on my back. I was trying to describe that day because I was having a good season prior to that. I couldn't get my legs to move or go any faster. Suddenly there was nothing available to me. I couldn't get my body to do what I wanted it to. And for those who haven't experienced like OCR or High Rocks, it was like that feeling of like, it doesn't matter what I want my body to do. I can't literally get my legs to go any faster. I can't move any faster if I wanted to. There could be a gun to my head. It's done. That button's been pushed. Is that like the feeling you're describing? On that day, I think at the vertical cargo with the platform, you looked at me with that dead in your eyes look like, I'm rocked. Did I say that to you? Yeah. I was like, you are for sure. Yikes. That sounds about right. By the way, I made that Lindsay Webster spear throw joke. This was in Big Bear, I think 2018 or 19. But do you know that that was your coming out party? People didn't know who Rich Ryan was. And then Matt B. Davis wanted to interview you. I think that was your first podcast appearance because I wanted to talk to the guy who Lindsay Webster took the spear from. Remember that? I do remember. That was your first appearance. That was pretty embarrassing. Of all ways to be asked to be on a podcast, it's not like I would lead with that option. I was trying my ass off in the freaking series traveling. I was living in Philadelphia, traveled to California for this race, got my doors kicked in. And Matt Davis is like, so Lindsay stole your spear. Do you hate her? I'm like, what, dude? Come on. Yes, but I'm going to say no. Yeah, I'm going to play it nice. What are we talking about? Seattle? No, I was just talking about the mechanical thing. Like when it's over, it's over and you can't will your – like you almost can't access your fitness anymore, I guess is the way I would put it. For sure, for sure. I think that a lot of athletes experience that early. I'd speak for myself on that end. But like the totality of this race was the – that the race was breaking people down much more. And now I think there's just like a lot more information available. So many people have done this race now that we can kind of understand how to get as prepared for it as we need to on that first go and that it is really serious and it will take you down if you're not incredibly prepared for it. So I don't think people experience it as much now unless they're just underprepared. Now throughout this time, you've been at kind of the forefront of thinking about how to train for a hybrid sport. And you have that background of a 4.14 high school miler, a D1 college runner. Like you have running chops. You understand the physiological cost nature, how to just go along about becoming a good endurance athlete. And then you had your CrossFit days of figuring out and learning that from a strength and a metabolic conditioning standpoint. And you got to this and you did OCR training plus CrossFit. And then you started a hybrid approach to it. And correct me if I'm wrong, but how I remember the progression going was I need to get Metcons in. And then it turned into I need to get just more nasty work in to be able to handle what the first half of the race does to me. And then it was I need more volume. I just need more volume. And those two may have been switched. And then it was I need to just accumulate as much threshold time as possible. And then you kind of backed off on some things. And throughout this time, you had been like not boom or bust, but as you would talk, you'd always say like I have a good race and I have a bad race. And you've now strung together races. So you were going along the road of figuring out what works for this sport, So what were those steps? Early on it was muscular fatigue. It was muscular endurance. It was muscular breakdown. What was next? So yes, to address that. So after that race happened in 67 in Orlando, or back when I was down racing as well, and then 68 in that next race in Chicago. So I just had like a little bit of like, I didn't, I had poor grip. I just didn't race as well. I just made some mistakes, whatever. So from the six months from that 68 to the next race, I dropped to like a 60 low. I think it was like 60.10 or something like that. So I took like seven minutes off of this time by addressing the duration. Like I was like, okay, I need to set myself in this spot and kind of do like longer tempo efforts moving in and out of station work. So accumulating a lot more volume in the station work and accumulating a lot more volume just with output. So I would do one of those a week and then I would do, I was actually doing incline running at the time because I had, I was nursing an injury after that first season. Yeah, what was that injury? I remember that, but I'm forgetting what it was. It was like hip, like knee issues. Then I had something in my like sacrum, I think that actually that put me down for a minute. So I was doing a lot more incline running to bring it back. So I started doing incline intervals. And as I was doing these incline intervals, I was doing them longer than I would typically do on flat because just like the work rate is just like a little slower. So I was just like building more and more volume. So I think I got up to like four by 10 minutes of incline running, which at threshold, in hindsight, I was doing longer threshold intervals where I thought I was just kind of like doing longer hill repeats. So the combination of those two pieces worked really well to sure up my ability to work well in the beginning without overdoing it and finishing strong. I actually, and then I had a, the times kind of reflect on how to do the race. And strategically, I was able to kind of share some things up as well. It's like, okay, I need to take it easy here. I need to take it easy here. And to make sure that I get through it, I can still put out a little bit more. So it's a lot more conservative upfront. And that took a ton of time off of my finishing high rocks with combination of that. So after that, that works well, right? But then Bracken, as you said, I think shortly after there, we really started to get in on this like threshold, double threshold movements and like looking at it from what's happening broadly in endurance. It's like, okay, cool. Like let's try to accumulate as much work at anaerobic threshold, at day threshold as possible. And that should translate well because that's kind of what these race demands are. So the thoughts with double threshold, so I started doing double threshold, right? Where it'd be like Tuesday and Friday, there'd be two different quality sessions, both at like that threshold area. One would be like run specific and one would be kind of mixed modality. And this, I don't felt like worked that well for me for a couple reasons. There, one, I think it's just too much for me. I mean, I'm 39. I'm older in the athletic cycle. And I think just having back-to-back quality sessions just like wrecked the rest of my week and hurt both quality sessions, right? Like I don't think I was ever really getting to where I needed to go. So I think overtraining really became a thing. And also for me, I need to accumulate time in anaerobic threshold, not in terms of frequency, but in terms of density. I need to have a big chunk of time where I'm just like sitting in it. And that's how I respond best. Where if it's like, if I can get like whatever, 100 minutes over the course of the week in four sessions, but like doing three or four minutes at a time, it's way less effective than if I was doing 30 or 40 minutes at a time, maybe getting 80 minutes throughout the course of the week. Can I pause you really quick? Sorry. Just to make sure that everybody's observing what you're saying. And again, this is Rich's stories. It may not be your story, athlete listening right now. So the first big jump from like 67 to 60 flat, in hindsight, you were spending more time at output because you were stuck on the uphill treadmill. And so looking back, you were spending a little bit more time putting out, we will call it. And then you expanded just the overall, let's say time demands of your Metcon type high rock sessions, right? So both of those things maybe, and then some acumen on course as well, but it all combined, right? And then from there, you talk about- I want to pause you actually and just make one quick point. Those long tempo sessions that he talked about going in and out of running and stations, I believe build race acumen really well. Because you get 20, 30, 40 minutes in and you get sluggish or a little dull and you start figuring out how do I get more efficient on transitions? Or I can't over grip this for 40 minutes. And I think that replaces some of that sim work or race work people did. Real quick, boys, I got a workout later. I'm going to take in some bicarb while we're talking. Oh, let's know. I want to see what's going on here. If you don't mind. I feel like I'm watching David Roach. Who's unpaused? Is it me or is it Kirk? Oh, no, I want to, is this just a goop? Kirk paused you. I double stamped his pause myself and now he's back to unpaused while you're still paused. I'm still paused. Okay. So that looks like hand sanitizer with little bubbles in it. Have you not tried this? No. I don't cheat. Doesn't like the Rebellion Pro? I will cheat. I'm just not fit enough to bother yet. Once I get closer to race specific work, then it's time. This is important. It's 1.30 our time, 12.30 your time. What time is your session? What time are you hoping to be training at? Like 2, 2.30? Okay. So I'm just wondering your time to... Hour and a half is pretty solid. Yeah. For the bicarb or for the conversation? Bicarb. Yes. Both actually. Conversation is limitless. All right, Kirk, unpause. I just want to talk about... Because I've watched Rich have some clerical errors on course in Orlando. Everybody does. Yeah. I had gloves to wear for the pole and I was like, man, I was warming up with Bracken and Megida and I was like, I had these receiver gloves and we all know BK. He has his own line of them. I was like, should I wear these things? He was like, no downside. And then I get to farmer's carry. My hands are so sweaty. I can't even, I can't pick it up for one second. I take the gloves off. My hands are pouring sweat. I just, I had like a four and a half minute farmer's carry. So some downside, potential downside. If you're a hand sweater, I didn't know about this about... I didn't have all the information. I didn't have all the information. Anyway, the long tempos force you to get efficient at things because you're just tired. So unshun, continue, Kirk. How many times have I been unpaused? It's been the same, but you just haven't started up. So I just keep talking. Well, I'm just being patient. Unpause. All right. Then we fast forward to double threshold days, which I had athletes ask about it and I've applied it in some sense to the hybrid space. Almost exactly as you're outlining would be my logic would tell me how to do it. So pretty much what you outlined, a pure run session, either prioritized in the morning or secondary in the evening and vice versa, depending on the athlete and what they wanted to, I felt they needed. Point being, I felt like you had this phase of disappointing races where it was like, didn't happen again, didn't happen again, didn't come together again. But like there were glimmers and glimpses of it, but it hadn't come together yet, like the way it has at times recently. Was that during that phase that I was probably underwater a bit because of my workload and couldn't access it on race day? Was that all in that same time period, the double threshold and underperforming? For sure. I did. So after that first season of High Rocks, we had the first successful season. Like I made world championships that year. I ran like 60 flat. Coming out of that, there was then Decafit, right? We thought Decafit was going to be a viable option for as like a competitor for High Rocks. TBD. That's true. They did sell out this past week, two weekends ago over in SoCal. Anyway, but it did some, this is really where I started to apply the double threshold and saw some success there for Decafit. And then so I was just like, I'm just going to double down on this. I'm just going to keep this going. And then I had a two-year stretch there, maybe a year and a half stretch in High Rocks where I was like really pressing. I was really like stressing out about like trying to make this work and like sticking to what had worked in Decafit and trying to apply this to High Rocks. as well. And yeah, I think I was just overtrained for 18 months. And I was putting out performances that I wasn't feeling confident going to the start. I wasn't really looking forward to training. I was sleeping poorly. I was just like overly stressed about how I was progressing. And yeah, I just didn't have good results, right? And I wasn't sure. I was like, am I just like washed? Is this it? Or so when I looked at it, I was like, I need to do everything differently. I need to like take a step back and really examine if what I'm doing is working for me, where I look back to two and a half, three seasons ago to when I did have that big jump in success. And I was like, I didn't need to stop doing that. Like I just went away from that because I thought I was like exploring, seeing if there was a better way. So I went through this cycle of figuring out what was working for me. And then like upon reflection, I was like, okay, I was onto something. So let's go back to that and try to refine that a little bit. And not to blame you, this was a period of time in your life where you were saying like, hey, I may be going all in on the coaching and the identity and the career, right? Like this is like something that is like you're passionate about. And so there's extra pressure there. Just from like, I'm potentially going to tie this in with my career, right? And so I could see like more is more philosophy. Bracken, how many times have I said to you in the last month, I want to do an episode on overtraining syndrome and higher rocks. How many times have I said, let's do that on training Tuesday? We haven't yet. Not many. But I'm starting, like we got to do it because I'm getting a lot of test subjects and our athletes are also like we experiment with ourselves, but sometimes it's a little bit of feedback from athletes and you start to hear this overtraining syndrome or like underperformance or your dicks in the dirt constantly and you're just not, you don't even realize how compromised you are till you get out of it and can look back and be like, oh, this is what feeling good is like again. Or this is what sinking my teeth and having choices in a workout or a race is like again. And you don't even, when you're in it, you're too close to it. And so point being is that's been top of mind for a few people I've been working with and then others that I've had conversations with this overtraining syndrome, like more is not always more. And so maybe that's what you're outlining slightly. 100%. Like there's, because we can do so much, right? In running, running, whatever, or a specific running event, like you get a lot more physical cues for overtraining and like you will be broken down physically often or as often as you would be like systemically, right? So like you'll get an injury or you'll just feel awful. There's just like things that are like more black and white, but we're like doing threshold sessions on the skier and the rower and the echo bike and it's not impact and we're feeling okay. It's easy to get, for me, it was really easy to get lost in it. So when I came, so after this like disappointing couple of years, I was like, there's gotta be a smarter way to do this. I started like thinking about how someone would train for like a try, like the most like nerdy type people out there, right? Like how would they be smarter about doing this? And like I always just kind of came back to like what I could do in his heart rate, right? It's like using heart rate as much more of a key metric and making the workouts heart rate based as opposed to more like intuitive high rocks based. Okay, I'm gonna do this workout. It's gonna feel like high rocks. It's like I'm actually gonna follow my heart rate and see where I can sit while doing as much high rocks stuff as I can. This was really illuminating when it comes to the overtraining syndrome is that my max heart rate was reduced quite a bit when in the throes of training. So like I thought I was getting good training in, but my heart rate was like 10 beats lower than what anaerobic threshold would be. And it just couldn't rise. It couldn't go to where it needs to go. So when I started looking at it, I was like, oh, okay, like if I rest this day or take it easy this day, my heart rate responds really well. And I can get to that intended stimulus that I'm looking for. I wanna pause you again when you're done with this thought. BK, you wanna pause? Kurt? Well, I have athletes often that say, just because I don't wanna lose this thought is talking about the heart rate ability to get high and you have athletes who go for a warmup on race day or they hit a quality session and my heart rate was so high and I'm worried about that and what does this mean? I couldn't get it to come down. That's also another conversation. But I say, well, dude, it's better than the alternative, which is like, if you can't get that thing to go anywhere or you just notice like I used to see this and now I can't get it there, that's when I get concerned. The ability to get, when I hit a quality session and I nail it, I see the highest heart rate metrics I've had in weeks and it's because I was available, not because I was like out of shape or lost fitness. It has to do with availability. So I just like that you touched on the fact that you could actually get your heart rate higher and to hold it higher when you were available versus overworked. I think a lot of people don't understand that. It seems counterintuitive, right? Like I'm doing the same amount of work at a lower heart rate, I'm crushing. Correct. But then you hit a taper into a race and all of a sudden your heart rate does respond and you're all of a sudden at an intensity that you haven't touched for like two or three weeks and then it's too much. And so that was happening to me repeatedly. I wasn't getting again to that, the intended intensity to build the volume needed there because I was just overworked. I was just trying too hard to do everything. I read a paper, it may have even been by Marius Bakken about the whole threshold approach. And if it wasn't him, then I'm just wrong. But they basically had yellow, green and red heart rate days during their warmups. And what he did was he would do his standard warmup and watch how his heart rate rose up. And if it shot right up, it was a green day and he would do more work. And if it was a yellow day, he would temper it back and do a moderate amount of work. And if it was a red day, meaning his heart rate's just not climbing as his effort does, he pulled the plug and wouldn't do quality that day. And so even like 30 years ago, because he was also a scientist, he was feeling that same thing. Like if it's not available to shoot up today, this doesn't mean I'm fit. It's not like a resting heart rate. Your resting heart rate should keep dropping to a point, but your max should stay high. You should be able to throttle it up right away rather than I'm so fit it doesn't climb. Right. And what's a little challenging now with high rocks workouts, right, is like the demands shift so much that there are specific things that you might jump into where your heart rate drops. And for example, the row, like you could be rowing at the same output, but your heart rate is going down because you're sitting or on a bike, right? Like your effort's still the same. You're probably still getting the same intended benefit. So like that's a little bit tricky too when it comes to high rocks workouts with heart rate because you're like, I want to pin it at my interval threshold, but then like you start pushing the sled and it might go down or you're doing burpees and it might go up or, but like because the positions change. So then that was a whole different thing that I started to look at too. It's like, okay, what's the most effective way to do these workouts as opposed to being like, all right, I'm just going to do 80 meters of burpee broad jumps every time. I'm going to do 50 meters of sled push every time. When really that was bringing my work rate lower and not like getting, keeping it at that intended intensity. And that was another thing that really became kind of clear after like honing in on heart rate like a little bit more. So I'm obviously a big believer in threshold training, but I've seen examples where it just isn't effective for an individual. And from what I've seen across the board, I've seen a few, I've heard a few college coaches and athletes talk about how they tried implementing it and it just didn't work. The commonality in these cases seems to be one of two types of athletes. One is that they are too tough for their own good and they'll just either keep doing more or overwork it a little bit. Like they'll run a pace rather than an effort or a pace rather than a heart rate. And then they'll add reps each time. And last block I did 12, this block I'm doing 14, next block I'm doing 16. Whereas if you look at the Norwegians, I think it took Jakob six years to move from like 12 by 400 to 20 by 400 in his workouts. They went off lactate and they slow played it. I think Northern Arizona one year was doing like three by mile with three minute rest as their PM workout and they're all dreading it. Like, well, that's not threshold training. It's not right for everyone, even though I'm a huge believer in it. And it doesn't prime certain people for competition. Your metrics can be super high, and you may not be able to feel like you have any semblance of efficiency at competition effort. And I think of this more as like, this is less quantum, this is more like theory, that there are certain type of athletes who can just get thrown into the fire and are just tough enough to do it, so they don't need to feel it that way in training. Where I need to feel it. I need to know what it's going to be like. I need to build my tolerance there. For some people, maybe it is better. They can do the frequency and get more over the course of several sessions and then still come and race well. But for me, it's just like, I need to feel it. I need to know what it's going to be like. And I don't know if it's more effective physiologically to accumulate like that. But that's just a theory. I think some people can just do it. Personality. Again, we're the opposite athlete. I've always raced best pre-taper. The longer, grindier stuff, when I'm a little more fatigued, I can jump in and race. But I've never got a taper right, right. So I'm better just to train right up to an event. Take three days easy and go. Whereas you need to prime your systems. And that becomes very difficult in a sport like High Rocks with eight different modalities to do plus running. Could you outline, it doesn't need to be an exact session, but let's say a year one session versus a double threshold session versus where I've landed more recently session. Could you just maybe give us an example? Yeah, definitely. So like year one, like when I was starting to do like these tempo workouts, I was doing anywhere between like 50 and I think I tapped out at 75 minutes of work where it would just be like pretty just continuous, like 800 meter run, 37 to 50 meter sled push, 800 meter run, sled pull, 800 meter run, burpee broad jumps, just do that. Right. And just keep that in succession, build some volume. And like I would rotate that out. So sometimes it'd be lunges, sometimes there'd be the row, any like things that would give me like specific problems or anything that I wanted to feel like later in the race. What sort of intensity? Like starting at like a seven out of 10, like marathon tempo type intensity and letting that kind of that fatigue build. This is when you were starting to improve when you before you pop that 60, we'll call it. That's what you found is like a good winning formula at that point. And I think that's incredibly effective. I think that works really well for beginners just to understand the pace of it all. Like what minute five is going to do to minute 40 is it's just like really helpful to have that. So you're talking if you had to put metrics like starting around aerobic threshold and letting the fatigue take you over by the end or were you sticking at high end aerobic the whole time? No, I was definitely going over at a point, right? Like, but like the pace wasn't super fast, but the feeling and the fatigue from the muscular side, I think was just like, so like it would get harder, but I'd get like a little slower in those times. So yeah, I'd say probably finishing right under like anaerobic threshold feeling for sure. Then like the double threshold years, it would be like morning would be, I don't know, 12 by 90 seconds on skier with 45 second rest, something like that, right? I like the shorter pieces on the machines just because like muscularly, like we'll be taxing eventually. And then the afternoon could be something like straight up threshold run, could be whatever, four to five by 1600 with a minute rest, or it could be something more high Roxy where it's like three by 10 minutes at like 600 meter run, burpees, lunges, rest two minutes type of thing. But usually the morning was either some sort of machine or some sort of mixed modal or some sort of like, I guess it's not mixed modality, but it would be like straight sets of like, I would do like six by 60 second ski, six by 60 second row, six by 60 second run, for example. So hitting all the modalities, but putting them, but having them be like isolated. And that was pretty, and then, you know, I would work some sort of longer, maybe one or two longer workouts or just like one longer workout per week, maybe, depending on where I was in terms of the competition season. Okay. And so now I've been playing around with a couple of different varieties of this. And one thing that I've taken out of these like tempo runs are like the repeated sleds, because I just think that if you're going to do the sleds, you should do them with intensity and with speed and with power. And then ultimately, if like we're doing it 40 minutes into a workout, we're just gonna be so exhausted that like we're not getting, we're like, we're getting some stimulus in terms of fatigue building from the sled, but it's not specific. And you're just like training yourself to work kind of slow on the sled. So I kind of use the sled for like speed work only now. So I don't really put it in like these type of pieces. So it would be something, I really like the echo bike for this type of thing, just to keep stimulus up. It'll be similar format, but just with like shorter chunks of station work. I have something written. For my session this afternoon, I'll give you a little piece of it. Sure. A little piece of my session this afternoon. So you have like a quality session prescribed for yourself today? Yeah, man. If I was eating bicarbs like every day, just every session, zone two, bicarb. Hey, some probably do. Bicarbonate alphas, easier on. No. I'm making a post about it. So I've actually started to blend. So one thing I've gone away from is isolated like track sessions, like speed sessions that are just running for the sake of getting the density of volume in one shot. So I used to be able to split that, right? I was like, okay, I've got my run work here and get my station work here. Now I've just like combined that session. So today I'm going to do like a straight up threshold run session up front. And then I'm going to finish with a 28 minute EMOM where it's going to be, so okay, so it's three by two mile is what I'm doing today with, I'm just going to do one minute rest. And then two minute rest into a 28 minute EMOM where it's the zero to three minutes is 52 cows in the echo bike. Minute three to four is 20 meter burpee broad jump. Minute four to five is 20 wall balls. I'll probably go heavy. I'll probably do 25. And then minute five to seven is going to be 50 meters walking lunge. So what this is going to do is get my heart rate at that anaerobic threshold, like quickly within that first like, within that first interval of run. And so that 28 minute EMOM, I know that these, the duration and volume of each of one of these movements is going to be high enough that I'm able to keep my heart rate at that effort and not so high that it's going to burn me out. So you're running through that four times. How did you land on those specifically versus, I don't know, you didn't say ski or something. So I like the, for this one in particular, I like the echo bike so that it keeps me, kind of keeps me in the game. Like skier and row are just kind of exhausting. They're just like a little bit too hard sometimes. So I've tried this and I get there and I'm exhausted trying to get into the other movement. So more is just like more hittable, honestly. And same with all the other pieces, right? Like I like burpee broad jumps and wall balls in particular because the heart rate response is favorable. Like you can stay in a good spot. Like it will go up. Where other things like farmers or like walking or sometimes walking lunges even, like things can kind of dip down just because the work rate is so much slower. So I've just found these to be like doable at a higher effort. So you went down to Austin, Texas, hung out with Nick Bear. Sure did. And you met an athlete I've been working with for five years, Simon Diaz. That's my boy. Simon's the guy. Well, technically he's my boy. That's true. We'll have that conversation later. But I thought it was funny because I had prescribed him like a mile buy-in session with High Rocks finisher that day. I think he had, he might've had like a mile buy-in cash out or he had three by a mile and then his hybrid work. And you guys all went down and hit a session together. And he told me what you guys did. I'm like, yeah, do what they're doing. Are you kidding me? Don't worry about my stupid workout. Go hang out with the boys and like get it done. And what did you do? You did like a mile buy-in and it was like very similar to what I was like, I couldn't have worked out any better. Are you often doing, so anyway, so big fan of that philosophy point being. Do you believe, do you always like the run uninhibited in the beginning? Do you ever You ever interested in a cash out scenario or vice versa? Have you played around with that? I have thoughts on it myself, but I'm just curious what your learnings are. So when I will flip it, it will, with the intent, the finisher will be at more like tempo, right? One steady state as opposed to interval based. And the intention will be at potentially high rocks race pace or more like marathon pace. Like just the output is going to be much lower. Like intuitively, I've tried to do it before where I'm like, I'm going to rip 35 minutes on this echo bike. Then I'm going to go do some threshold intervals and it just like, I just exploded into pieces. So you get the same type of benefit on, but just at a lower output. So it depends on what my intent is for the workout. But yeah, I do like that. Okay. So you've gone 67 down to 54 using this process. Now along the way, it's always hard to tell if it's because of or despite. So if you took what you know now and you went back to day one, could you pick up with what you know now doing this? Or would there still be need for precursor work to get to the point where you don't need standalone run or erg sessions or as much anymore? How much of this is universal and how much of this is athlete training life and experience? Right. Like what steps could be skipped in this process? Yeah. What was not needed and what was absolutely necessary, but not best practice for performance? So another thing I guess I didn't touch on here is I went through two different bulking cycles where I was like, I'm putting on weight so that I can put on muscle, right? And that step was very helpful. As Kirk asked in the beginning, it's like, how much muscle do you have on now compared to where you were? And I look much more muscular and I'm much stronger, but I went through this phase where I was carrying a little bit more body fat so I could get a little bit stronger. And then I'm at the point now where I can be leaner and still be as strong. So in terms of that cycle, I don't think I could have skipped anything, maybe one more, or maybe I could have started to try to lean out earlier. I don't know. But what could I have skipped? Like the muscular piece was so important in being able to understand how to handle that type of muscular demand over the course of a 60, 70, 80 minute race. But I had to go through that. I had to go through figuring out how much muscular endurance volume I could do and what was recoverable from. So that was another part of all the volume when I was doing the double threshold. I was doing a ton of station volume too, muscular endurance volume, which is so hard to recover from for me. But I needed to find where that line is, right? And is there resiliency from that? Like probably. I don't think I necessarily needed to do trying to build volume and intensity and muscular endurance at the exact same time. I probably would have not done that. But I think a lot of the process is maybe like a year shorter than what I had done. And I got a little bit lost in some of it in the middle there. And then the million dollar question, would this have happened without COVID years of running? Could you skip your 80 to 100 mile weeks, years, and be just as good at this? Or did this require an investment in that aerobic capacity up front? Yeah. I don't think the answer to that always, like I feel like the floor is still what matters ultimately at some point, right? If you're working with a one-story building or a 30-story building and take the 30-story building that you built over years, right? You could never say that didn't help, right? Could it have been built concurrently or did he need that? In a vacuum, did he need running in a vacuum? Yeah. Listening to this as a listener saying, I'm not having another COVID I don't think coming or I'm just going to go run. I don't know if I want to give two years to 80 to 100 mile weeks, but do I need to? Or can this be done differently? Obviously, it can always be done differently, but would you be at 54 today without that? Yes or no? Like for me, when I would look at this, I would say it is more the like 20 years of running as opposed to like the summer. That's not what people want to hear, Rich. Yeah. Like the summer of high volume, like probably not. I probably could have just kept it at 50s and been kicking butt still. So I think it is just like the, that's the thing with this whole process that I always lean back on is like, I've never really stopped trying to be a high level runner, right? So it's always been something that's been present, even through CrossFit, even through OCR, like I've always put that there. I've always put my intention on that. So yeah, I think it's more than 20 years than like the one big build. Okay. And I have one last question with this, and I don't want to take away from what you do at your channel and your coaching services. We don't want you to give it all away, but we want you to give enough away that people get why they should. We're going to cross over. We're going to cross over. It's fine. So let's use me as an example because I feel like right now at this point in time, I'm the closest to the everyman as I've ever been. Jobs winning, life's winning, workouts are losing. I'm probably the least fit I've ever been as an adult. Start me on a high rocks build path. Race fit or fit fit, they're different. And they're more different than the same. Both. Let's say this is my lowest combination of both. Okay. I'm fine. Can you still dunk? It would probably take a day or two. Okay. Like I'm fine. But this isn't about me. This is an example of me. You're taking as close to an everyman as I've been as an adult, if that is not too douchey to say. And let's say it's Chicago fall, high rocks. I want to do your 60 or your 58 equivalent performance for me without COVID running and getting it wrong along the way. Give someone six months. What is the process you would prescribe for a person like myself? I don't want to go 67, 68, 60, 58, 58. I just want to go 58. Bracken's looking for a free consult here. I like it. Smart move. I think I'm in a notebook. Just one sec. He's getting like super familiar with the anaerobic threshold feeling again of the running. I would build that up probably first. Explain that just so people know what you're talking about. Like trying to figure out where you are at like that, what you can race at between that like 45 minute and like 75 minute mark of us like putting out at what's comfortable, but hard. Like that can be built with very short intervals. So I would probably start with 400s, right? With very short rest and build that up over time and then have that be three months of that process. And then kind of move into those workouts that Kirk and I were talking about where it's threshold into station stuff. And probably the other side would be those tempo builds like starting at trying to accumulate 25 minutes of decent effort and then stacking that on top of each other week over week. I would probably keep it pretty simple that way with the two quality sessions. Fours and 25 minute compromised tempos and progress them up to three by two mile and 75 minutes. And when you've hit that, you're ready to start being race specific. Yeah, if it's recoverable. So you would cut out the big volume build and you'd cut out the big double threshold and you would stick to threshold work and long tempo Metcon work. Yeah. Can't tempo a Metcon, but you know what I mean. Station tempos. More or less, right? Like you kind of can, right? Like getting efficient while moving in and out of different domains. Okay. For sure. Probably build skill on the strength sessions. A base of strength for, again, for the first three months. Last three months would be a little bit more specific, getting stronger in the positions of the sled push, sled pull, working on the skill of everything. And then aerobic work around it. And as much as aerobic work as you can handle, not necessarily as much running as you can handle, but as much aerobic work as you can like fit. Throughout our time talking offline, and some of it's on, we've talked 5-3-1, we've talked German volume training, we've talked minimum effective dose German volume training, we've talked about priming strength work with three by threes and things like that, pre-competition. Where do you stand now with your view on all that, A, for you and B, for again, the theoretical athlete prepping for their next race, trying to optimize? Yeah. So for me, it becomes what's most recoverable from, and the season has been so long that I haven't really had a chance to be like, okay, I'm going to work on back squats. Back squats to me are just like the juice is not worth the squeeze on that. It's hard to recover from. It's like a little uncomfortable, and I'm not like super confident doing them all the time. I like deadlifts a lot, but at a point I'm just like, the risk reward isn't in my favor. So I start to get pretty specific, right? Like I'll do just like sets and reps of sled push and sled pull, which I didn't do in the beginning. I was like, I just want to get broadly strong. But now it's like, I want to get specifically strong because I know exactly what I need to do in this event. So I just want to be strong within the parameters of the task. But again, so yeah, I found like the specifics of the strength training to be like pretty important. And like the actual highest output of like strength that we need as a high rocks athlete is like not that high, I don't think. Bracken, I'm glad you asked because that was exactly where I was going to take this next. That's how you know we've been doing this for a while. There you go. I have a pool of athletes who are strong boys, thick boys, right? They still try to pull up the split shorts, but they probably shouldn't, you know, those type. That's kind of the look now. That's the best look for split shorts. It is the look. You want to be too big rather than too small. That's how I do it. Our guy Nick Bear is doing that. He's just out here with the split shorts, wearing 210. No big deal. So I'm not going to see my grandmas this year. I was looking forward to that. You're doing the full? Yeah. Let's go. Marathon debut. What? I know. Isn't that wild to think? On the topic of strength. So Bracken, I think we've had this discussion at some point. Like how strong does a runner need to be? Like if you can't back squat 135, you suck. Like not looking for that sort of statement. Are you eating more food over there? I split the bicarb. It can be a little hard on my tummy. So now you're eating more bicarb? I like to take it in two doses. You keep it pretty thick. Always, baby. You don't want to water it and slurp it and drink it down. You're not supposed to chew it because it's like this. It's even baking soda pellets. Very abrasive. Yeah. And you know, like taking it in like the one pack of this is like five grams of salt. So like 5,000 milligrams. So it's like this monster gut bomb. So I kind of had to be careful around like how much electrolytes I'm taking with it too because then we'll just kind of like run out of my body. Pretty serious about this fitness stuff, huh? Yeah, man. Doing what we can. Okay. So do I need to hold off my questions so you can chow and then? Keep it coming, man. I'm not even chewing. This is still better faces than he'd make with his ketone IQ stuff. Ketone IQ is where it's at. You guys play with that at all? No. I got a bunch sitting in my cupboard. I haven't touched it. I like it for if I do a hard workout and then I need to operate as a human being, like talk to people. Yeah. It does give a little bit of a cognitive boost. You probably use that as a dad. It's life. Yeah. We don't all have the feed sponsors, Rich. We sure don't. I just get stuff, anything. Like what is it? Send it. I'll take it. Traditional strength in any domain, even for the runners that I work with myself included, like I'm looking to run a fast marathon, but I'm heavy barbell lunging and squatting, for example, because I just needed to feel good. Right? Okay. Like the man I want to feel like. But what I'm asking is I got these guys, right, that are throwing around, maybe I get them sets, heavy sets of three or fives at some point. And let's say they're rolling sets of 255 on back squat, right? Or they're moving around a lot of weight. Do you think, like where's the, do you have like minimum standards that you think are even relevant? Or do you think it's literally somebody that could only back squat 135 by 10, I use quotation marks, could have enough strength to move the weight effectively, knowing nothing else about their aerobic conditioning. But like, what are your thoughts on like minimum strength? Because what I waffle over as a coach, and this is a selfish question, and we're always learning and experimenting, right, is like, am I giving them this work when really they've got that box checked and maybe we should use that exact same amount of time elsewhere? So I waffle over that and I want to know your thought process there. Yeah. I mean, there's definitely, there definitely is like a threshold that you need to be able to cross in terms of strength. I don't know what it is, and it probably has a little bit more to do with like body size than anything. Like if you are at a certain level, if you can do back squat at 185 and are 210 pounds, as opposed to 195 and you're 145, like the bigger dude's probably gonna be better anyway. There's definitely a weight moves weight type of thing here. I haven't really been able to pinpoint it, but it's probably not that high. And on the other side of people who, because a lot of people are coming from strength backgrounds in this and who do need to work on the running, but they got the way that they are because of the way that they've trained in the past. They obviously like it, right? So you just like have to give it to people, even if it might not be that beneficial, it's just gonna make them feel better. So like, it's not a very concrete answer, but I would do the same thing you're doing, right? It's like, you like squats, you like to look good. You think it's gonna be helpful for just like your mentals. It's like, I usually keep it in. Is it gonna be better if they did like, you know, 60 minute cycling or something? Like probably. I just go back and forth. Like there's a tipping point, right? Like moving muscle is costly. Like moving muscle through space is costly and that's why you don't see 220 pound 15 minute 5Kers because they don't exist because it's impossible. No matter if you have a VO2 max of 85, if you're 220 and 5'10\", you're probably not running fast. Sorry. Even though you have the best engine on the planet, right? And so it's like always like that balance. Like, is there really a formula there? People break the mold. You look at Dylan, of course, but then you look at name the athlete on the opposite end. So I guess I don't have an answer for it either. I just find it intriguing that you told me that you roughly weigh the same as you did in your OCR days, but appearance wise, I wouldn't have guessed that. And so I don't know, just something that I haven't pinpointed yet. Personally, Bracken, have you pinpointed that answer? No, no. It's because you have to be able to put out either way, whether you can squat 500 or 155, you have to be able to work hard for an hour. And Dylan, it's every single movement is going to cost him a higher percentage of his max, which is going to cost him less. And the guy next to him who it's costing him a less percentage of his max, but cost him more every time he has to rep it. I think there's some minimal strength work needed to be able to structurally handle the work, but I just can't. We've tried numbers before. We've said numbers, but it's like saying what 5K do you need for OCR success? Right. That was the next question I was going to ask, actually, is if you were to take the top 10 high rocks athletes in the world, men and women, maybe you of course would probably know men a little bit better, but what do you think the slowest 5K and the fastest 5K, if you were to put you all on a start line, I'm not even asking for names, what do you think it would be? What do you think the slowest 5K top 10 and the fastest 5K top 10 would run right now? We actually did get a cool example of this last year because Ronkovich ran a 5K like the week after Worlds and granted, like he might not, he just won Worlds, right? So he's probably like, this race matters to me, zero. So maybe he could put out a little bit more, but he ran 16 flat on a track the week after High Rocks Worlds. He was in spikes. He was like going for it. And the way he was talking about how fast he was going to run, 16 flat was a little disappointing. But looking at him, and if I didn't know like what he was saying, I would say 16 flat is like pretty good. Really good. Where the slowest top 10. So he would be the fastest? I mean, what do you think he could run right now? Well, he was the fastest High Rocks athlete. I would smoke him. You could do that in your sleep. Yeah. What would Palayo run in a 5K? Palayo would probably be like 15.30. What about you right now? Yeah, probably around there. Maybe a little bit faster. I'm not sure. It depends on sea level. It depends. And what about like, what could, oh, I don't know. We have Watson's not top 10, but he's 15. If you see someone like, someone who leans on stations. Well, let's say Hunter It's like the pace that you're running, for me anyway, is pretty close to marathon pace. It's like what your marathon pace would, but over the course of two hours and change, it's just kind of a different thing. Don't you love when an athlete's newer to this and you prescribe them something, like let's say you're 90 seconds on station work, just something approachable, but whatever, and they're like, should I be running 5K pace for this 90 seconds? And you're like, you tell them, let's start at marathon pace and see, and they think it's so slow. It's only 90 seconds of running, I'm only running four minutes at a time, and they look at you like, are you sure about that? At best, you're going to be running marathon pace during this thing for your first couple of go rounds. It's so hard for people to wrap their head around. I always get amused. That conversation happens almost with everybody. When they say 5K pace, you don't really know what 5K pace feels like. You don't want to do it at 5K pace. It's not something you want. No athlete ever asked, can I do this at 5K pace if the option was slower? For sure. No track guy ever pushed for more 5K reps. I remember when you prescribed, Rich might have had this prescribed, back in our leaderboard days, you prescribed OCR 200s, and the indicator was 10K pace, and we were only running 200 meters. I was like, this guy doesn't know what the heck he's talking about. I'm running 200 meters at 6-mile pace. This guy's an idiot. I got into that session. I understood. The first 200 was a joke, and after that, and the station work, and now you're whatever. They were like 1,200s in total. Compromised 10K pace is nasty. What happened to Burpee 10K? Are we still doing that? Bring it back. We were giving something to the people. Were you the champion, or was Godette the champion? Godette beat me, sandbagged. He waited until I went. I got second and third in the beer mile. Freaking Bauer beat me in the beer mile. Unbelievable. That was his only beer of that decade. For sure. Shut up. He was wearing gloves. So with all this being said, you've identified pieces of why you're successful right now, but there's always the binding pieces to that, whether it's headspace, whether it's perspective, whether it's confidence, whether it is just getting race experience. Why are you so successful right now? This is your longest stretch of, in your words, good racing in a row, and it's the highest you've ever been ranked in the sport. I don't care which ranking system you subscribe to, and it's got to be, if there were Vegas odds, this will be the highest you've ever had to make the podium at Worlds, and you'd be on the list for odds at a win. You're at a place right now where you're as high as you've ever been and as successful as you've ever been, and you're old for a running job. For an athlete. I would feel to be back at 39. Not old for a person. Old for an athlete. So why? What has all come together? With the whole process of figuring out what's working physically and all the nuance of the paces and the heart rate and needing to, like, what effort needs to be there, what movement needs to be there, none of it matters if I wasn't able to come and perform that day, so I started taking my recovery a lot more seriously. And I think that's just like, because I got to that point, it's like I've tried doing more. I've tried doing more these past two or three years, and I can only do one other thing now, and that's do less. So doing less has actually yielded just like such better results, and I feel happier. I feel like I'm recovering. I'm sleeping well. Nutrition's no problem. Body composition's great. I'm not fighting against all these factors because I'm just like overworked and stressed, which I think has, like, if this was 10 years ago, would I have gone the route of doing less? Like, probably not, you know? So I think it's a little bit of the byproduct of the age and, like, having enough experience and maturity as an athlete to understand, like, sometimes I'm going to want to do, like, something I don't necessarily feel like I should be doing to get better results. So, like, doing less has yielded better results. Specifically, what does taking recovery more serious look like to you? So one major shift I made was I started taking complete rest before my key quality session, like, no matter what. Like, I take a complete rest day where I'm just chilling. So I get to that quality session. I have one that's, like, the most important for me, and I'm ready. Like, by the end of my off day, I'm, like, excited for this workout, where in previous cycles I would just be like, okay, it's a workout. I'm going to be able to accomplish it. I'm going to be able to do it, but I'm not, like, looking forward to it. And now I always look forward to this quality session. I'm always confident I'm going to hit it. So I get, like, this physical rest, which leads to, like, this mental recovery so I can come into this event and just, like, know, come into, like, a workout and know it's going to go well. So it's given them a high level of confidence, too. Like, rest day as in nothing structured. Yeah, like walking around. Like doing some stretching. Yeah. Have you taken that philosophy to races before race day now? Yep. Wow. Like nothing. Complete rest the day before. And you feel like your body, mind, it's more ready because of it. You just don't hear that very often. It's not an approach I've ever took. Yeah, it's just like I know I do it in training every week, right? So it's like if it works every, like, there's no reason it's not going to work at race. I would say as my OCR, I hesitate to say career, but career peaked, I was doing the least I've ever done the day before. Part of it was travel was never good for OCR. Right. And I would just say I'm not forcing a workout, but that does track for me. Yes. What else? It's interesting because I feel like I'm in the opposite boat almost. You're marathon training, though. It's so different. You're so correct. But talking to the recovery and availability, I'm actually at a point where I only run five days a week. I do no supplemental cross training, and I strength train three times a week, and sometimes I half-ass that. But when I put on my Alpha Flies or my Metaspeed Skies on Tuesday, I'm ready. And when I need a quality long run, like I could do 70 a week, I think I'm being available, but there's something about showing up and making it count and then taking Wednesday as a rest day. For me, I barely do any strength work, and so is Sunday now. But being available is just so important. And I don't know, can you do that at 25 if you only have a handful of years under you, or does it take the sacrifice of not that to get there? That's a good – I don't know what the answer is. But anyways, I agree with you, by the way. I'm ready and available, and I could be doing more, and I'm choosing not to for the very sake that you're outlining. Right. What is the other recovery stuff Bracken was asking? Sorry, not to talk about myself. I'm interested. It's an important concept. Those extra 10 miles per week, 15 miles per week, can you quantify if they're better than 25% more quality work on your individual session? Can you quantify that 10 miles of aerobic work beats being better on your quality days? I don't think you can. If it's 40 miles, you could maybe argue it. Right. Yeah, and that's kind of like I feel like I've been bound by this system of endurance training, and I just recently had this thought. Now where my running is and the amount of anaerobic threshold that I'm building, I'm still finding myself bumping up against this mental ceiling, like this glass ceiling of like should I do more or is it going to be a problem? And it's because of like Daniel's formula. It's like, oh, Daniel says the percentages shouldn't be out of whack, but like that doesn't matter for what I'm doing. And body doesn't know percentages. Exactly. So it's like I feel like I've just been bound by this idea of like what works historically in running that I've kind of like pushed against. How many days per week are you running right now? How many days per week? I think five, one complete rest. Yeah, five to six-ish. Like sometimes it'll be like some mixed modality work where I'm just doing like 400 at a time at zone two, so it's like barely running. I'll accumulate like two miles. Five days per week of running, 40-ish miles per week, two big quality sessions, and a bunch of extra aerobic work? Swimming. Swimming is something I've added. That is something that I have that I don't know. How much swim training have you two done? I've done more than I cared to in the past. Was you doing tri stuff or were you a swimmer? Well, tri stuff for just like two years, but I actually resorted to the pool on the injury front a number of times. Front crawl? Mostly front crawl, yeah. I mean like typical. Yeah, what are you doing? Swimming? Like traditional waste Like swimming, laps. Swimming laps. I do that twice a week. I feel like the workout that I'm getting aerobically and like a respiratory workout, like if it was like ventilatory threshold is what the marker would be doing, I feel like I'd be at like that ventilatory threshold 2, which is in line with anaerobic threshold and lactate threshold. But my heart rate's like 100 beats per minute because I'm horizontal and I'm in the water. So I feel like I'm getting some good quality like breathing work in without any consequence. And I'm not doing a ton, right? It's like two times a week, 40 to 50 minutes in the pool. I get like 2K total of volume. But I just feel so good when I come out of it. And I think it's just like full body, oxygen intensive. I think it really helps my breathing. I have asthma and living here in Colorado is like so dry that it can be like really harsh. So like kind of being in the water, just like get a big brush of humidity. I come out of it feeling like I'm breathing better. That has been a major change in my training. Something I just like hadn't done in like decades. So again, I just want to reiterate, five days per week running-ish, 40-ish miles, two quality sessions, two pool sessions, extra aerobic and strength work. Two strength sessions. None of that adds up to what on paper would excite someone to try to become a world champion. Of all the plans you and I have ever talked about, this is the least sexy. Yep. And that is kind of the point. I think with Hyrox in general, like the biggest challenge that we're facing is not overtraining. You're seeing it this year. Yeah. It's like it's really easy to overdo it. And maybe it is just because I am older. And maybe if I could do 25% more work, I would have 10% better results or something. But for me, this is what's working. So then you pivot. Let's say Hyrox goes under tomorrow. Okay. And you get super psyched about the road racing scene. What are you bringing from this back to your running pursuits? How much of this stays? The aerobic stuff, probably quite a bit. Probably quite a bit of the aerobic stuff will stay. You mean aerobic machine work? Aerobic machine work, I'm sorry. I'll probably keep swimming. I would keep that. Would I do mixed modality work in terms of quality? I don't know. Maybe some echo bike stuff. Yeah, Kirk, you're down with the fan bike, right? So I'd probably... I am, but if I have to. Right. I might keep it because just so I can get more volume. It kind of keeps me... I say this to myself, it keeps me in the game. It keeps me in the workout. Where if I'm needing to run whatever, 10K in a workout, it's like a lot. But I can run and bike double that. Double that amount of volume. That's probably what I would take. Something I have added is that like... The old X-Factor day, like 30-second hill sprints. You're back on that? I'm on it, dude. And doing strides before my workouts. I'll do like four to six strides before a quality session. And mechanically, man, things are like popping right now. Okay. It's a good feeling. It is good. It's like, oh, wow. I feel fast again. So you're also looking for things during workouts to keep the workout going. Yes. You're not trying to finish it in the time you're... Like get the best out of it and be done. You're trying to... I'll pivot to another movement if it allows me to stay in it and go more. 100%. That is very against the running code. Well, when you need to be... Because sometimes I'll feel like mechanically running. I'm like, okay, put myself in good positions while running at this high output, right? And being able to do... I can do it for like three minutes. But can I do it for like 30? It's like not as well as I would want to. So that's why I don't think I would do as well in something like a 10-miler or a half marathon or marathon. Just like mechanically, I think I would break in those positions. I'm not that resilient. Where you need to be resilient when you're preparing for it. So you need to run well. But we don't need to run well for three or four minutes at a time here. Yeah. Your answer of recovery, I feel like I shove it down people's throats that listen. They probably roll their eyes. And I'm like, you need to rest. You need to rest. Take your down week or do this. And it's just good to have somebody else just echo it. Yeah. From a coaching side, it's frustrating. But I like you from a competitor standpoint. I'm like, oh, yeah, I'm resting more. People are like, dumb. Not doing that. Great. That works for me. Well, no one ever seeks more rest until they've gone too far. And knowing that you've gone too far is the thing, right? Because you can double down. Like maybe I'll just go find it. Or it finds you. Right. Right. And that takes a while. I think we've covered it, at least what I was curious about. That was actually exactly what I was hoping to just get a timeline. Wherever people listening find themselves in their progression in hybrid, I think you probably could relate to a number of things you said. Bracken, did you have anything else that you wanted to explore? Not a single thing. Wow. Perfect. Great. Nice job, everybody. Got the mental checklist down. This was a nice time. We should do this more often. What are you just, for those, I guess, who don't know or follow, what are your next events this year? What do you have on your calendar? So just High Rocks World Championships in Chicago. That's June 13th, I believe our race is on Thursday. Kirk, you going to come through? I don't think so. Oh, it's going to be like a scene. BK, you're coming, right? I could be there Thursday, but then I got Friday, Saturday, Sunday at the other race venue. Carton? Carton. Come out Thursday. It'll be fun. Put my dip in. Yeah, boy. Put on my flannel. Wait, is it Millers or Keystones? What are we sipping on there? I mean, Keith Stone probably pulls up at the track. Smooth like Keith Stone. You know what's surprisingly present at the track? Peach Bush. There's Peach Bush? Unaware. Bush Light? Some fruity flavor? All right. So you got High Rocks Worlds. Knock it off. High Rocks Worlds, yeah, and that's really it. That's really all. And then you'll figure out what's after that after. Figure out what's after that, whatever the season's looking like, not sure, whatever life's looking like. So that's the main goal. So about six weeks. Doesn't it feel like between now and Worlds there's this nice chunk of time to sort of, I don't know, it seems like everybody here in the States anyways, that you got sort of like this chunk of time now, what you do with it in these six weeks. Because we had racing this winter and up until this recent weekend and now it feels kind of open a little bit for most people. Yeah, it's really not that much time. I was looking at the calendar like it's on there, but it is nice after that. I had a race in Miami. I was like, all right, I got a little bit of time to chill. Got a little sick because these races are impossible at 9 p.m. and then try to get asleep that night. No, not happening. And you're packed like sardines into those venues. Everyone's just breathing into each other's diaphragms. For sure. For sure. It's like really hard not to get sick. People follow along RMR, the podcast RMR. What does RMR stand for? It's Rich, Meg, and Ryan. I used to say Ryan. No, no, not anymore. Performance Dictates. Kempson 1, Kempson 2 got switched. Yeah, definitely. All right. So that podcast, then where else can people consume? Active over on YouTube doing some race recap stuff, a lot of just like nuts and bolts, like how to train for Hyrox. It's a good platform from me over there. Instagram's fine. Rich Ryan 610. Those are the main platforms that we're on. Check us out over on racebrain.media. Brand new website out. I will not be making any content there. I will just be saying that I'm just going to be claiming all the content. I'm just going to take all the kudos. Yes, great. 610, is that your area code back home? Yes, sir. Philly? Philly-ish. Philly's 215. I grew up like north of Philly. We're 414. Ludacris shouts it out. Did Ludacris shout 610? Not 610. 215, I'm pretty sure. It doesn't exist. What's the 212? 262. He has no ladies in the 610. No 262. Light just went out. That's it. All right. This beauty lamp is done. Well, it's good catching up, man. I haven't talked to you in a while, so I appreciate you taking the time. I know you've got a schedule to keep. Super fun. Thank you, guys. Really looking forward to this. This was fun."
}