{
  "guid": "86f06c3b-af84-32c3-ab5f-fbc48598271a",
  "title": "Training Tuesday: BK is Overseas and Just Really Needs to Race",
  "transcript": "Welcome to The Running Public with Bracken Crocker and Kirk DeWint. It's Tuesday, folks, and you know what that means, Training Tuesday. We are going to take every rabbit hole, follow tangents, use useless metaphors, get lost in the weeds. This is Training Tuesday. When you're ready to take your training or racing to the next level, go to therunningpublic.com. We have both monthly subscription training plans, $19.99 a month, and Bracken and I both offer one-on-one customized coaching. Again, go to therunningpublic.com and check out our offerings. Bracken, the listeners may already be noticing something different about what they're hearing. You want to talk about that? Yeah, my one thing I have going for me in this world, a good audio setup and backdrop are not present. Why is that? I'm sitting in an Airbnb in Riyadh, Saudi Arabia right now. Riyadh, the hot spot vacation location. Yeah, if you're the UFC or millionaire, I guess. So why are you there right now? Why are you in Saudi Arabia right now? Jack and I have been kind of consulting for a race management company that is putting on an OCR event in Alula this weekend. And we are concluding that partnership by rabbiting the race with cameras and then commentating it. So I am on my way there, started yesterday, finishes up getting there tomorrow. What's the total travel time? Flight time, I want to say 17 and a half. Plus layovers. I think six one ways to get the shortest possible air time and layover time, except for this one layover I'm on right now. This is the only downside to it. I'm on a 19 hour layover currently. So you rented an Airbnb so you could have like a night's sleep and internet so you could record for the running public. That's the sole reason, right? Yeah. I misunderstood the RUH airport policies. In order to go anywhere in Saudi Arabia, you need a traveler visa or a transfer visa. They have this e-visa process you can do online and you have it on your phone. The way I understood it, if you're in the airport longer than like 12 hours, you have to have one just to be there. And if you switch terminals, you have to pass through custom visa to go. Like I landed terminal three and I take off in terminal five and I would need a like $180 visa to get from one terminal to the other in the airport. So it's strange, but that's just the way it works. And so I thought that I could either stay in terminal three or terminal five tonight. And they have lounges there. So I got lounge access in five. And then I thought if the three lounges looked better, I would just get one of those and I would work for a while and then get a few hours of sleep and then get on my flight. However, what I didn't realize until I landed is that you cannot go to your departure terminal until four hours prior to departure, which is 10 in the morning tomorrow. So I can't get in until six. But in order to get out of three, you can't even reenter three until you go through customs. So I had to leave three. Like I couldn't get even back into the lounge in three and I'm not allowed into five until tomorrow. So I was just kind of stuck. So I had to get an Airbnb, which in and of itself was a weird one because it's not technically an Airbnb. It's some private company. The driver dropped me off in the middle of a neighborhood that looked like an industrial park and none of the signage was English. I couldn't figure out which building I was supposed to be at. There were no people and I couldn't figure out how to get into the building. And finally they were messaging me on WhatsApp and they gave me the code and I went into the unit. They get like luggage and clothes in the unit. So I was messaging them and they're like, you're in the wrong unit. My code worked to get in. It's the same for every unit. Well, that seems like a security liability. But anyway, it was a whole time. It's 104 degrees out. So I'm just sweating profusely out in the sun trying to figure out how to get into this place. I feel like I got the Saudi Express. Yeah, that sounds logistically obnoxious. So did you have to book this Airbnb like last minute from like the hotel? I booked it from the... I mean from the airport, sorry. Yeah. You're lucky you found something. All right. Well, the good news is it is roughly noon back home. And I know it's much later for you there, but you're like, it's like middle of the day as far as your circadian rhythm goes. So you should be primed for knowledge bombs and analogies still, right? Let me fire it today, Kirk. Got great sleep last night on the plane. Ready to roll. Did you actually? No, no. This was a... As far as I could tell, it was a flight full of families heading... Big families. A lot of big... That's always fun with air pressure changes. All right. And are you getting paid? Like this already sounds like, is the juice worth the squeeze? Are they paying you a million bucks here or what? Not a million. To go do this? They better be. Almost a million. But enough to make it worth my time. Yeah. Okay. Okay, good. So you said that... I don't even know where to start with this. So first of all, I guess you talked to... I'm not interviewing you today, by the way, but I feel like I'm going to start to. You mentioned a few weeks ago... We had a guest interview lined up and we were doing the travel thing where we do one interview or one episode and that guest fell through and now I suddenly have an Airbnb. So we're doing an impromptu. Yeah, that's what this is. This is probably the only episode of the week based on circumstances, but... Correct. You mentioned a few weeks ago on the podcast that you were going to do like a crash course to get ready to rabbit this race. Like a just get up to speed. You were going to every other day sort of overspeed training, efficiency work, all of that for this, correct? How did that go and are you feeling ready? In reverse order, no, I'm not feeling ready. Jack's on site as of today and he saw the course already and he said it's pancake flat and there's no obstacles mile one to two. So with Gregory Basilico and people like that, it's going to be real, real above my pay grade. But the prep didn't go exactly as I thought. I ended up going every third day, not every other day. And after the first day, I switched to doing it on the treadmill with a lot of clothes. I decided Jack got in my ear about he's right. The low high during the day while we're there is 99. So by the time the race goes off at night, it'll probably be a little cooler. But since we're rabbiting back to back, we'll be out there for two hours. And that's so I decided to do a quick little heat training camp if there's if anything can really be done in like 10 or 11. I think so. So they picked like for sure one of the whitest guys I know to go out and just soak to really too. But Jack's another level to go out in scorching 100 degree heat, pale from the United States winners and expect you guys to survive out there. Yeah, I guess so. I mean, we they have vehicles to capture this as well. We're just providing I don't know which one's a roll, which one's B roll, but the footage will complement each other, hopefully. So worse comes to worse, we can hop in a vehicle for a bit. Okay. And when does the event so we're recording on a Tuesday. When does this all start? It is Saturday. It's a Friday, Saturday event. Okay. You got a few days to acclimate further or bury yourself further. Yeah. Yeah, I'm going to try to run tomorrow. Jack and I will probably run the course tomorrow and then we'll run it again Thursday and then probably run it again Friday to get a sense of it. So I'll get. Okay. All right. And the last question about that will be because I just don't know what is the exact event and are people going to be able to watch this thing? Yeah, so this is the here's in the States. Not live, but this is the race company that put on the Tough Mudder Alula six hour champion. So this is in Alula again, same ish venue, slightly different, but they're putting it on for a different race company. So they're putting on money again. It's not a six hour event. It's a 10K event. They're the same people who put on the event that, or no, Albin Inka, Alyssa Petrova won last year and got like 80 grand or whatever they won. Prize money's not that high. Okay. And any major players that people would know about or recognize names that you think are going to be there? Yeah, I think it's the who's who of Europe plus Atkins and plus a few others are heading over there. So yeah, a couple Canadians, a bunch of Europeans. I think it'll be like Basilico, Heineck, Steen Legrand, that type of crowd. Feels like the one place in the world that OCR is still popping and making a big push is the Middle East. That's it. Am I wrong in that? It for sure is, but Europe's still happening and Asia is growing extremely fast. It's just dying in the US. All right. She sure is dropping like flies over here in the States. Yeah. So you said to me, you said, should we make this a Bracken episode? You didn't mean that, but you said it. And you said that you've learned something already. You've learned something already in the past few days. What do you mean by that? Yeah. Well, this is the first time I've sharpened up for a non, and I did not like one bit. And it's the first time I'm traveling, real travel. I think I flew Ashva to commentate a race, but this is my first real travel to work a race rather than run a race. And it is not the same. There's no butterflies. There's no anticipation of the event. It's now kind of like a task. And that combined with you prepping for your marathon was just kind of like painfully clear that there needs to be races that fire me up on my calendar. But I would say, what is this life? This is weird. I miss it. But you're not nervous. No, I miss being nervous on a plane. Okay. Well, if it does make you feel any better, I totally laid an egg in my quality session today. So it's not super glorious all the time. Laid an egg as in my fatigue caught up with me from my two weeks of having great training. I figured rent came due today. So it's not all sunshine and rainbows. But all right. So what does this mean then for you? That's interesting. So, I mean, you're working, right? And this is actually a work trip for you. And I don't know how many people get butterflies on work trips. So I think you're probably feeling as you should. But your point is, I miss the feeling of the anticipation. Like you're craving those nerves almost. Yeah, I'm traveling to a race and I'm not racing. And it feels as much as I'm going to be proud of and enjoy doing the thing I'm doing, it feels dumb to do all the race things. I did sharpening workouts. I packed running gear. I packed hydration packs. I have fuel along and I'm not racing. And it feels wrong. The work part feels right. But traveling to a race where all the people that I used to compete against are competing and I'm not, it's just like I've talked about how I've been very much okay with not being a competitive athlete. That's okay. That time has left. That's okay. But last night on that plane and leading up in these workouts, I don't know how okay it really is. It's okay until I get around. And now I'm too close to it and I don't like this. You're showing up as a non-competitor to an event and that feels icky. Yeah. But also... I'm going to feel like an absolute poser and wash up walking up to Atkins and being like, so do you have any sound bites for me about this race? I'm going to enjoy the conversation and it's going to be... Do you want to know something? Yeah. I commentated the 2018 Spartan Race World Championships because I was injured. I don't know if you remember that. I commentated the team race. Well, I was sidelined guy during the main race, but that was a disaster because I had the... It doesn't even matter. Production guys in my ears and I couldn't hear anything. But point being is I was there in that position feeling sort of like washed up. Is this my next step? I'm not competing. And do you want to know what happened the following year, Bracken? I had the best Spartan Race World Championships of my life. One year later when I showed up washed up as the commentary guy. And it did feel weird. I mean, it was exciting in its own right. It was Spartan Races still was in its heyday, I feel like. But nonetheless, I felt like kind of a poser chump there for sure. But it didn't make a difference. It fueled me, I think, moving forward. But I thought in that moment watching those guys and girls compete while I was commentating on it, like I am certainly not that right now. In fact, I am so far from that right now. Like I couldn't even imagine doing what they were doing because I felt so removed from it on the injury standpoint. So I sort of relate, sort of. Yeah. Yeah. It's the same thing, right? Except you intended to be there and I didn't. And it's just I know how fit and fast everyone looks when you're on the sideline not competing. Have you ever been at a track meet in your life where you don't run an event that you usually do? Watch it and think, oh, I'd crush these guys. Or is it every time like, how do I ever compete with these? It's like I swear I don't look that fast and I'm not that fast and there's no way I could run as fast as these people appear. Yeah. So I know that's exactly what's happening, but like tenfold because I actually can't compete with these guys right now. So as much as this feels odd, I think that this trip is going to be so selfishly so good. Can you elaborate? Well, I had talked a week or two ago where I just want the option to say yes. Just be fit enough and healthy enough to say yes. But now I'm getting my nose rubbed in it. I'm actually here and they're like, you know, if you want to race Friday, you can. You don't have commentary to do Friday. We can give you a spot in the race Friday. And I said, no, I don't have the fitness to go race in 95, 99 degree temperature and then turn around and rabbit for two hours the next day. I can't say yes to that. I'm all the way over here at a race and I can't race. And so it's just like rubbing my nose in the thing that I started talking about a week or two ago. Say yes. Even if I don't say yes, I want to be able to. Well, to make you feel better about that slightly, I alluded towards the fact that I laid an egg sort of like it just was an underwhelming session. I went to the track and did some quarter mile repeats with only 100 meter jog recovery. Anyways, we had our first, it was like 75 degrees out and dead calm ish and sunny. And what my heart rate did and how I felt out in those conditions, I haven't run in 75 degrees, which sounds like nothing. That's foolish. But we've been running in such cooler conditions. And I can tell you that my body's like, hey, you're not quite used to this. My heart rate wouldn't come down, wouldn't come down. I was anyways, I think it's probably the right call because if I put another 20 degrees to that and then forced me to do OCR, I think it would be a bad day no matter how fit I was. And so point being, I think you made the right call. I did for sure. And I don't like it. So anyway, what I not like, it's not a huge realization, but what's just abundantly clear is that having the option to say yes without a race on the calendar isn't becoming an option. So we just have to pick some races. Well, you have done that. You have races on your calendar for this. Yeah, but I haven't signed up for anything. It's still wishy-washy. It just has to happen. So I would like right now us each to pick two races for me to register for and I have to do. For real? For real. We have a little delay, don't we? I'm realizing. Yeah. We haven't talked over each other because we've had like such, we finally have our setups perfect and now I'm realizing we have a delay, which is interesting. Okay. So you want, I guess what I'm hearing, first of all, going back to OCR and Spartan of old, fire aim ready. Is that what you're talking about? Yeah, it's got to be on the calendar and then you either get ready or you don't, but either way. All right. I feel like we were in the opposite boat. No, I was not. Not at all. But it sure forced you. Yep. Are you now worried about injury as much anymore? Like you feel like you've got a pretty good health rhythm going? I don't even think it matters. I think that there's a smart way to get it done no matter what. And yeah, I'm very healthy right now. I think there's, not I think, I know there's a way to get to whatever start line while still building fitness. So I think it's time to stop worrying about that. How many functional years of my 30s do I have left? I turned 38 in 14. So I have almost exactly two years left before I turn 40. And I'm not planning on falling off a cliff at 40, but you can't stop biology. Almost like taking some calculated risks and sort of saying, I'm going to try. And if it ends poorly, at least I tried. And if it ends well, then it worked. But either way, it forced me to look ahead and commit. Yeah. And it used to be I'd err on the side of winging it. And now I err on the side of not doing anything because I'm so tired of being hurt. And that's not getting me to any start lines anyway. It's been just too long. I did not expect this to be the conversation today when you said you had a revelation. I don't know what I thought, but it wasn't this. And it's not necessarily a revelation. It's just kind of like do it or get off the pot time. It's time to stop talking about it. Just like sign up. Well, your job is to talk about it. Yeah. And then the floor is yours again. But I was laying in bed. Was it last night? Two nights ago? It doesn't matter. I was laying in there and Jess was asking me about the marathon coming up. And she's like, what's the furthest you've raced and trained for and run? She was like trying to think it through. And I'm like, well, I ran 37 miles on my 37th birthday. I've run 250Ks. I've run 30 miles in training once. Some other things. But the point is, she's like, well, when was that 50K you ran? Your first 50K, which was the Superior Spring 50K. About 5,500 feet of vert. Very technical trails. So I went back into my Strava. And I was like, that was just coming off of five months of a stress fracture. I started running again in November. And I'm running a 50K that following May. And I looked back. And the week prior to that 50K, I ran 17 miles total. Total for the week. Okay. And that entire winter and that entire spring, I didn't breach like 32 miles. Maybe 35 in total. I was running three days a week for the most part. And I was cross-training between with purpose and putting together time. But it certainly wasn't the 60 I just ran last week. And the point being is like you said, it doesn't matter. You can find a way to do it smartly or effectively no matter what. And I looked back. And even on that 37 miles on my 37th birthday, which was then the following year, I was still running 30, 40 miles a week because that's all I could handle at the time. And so what I'm getting at is you are absolutely correct. Like I still found a way to get fitness. It wasn't ideal. But those races went well. So I just pieced it together. And so I agree. And I'm now encouraging the fact that we should pick some stuff and you'll find a way. Because I did it in hindsight. Yeah. And I'm glad you agree. And also I still am bound by the same restraints. Like it can't interfere with Braden's carding. So we can't just say you're going to run the West Virginia trifecta because you said you wanted to. It just doesn't work that weekend. The kid's schedule still has to come first. But even if we don't decide today, we just have to decide relative. Well, what's on your radar then? Talk me through it. What comes to mind as of today? Well, I've talked way too many hours about High Rocks and that I'm not happy with the time that I have to do another. So it just has to happen. So Chicago Fall High Rocks is non-negotiable. It currently falls on a weekend. We don't have anything. Lock it in. That one as soon as I register for that race. Yeah, it's like November. I don't even know. Okay. Okay, so that. And then what about your mile races this summer? Well, I was getting to the point where I didn't want to do them anymore because the lead-in isn't perfect or whatever, which means I think I need to do all of them. So we have the Wisco Mile. By the time I get home, it'll be like five. Five or five, probably. And then a few weeks after that, races I'll meet with their back-to-back days. And then the July 4th Mile. So that has four. And I've just been jonesing for an ultra, so I need to just find an ultra to run. And then the weekend after Chicago, I'll run doubles with someone I work with down in Dallas. So I think that'll be. Okay. Well, it's shaping up then. And it'd be great to find an OCR race. I assume the interest level logistically for coming up my way for a lake weekend in the 4th of July trail race would be tough to pull off. Yes. It doesn't mean it can't happen next year, but this year I don't think we. So if you pick these races, yeah, I don't know if I'll be racing it. It would be something where maybe we'd run together. I don't know. I have grandma's two weeks before, so I haven't decided. I'm registered, but we'll see where I'm at. I don't want to force it. But okay, so if you're talking, so you have miles, what, I mean, your first mile would be in June, wouldn't it? Yeah, June 20-something. Okay. And then you have, like, basically you're going to have a gap to fill in, like, August, September. Yeah. Yeah. And that's a great time for local trail race. What's the options? I don't know. I'm not entirely sure there. But there's a fairly, there's a big UFC fight on last weekend, and there were, we've had a series of retirements lately. I say we, the sport, UFC and people who care about it. We've had a series of retirements of people that were part of the old guard, people that were started fighting when I was in college. We've had, like, three retirements in the last month. But it's very interesting to watch old fighters because sometimes they just lose the ability to let it go, to just pull the trigger and let their punch. They're still strong. They're still pretty quick. They still see things. But they do a lot of, like, start and stop and the punch never comes. And afterwards they're frustrated with their performance. And it's just a thing that seems to happen to old fighters is they stop being able to just pull the trigger. And that has absolutely become a thing for me. I'm just. Well, yeah, and the longer you stay away from it. Yeah. Yeah. For sure. I don't want it to go a single week further. Yeah. Okay. My worry is, not my worry, but, like, I am, the longer I've done this, and this is my own personal bias, that I, like, start to look at, like, training and racing and fitness from, like, a strength perspective. Like, if I have to choose fast or, like, you know, long grindy or short and stingy, I'm going to choose long and grindy and I can always whittle it down later. And so, like, are the miles out of order, out of place, or because it's your comfort zone, it's, like, not comfort zone, but because they're not as scary, too, that's a good place to start. They are scary. And they're scarier now that there have been weeks of work that didn't get accomplished. I think it'd be, you're right, it'd be the wrong thing to focus on. And so I think that that's, so I think it's prepare for what's next and just do, like, a minimum, minimum effective dose sprinkled in there along the way and just hit it with what you have when you get there. And that's part of paying the price for procrastination. Yeah. I think you should find, let's say you end up picking an ultra to chase eventually, I think you need to find some sort of trail race of some sort of legit distance, legit meaning, like, it's going to take you well over an hour, right, to pursue. And you need to find that sometime in, like, August. Anything come to mind? Not off the top of my head, but we have the Kettle Series, we have the Golden, what do they call it, the Golden Kettle Series for Kettle Moraine in Wisconsin. We have races, and they all fall on that time, like, hour 20 to two hours or so. Yeah. And what's, like, the worst thing that happens, right, like, on race day itself? Like, heaven forbid you go out and you get humbled, or, hey, maybe you always say you're a gamer and you generally maybe outperform your fitness. Like, what's the worst thing that could happen on race day itself? Nothing worse than not racing in the first place, right? Like, what's a bad performance due to me that's worse than continually not getting to a start line? When's the last start line you towed? I'm forgetting. Probably ran a race, a doubles with Jack Bauer last year, early last year. When was that? I ran two races last year. Two, yeah. But you were coming back from injury and that was a whole thing. Right. But I got surgery and solved that. Not right now. At some point. Not right now, you're not. Uh-huh. So this isn't a sad story. This isn't a pity party. It's just if I were watching me, I'd be like, listen, we get it. You're not going to race. Why? Don't even bother talking about 25 bucks for this mile. I'm going to show up, right? Most people are like that. So have you actually registered? Is that a done deal? It's going to have to be. Otherwise, this is the nail in the coffin. If at this point it doesn't, if it continues to not happen, it's just not happening. It's just not going. Is there an internal pressure like this? I'm a fraud if I go run a slow mile or I go DNF an ultra or something. And I ask out of the lens that like you're shaking your head no? No, I don't think so because I feel more of a fraud if I'm not racing. But my job is to talk about and coach others too. And I've had enough flashes of things getting fit briefly or doing something that I believe I can run. So even if I go out and have a poor one, to me it'll just be like, yeah, it's not enough time. But it'll be there. So now it's just time to make that optimistic in me put up or shut up. You remember like in college or in the strong pursuits of your OCR, like Spartan days, it was like it's just what you did. Like no start line was scary because it was like your new normal, right? It's just like what we did. It's like brushing your teeth. You showed up, you raced. And like the further you stay out of the sun, the more being in the sun for a while scares you. And it can't be tolerated. And like you've been out of the sun for a long time, so to speak. So like, yeah, it's like just getting back, getting into a rhythm. Like you may be a subject study, and I hate to say it. I guess where would you be if it was like, you know what, I'm going to pick a stupid road race or whatever trail race I can find. I'm going to do it every other week for the next eight weeks. You might end up in like a spot that you're like, of course. Like now I've greased that groove. I feel like there's a place for that for certain people when they're coming back. What are your thoughts on that? Honestly, I believe any single thing will be effective at this. It's just something. Did you expect to feel this way when you left on this trip? Has it been brewing? I got a – the first hint I really got of it was doing those intervals. Like I like doing this kind of thing, but why am I having to even crash course to rabbit a race? What is this world where I don't feel like I have enough fitness to run 50% of the race? This is dumb. But I did not expect the travel part. I always look forward to traveling for the – I like jetting off. It feels like it just crescendos at the race, but it starts leaving the house. I like the process of air travel. It wasn't that, and it was because there was no competition. Now it was a chore. Very interesting. That's interesting. See, I don't enjoy race travel whatsoever. Put me somewhere and make me a ball of nerves and then confine me to a little 24-inch wide seat and not being able to move for hours. Like when I'm anxious and fidgety and anticipation, that's like – it's kind of my hell on earth actually. It just kind of does it for me. I love that where suddenly you get a little jolt of nerves or energy and you're like, no, no, no, not yet. Hold that in. It's just that the whole process fills my cup. I think I race better out of a hotel room than I do my own bed, and I don't think that's the case for me. Yeah, you do well out of sorts, I feel like. The routine is what's getting you in – yeah. The routine is what's getting you in trouble right now. The routine of the kids' activities taking priority, the routine of making sure your athletes are taken care of, the routine of dad life and coach life, right? Like that's probably to a hindrance almost, right? For sure. I would think. There's really only one way this works, and that is that I have to, and I've said this before, but I've tried some other things. It has to be a morning pursuit with PM doubles. It can't be a PM pursuit with morning doubles. The evenings get away so quickly in my life. I'm not saying my life is complicated. I'm saying that as soon as that window starts to get infringed upon, the night is gone, and it cannot be relied upon. I can't be relied upon for that. So it must be an AM thing with periodic PM sessions. It doesn't have to be. What's your wife think of all this? She's going to love it. Has your – Well, no. Has your wife – She's going to sign up or something. She does. So you guys have talked about this? Yeah. Yeah. She told me the other day, you just got to start training for – She met me when I was all in on college athletics, and that hasn't changed in our entire relationship until the last four years. So you remind me, like, that was an attractive part of you. Yeah, being a good dad is not sexy at all, huh? Different type. Nothing like Bracken Crocker on the indoor track doing strides in basketball shorts. That is a sight that will get anybody wound up. That's fishing with dynamite. All right. So what do we do here, Bracken? What do we do? I think that's enough. I think we wrap up by talking about the person who really is racing. You're within a month now of a marathon. No, I still got six weeks, yeah. Six? I thought it was five. I got six weeks. It's so – it's later than you think. It's like June 21st, so it's a ways. But you're starting to get to that point. Where it matters. It always matters. Where you have a limited amount of time to build things, and then you'll reach don't screw it up stage. Yeah. Yeah, and this week I think is a back off the flame a little bit. I think I need to take a lower volume week to charge back up for another two- or three-week push and then a gradual landing of the plane in is where I think I'm. I met my goal is to run two 22-milers as my long runs is sort of my plan. I went 20 this last week in a progression style and ended up averaging 5.59 pace for the 20-miler, which felt pretty good. I worked pretty hard towards the end in hindsight, which is why I think I was fried today. But, yeah, the idea is to work up to two 22s, and I want that last 22 to be three weeks out is the idea, and I think I've timed it out in my head correctly, and then we'll cruise in. But fitness is good. My stay power right now, like I don't think I'm the fastest 5Ker I've ever been. I'm not far off, but I am like all-day pace is starting to come down on me, meaning like what I feel like I can hold for duration is, yep. And you owe me like $240 because you gifted me a pair of A6 Metaspeed skies like two years ago for my birthday or a year and a half, last year for my birthday. I forget what it was, or Christmas or something. And I've suddenly become in love with that shoe, so I just bought another pair in case I want to use it as my marathon option, which, gasp, I never thought I would say that. So thank you for that. You're welcome. It's a sleeper. It is. It needs to be broken in. That's what I found with that shoe. I need to get 40 miles on it before it does what I want it to, which is very interesting. It takes a while for like almost the foam to break in the way I want it to, whereas like the Alpha feels like it can just shoot you to the moon, step one. It's interesting. All right, Corey Fellows and I were just talking. Corey, you got to – I'm jet-lagged here, so I'm not – but I want to say he has over 500 miles on it. And he says, yeah, I've lost some – On his Metaspeed skies? Great shoe. Metaspeed sky pair. So, Corey, tell me the exact number. Yeah. Maybe it's over 400. But whatever the number is, it's more than you're supposed to get out of it. He's got that out of the skies. The magic's gone. Yeah, they're holding up. Yep. My magic is just about running out on my pair, and I have hundreds of miles in them, but the shoe is still good, I agree. But, yeah, I don't know. Jess and I were talking about yourself bringing this together about like coaching and still wanting to sort of like lead by example, we'll call it, right? Maybe that's the sentiment. And she's like, so you have raced 50Ks, and you've done longer distances, and how many times have I done 20-mile trail runs in training with 5,000 feet of vert? Like that is beyond marathon effort, right? But I've never run a road marathon for metrics and time. And I coach marathoners. I coach a lot of them right now, and I have yet to done it. And so it feels like this is one of the few things I still need to check off for my own like not imposter syndrome, which sounds silly to say because I've trained hard and raced hard and earned some good results. But this one for me feels like it's necessary, almost to put on my coaching resume more than my athlete resume, and I don't know if that's messed up to look at it that way. Not understand what doubling, tripling up double thresholds will really feel like until you've done it. And so you can prescribe it all you want, but until you feel what it feels like to tip over in your build or to ride the line, it's hard to totally trust the athlete. You can do it without it, but the marathons you feel. Yeah, and it's one thing to go out and run 26.2 miles in training at let's call it like it never gets, it's always going to get demanding at some point, no matter the effort level, just due to damage. But it's one thing to go out and run 26 miles, just in quotes, run 26 and go chatty pace and get it done, which is still going to again be difficult. And then it's another thing to literally ride the razor's edge. And that's where the bonk and understanding. We felt it, how many times have you felt that in a mountain race? Where like the button's been pushed terminology. Hopefully that isn't felt. How many OCR races have we done? We've raced that duration, but it's not the same when it's broken strides. The metronome stride is different. What's left on your list? Like what if from like a coaching or athlete perspective, like the things that you think you would still need to check to better understand? Is there anything that jumps out to you? Yeah, road marathon and a 100 or something extremely long. And the road marathon. You've done all the trail races, you've done ultras, you've raced 5Ks, you've raced miles, you've raced, I mean, you dedicated your life to racing for a long sector of it. Like six years of your life was just in and out of racing constantly, season after season. People may forget that, especially newer listeners, but like there's a lot of body of work and lessons learned on your resume. But yeah, I can't ever think of you getting, not that you need to, but getting on the roads and doing something in that regard longer than like a 5K. Yeah, I've ran three halves with Lisa. I've paced her, but I've never raced a half. Road running, the longest I've raced is a six mile. A six mile distance is brutal. Yeah, it's rough. I've run a pancake flat 22 mile race. I don't think 50Ks count. I do not think they count towards, what, four under? Under four miles? Oh no, under five miles. I don't think it counts. Like a trail 50K doesn't count. Trail 50K doesn't count. What 22 miler did you do? Not road, but that pancake flat, a trail. I think it was the Lake Geneva. Yeah, they used to have an official. Well, I think the next call to action, luckily for me, I have my sights set on one thing, so I know what's coming next. I have two races booked after Grandma's, which is a 25K trail race, and then potentially the US 50K champs out in California, which I have registered for. So those are on my list. I think my list is I don't need to do anything with mine yet. But what do you think about, so give you the rest of this week, get back, because you don't get back until the end of the weekend from your trip. You can soak up how you feel at the race, the interactions. Are you feeling inspired or uninspired? I think there'll be more takeaways to come probably, right, from being in that environment. And then let's call it once you're back that week, the trigger is pulled. Registration has been done. Let's decide, or maybe I think the running public would like to hear, all right, because they're invested in our success. I hope so. It feels like it. Actually putting them down, saying it, registered, I'm doing it, and then we hold ourselves to it. I think that would be very powerful, but giving you time to reflect on the weekend and then get that next week back to get it registered by the end of that week. What do you think? I'm on board. Do you ever think, we've had this conversation before, and I'm considering this for myself, and you've said no to this, like a firm no before, like somebody writing programming for you, somebody writing programming for me. I've contemplated doing it just because I can't get out of my own box. Have you ever thought about that? Would that change anything? You haven't had a coach since college, right? Yeah. I'm open to it. I just don't know if that changes anything or not. I don't know. But yeah, I'm open to it. I feel like you can't be a good teacher if you can't be a good student first. And we were both, I was an excellent student when I was being coached back in college, and even under leaderboard under you. Were you a good student? Yes and no. I think I was a good student when I respected the teacher, and that's an inherent flaw of mine. Yeah, yes and no. At my best, I was a great student. Yeah. What time period? I mean, on and off, depending on the teacher, depending on the week or the month, I suppose. But I think I also probably a little bit of a pain. You know the athlete who seems to change something every week on you that you work with? One or two things, you know? And then you have the athlete who live or die, they'll send you a novel about how to get everything in the way it's supposed to be, even though their week is absolutely insane, but they want to do everything to check the boxes the way they're supposed to. There's like two types, right? But sometimes I wonder if I get in my own way with my programming and I'm missing something just from an outside perspective, especially in the longer stuff. And I may hire somebody one day. I don't know who that would be, but I don't know, just something to think about. What else? Anything else we need to add to this? I think the assignment is clear. We know what to do. Within two weeks, we're going to have them registered. And I think that's step one. Oh, that also, I was gifted a Spartan trifecta pass. And in part of this, looking at schedules, I will not be able. So in order for it not to go to waste, we already have a training plan giveaway. I'll also have a trifecta, Spartan trifecta pass giveaway as well. So if you think you're deserving of it, message Kirk and we'll go from there. Message the running public. Yeah, we're going to give that away, the coaching once you're back and back at home base. I do remember, even though it meant nothing, what did you go to the Michigan race weekend or the, which race weekend did you go to? Just a random Michigan super. And man, that, but didn't you end up winning that race? And I led one step of the race. The last step, right? But it was the right one. Watch track and field. That's how it always goes. All right, well, you sure you don't want to keep that trifecta pass for something rando in the backyard? The problem is I can't guarantee I'm going to find three late year races that work. So it really shouldn't go to waste. It was a very, very generous gift. All right. Well, I think this is ultimately a good place. I'm not trying to spin glass half full or whatever, but like reflection and realization, I think is important. And do you think maybe booking something that requires travel would be a necessary step for you too? I don't know. Honestly, I've bailed out of both. I signed up for New York High Rocks. I signed up for the Seven Sisters Skyline in Ireland. I signed up for Chicago High Rocks. I signed up for a Jacksonville Spartan race a year ago. I've DNS'd every type of race. Getting good at it. And that's the problem. All right. All right. Well, I think I appreciate your introspection. I bet you there's going to be a number of people who can relate to that without question. I think when people went through the COVID year or two and there weren't races available and it was starting back up, yes, people were chomping at the bit, but some people haven't gotten out of it either, truth be told. As in like getting back because it forced them away and then returning seemed like daunting or something. So you're going to have a lot of people checking in, I think, and seeing where you're at. So that's always good. Well, Kirk, thanks for holding out the support this week. I'll be back stateside Sunday as long as flights go according to plan. So where are people going to be able to pick this up after the fact? Do you know? I don't know yet which outlets have this, but no, I don't know. Will it be like on the internet, like on YouTube at least? Oh yeah. Yeah, it will be. Okay. All right, then we'll just, we'll wait in queue. And then doesn't look like another episode this week because you're going to be, I think, internet-less, right? Like out in the middle of nowhere? Yeah, out in the desert. Yeah. So we'll resume next week. We'll get caught up on the ongoings and you'll talk to us about more of your revelations. We'll be back to our normal training Tuesday next week, shtick, and I think that's that. Okay. All right, well, I'll see you soon, Kirk. Yes, good luck with the rest of your travel itinerary. Thank you very much. See you. If anything resonated with you on today's episode and you're curious about taking your training to the next level, check out therunningpublic.com where we have a training plan to fit your needs. Thank you."
}